{
  "about": "O projektu",
  "about_blog": "BLOG",
  "about_blog_1": "Píšete-li rádi, mějte na paměti, že na <a href=':1:'>náš blog</a> je možné vkládat vámi vytvořené tutoriály. Máte-li vlastní blog, na kterém jste napsali něco o Phalconu, můžeme jej také zveřejnit na našich sociálních sítích, abychom dosáhli co nejvyšší publicity. Je-li váš blog v jiném jazyce než v angličtině, chceme jej sdílet a případně i přeložit, pokud to bude možné. Znáte-li nějaké blogy spjaté s PHP, které mají zájem prezentovat projekt svým čtenářům, dejte nám prosím vědět.",
  "about_description_1": "Amazing projects need amazing hands. We might not know you just yet, but we think you'd be a great fit for building a better web. Together, we're ready to change the world! Here at Phalcon, we’re building a new generation framework for PHP; we want to give you an amazing performance while helping you develop in an easy and fun way.",
  "about_description_2": "Doufáme, že si Phalcon užíváte stejně jako my. Vždy uvítáme vaši pomoc a spolupráci! <strong>Nemusíte být vývojáři v C, abyste mohli Phalconu pomoci!</strong> Jsou i jiné oblasti, ve kterých můžete přispět:",
  "about_documentation": "DOKUMENTACE",
  "about_documentation_1": "Na <a href=':1:'>github</a> je dostupný repozitář s kódem této stránky. Tento repozitář využíváme jako zdroj dokumentace, která je jen v angličtině.<br /><br /> Korektur, dodatků a vylepšení naší dokumentace si vždy vážíme, takže to jediné, co musíte udělat, je nakopírovat repozitář a váš příspěvek a vytvořit pull request.<br /><br /> Bylo by skvělé, kdybyste mohli pomoci vývojářům, kteří nemluví anglicky, překladem některé části dokumentace do jiných jazyků. Pro naše překlady využíváme <a href=':2:'>:3:</a> a náš projekt naleznete <a href=':4:'>zde</a>",
  "about_donations_sponsoring": "DARY / SPONZORING",
  "about_evangelism": "ŠÍŘENÍ POVĚDOMÍ",
  "about_evangelism_1": "Spousta lidí stále ještě neví, že Phalcon existuje nebo že je opravdu funkční. Jsme si jisti, že mnoha developerům by pomohlo získání povědomí o Phalconu, o jeho principech a o tom, jak jim může být užitečný. Znáte-li jakékoli PHP události nebo setkání, na kterých byste chtěli projekt prezentovat, máte naši plnou podporu. Kdo by se nechtěl dozvědět o nástroji, který revolučně mění vývoj PHP?",
  "about_facebook_page": "Facebooková stránka",
  "about_flying_with_phalcon": "Děkujeme, že lítáte s Phalconem! &lt;3",
  "about_follow_on_gab": "Sledujte nás na Gabu",
  "about_follow_on_twitter": "Sledujte nás na Twitteru",
  "about_google_plus_page": "Google+ stránka",
  "about_official_blog": "Oficiální blog",
  "about_sample_applications": "UKÁZKOVÉ APLIKACE",
  "about_sample_apps_1": "Velké příklady pomáhají ostatním lépe pochopit, jak velké věci mohou být s Phalconem vytvořeny. Neváhejte sdílet repozitáře s ukázkovými aplikacemi, které pomáhají ostatním s jejich prací a také jim dovolí poskytnout vám zpětnou vazbu k vaší práci!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "Všichni milujeme videonávody. Vřele uvítáme, pokud máte trochu volného času a chuti pomoci komunitě vytvořením hezkých výukových videí o kterékoli funkci našeho rozhraní. Pro inspiraci navštivte náš <a href=':1:'>Vimeo kanál</a>.",
  "about_share_experiences_1": "Don’t be shy, feel free to share the ways through which Phalcon was useful to you with the community. If Phalcon is a success case for you, let us share that with the community. Also, discuss what components needed extra work, what you could do easier, what benefits you got by using Phalcon. Although not everything can be implemented immediately, your input on new feature requests can greatly help us shape the future of the project. Your feedback helps us all.",
  "about_share_your_experiences": "PODĚLTE SE O SVÉ ZKUŠENOSTI",
  "about_social_networks": "SOCIÁLNÍ SÍTĚ",
  "about_social_networks_1": "Díky naší touze pracovat stále lépe se Phalcon dennodenně vyvíjí. Sociální sítě jsou v dnešní době součástí našich životů a jsme na nich v kontaktu s ostatními lidmi. Povědomí o projektu Phalcon výrazně zvýší, když budete své zkušenosti s ním sdílet ve vašem sociálním okruhu. Více a více lidí se zapojí do naší komunity, čímž ji posílí, obohatí o nové funkce a popularitu. Lajk, „+1“ nebo sdílení příspěvků, které neustále publikujeme na všech sociálních sítích, vyústí v diskuse o těchto příspěvcích. Lidé, kteří objeví Phalcon skrze vaše interakce, vám poděkují!",
  "about_social_networks_2": "We have a presence in most of the popular social networks. By following us, you are helping us increase the project's visibility:",
  "about_sponsoring_1": "We’re a tiny but effective core team of developers working our tails off. We try to spend as much time as possible on the project. All our passion for this project makes us want to be better every day. Phalcon is open-sourced software and volunteer efforts are needed for its constant evolution. You can help us keep the development active by donating to the project or sponsoring the development. More time and resources dedicated to the project means more activity, more improvement, better support, more amazing features, etc.",
  "about_star_on_github": "Ohodnoťte projekt na Github",
  "about_tests": "TESTY",
  "about_tests_1": "Žádný software není bezchybný. Najdete-li nějakou chybu, neváhejte nám ji nahlásit. Máme testovací sestavu s více než <a href=':1:'>16 000</a> testy. Ale unit testů není nikdy dost. Pomozte nám zlepšit naši testovací sestavu přidáním nových testů nebo vylepšením těch stávajících. Každý přidaný test činí celou platformu stabilnější.",
  "about_thank_you": "DĚKUJEME!",
  "about_thank_you_1": "Chtěli bychom poděkovat všem našim přispěvatelům a členům komunity, že nás tlačí k tomu, abychom z Phalcon udělali nejlepší platformu svého druhu. Vaše slova uznání a angažování se nás ženou k lepším výkonům. Doufáme, že si zasloužíme důvěru, kterou do Phalconu vkládáte, a že předčíme vaše očekávání.",
  "about_translations": "PŘEKLADY",
  "about_translations_1": "Odbouráváním jazykových bariér se snažíme se oslovit tolik developerů, kolik je jen možné. Abychom se vypořádali se všemi slovy a větami, které pro tuto stránku musí být přeloženy, používáme <a href=':1:'>:2:</a>. Repozitář projektu je umístěn <a href=':3:'>zde</a>.",
  "acl": "ACL",
  "acl_1": "Takto můžete vytvořit access control list (ACL):",
  "acl_2": "Vytvořit ACL",
  "acl_3": "Výchozí akce je odmítnutí přístupu - DENY access",
  "acl_4": "Registrujte dvě skupiny, Users jsou registrovaní uživatelé",
  "acl_5": "a hosté jsou uživatelé bez definované identity",
  "acl_description": "Access Control List umožňuje uživatelům přistupovat k modulům, ke kterým mají oprávnění",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Registrujte jmenné prostory, předpony, adresáře a třídy. Využijte automatické načítání událostí a udržte si kontrolu nad tím, které soubory a odkud jsou načítány.",
  "auto_loader_2": "Vytvoří autoloader",
  "auto_loader_3": "Registrujte jmenné prostory",
  "auto_loader_4": "Registrujte autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Poskytuje automatický samonačítací mechanismus tříd PHP pod specifikací PSR-4.",
  "basic_features": "Základní funkce",
  "blog": "Blog",
  "built_with_phalcon": "Vytvořeno s Phalconem",
  "cache": "Cache",
  "cache_1": "Komponenta mezipaměť umožňuje rychlejší přístup k často využívaným nebo již zpracovaným datům. Podporuje celou řadu backendů jako jsou Redis, Memcached, Mongo, Files, Apc a jiné",
  "cache_2": "Nastavte modelům službu mezipaměti",
  "cache_3": "V základním nastavení uchovejte data v mezipaměti jeden den",
  "cache_4": "Nastavení připojení Memcached",
  "cache_description": "Zlepšete svůj výkon s mnoha beckend mezipaměťmi, které Phalcon nabízí",
  "community": "Komunita",
  "consulting": "Porada",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO</a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO</a> congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Od doby, kdy v roce 2003 spatřila naše společnost světlo světa, jsme při vývoji software vyzkoušeli mnoho technologií a přístupů.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO</a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Teď, když jsme získali pozitivní zkušenosti s Phalconem, vám můžeme otevřeně poradit rozhodnout se pro vývoj na Phalconu a můžeme vám pomoci dodat váš na Phalconu vystavěný produkt na trh.",
  "consulting_lezgro_5": "Kontaktujte LEZGRO prostřednictvím naší <a href=':1:'>webové stránky</a>, na které také naleznete ukázky a ocenění naší práce.",
  "consulting_mctekk_1": "MCTekK naskočil do vlaku Phalconu hned první den. Od samého počátku jsme viděli velké výhody, které Phalcon nabízel, a které by mohl nabízet v budoucnu.",
  "consulting_mctekk_2": "Máme s Phalconem bohaté zkušenosti a na jeho jádru jsme vyvinuli bezpočet projektů. Jsme tu, abychom vám poradili s čímkoli, co budete ohledně Phalconu potřebovat ke zlepšení vaší připravenosti, rychlosti a kvality.",
  "consulting_mctekk_3": "Kontaktujte nás prostřednictvím naší <a href=':1:'>webové stránky</a>, kde se můžete podívat na projekty, do kterých jsme se zapojili.",
  "consulting_mctekk_header": "MCTekK již vydal různé špičkové Phalcon projekty, jejichž hlavními přednostmi byl vývoj pro web a mobilní zařízení.",
  "contribute": "Přispějte",
  "contributors": "Přispěvatelé Phalconu",
  "contributors_description": "Phalcon je dennodenně vylepšován naší úžasnou komunitou",
  "crypt": "Crypt",
  "crypt_description": "Zašifruje/dešifruje důležitá data, aby byla chráněna před neautorizovanými třetími stranami",
  "data_and_storage": "Data & úložiště",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon je vystavěn na výkonném, ale snadno pochopitelném principu nazývaném Vkládání závislostí. Služby jednou definujete a spustíte, a pak už je můžete využívat prakticky kdekoli napříč celou aplikací.",
  "dependency_injection_2": "Vytvoření Dependency Injection kontejneru",
  "dependency_injection_3": "Registrace tříd, funkcní a komponent",
  "dependency_injection_4": "Použít ve kterékoli jiné části kódu",
  "dependency_injection_description": "Phalcon\\Di je komponenta implementující vkládání závislostí a lokalizaci služeb a je sama o sobě jejich úložištěm.",
  "discord": "Discord",
  "docs": "Dokumentace",
  "documentation": "Dokumentace",
  "donate": "Podpořit",
  "download": "Stáhnout",
  "download_arch": "Arch Linux",
  "download_arch_1": "PKGBUILD pro ArchLinux je k dispozici <a href=':1:'>zde</a>",
  "download_box_1": "Box #1",
  "download_box_2": "Box #2",
  "download_box_doc_root": "Dokument Root: :1:",
  "download_box_user_pass": "MySQL Uživatel: :1: Heslo: :2:",
  "download_compilation": "Sestavení",
  "download_compilation_1": "Na Linuxu můžete snadno sestavit a nainstalovat rozšíření ze zdrojového kódu.",
  "download_compilation_11": "1. Pro vytvoření rozšíření z C kódu postupujte podle těchto kroků:",
  "download_compilation_12": "2. Přidat extension do souboru php.ini:",
  "download_compilation_13": "3. A restartujeme webový server",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Na žádosti z komunity vydali vývojáři z cPanelu modul, který umožňuje nainstalovat Phalcon na stránky hostované cPanelem. Podrobnější informace naleznete <a href=':1:'>zde</a>. Modul je spravován na <a href=':2:'>Githubu</a>.",
  "download_dependencies": "Závislost",
  "download_dependencies_1": "Although Phalcon does not binary link to other extensions it does use some of them to offer functionality. The extensions used are:",
  "download_dependencies_2": "Není nutné, aby se všechna výše zmíněná rozšíření nacházela v systému s nainstalovaným Phalconem. Můžete si nainstalovat jen ta, která odpovídají vašim požadavkům. Používáte-li například MySQL databázi, můžete si nahrát jen PDO a PDO/MySQL a ignorovat Oracle, SQlite, Postgresql a Mongo.",
  "download_developer_tools": "Vývojářský nástroje",
  "download_devtools_1": "Tyto nástroje jsou sbírkou užitečných skriptů, které slouží k vygenerování kostry kódu. Základní komponenty vaší aplikace mohou být vygenerovány jednoduchým příkazem, což vám umožní pomocí Phalconu snadno vyvíjet aplikace.",
  "download_devtools_composer": "Instalace pomocí Composeru",
  "download_devtools_composer_1": "Nainstalujte composer ve společném umístění, nebo v projektu:",
  "download_devtools_composer_2": "Vytvořte soubor composer.json takto:",
  "download_devtools_composer_3": "Spustit nainstalovaný composer:",
  "download_devtools_composer_4": "Vytvořit symbolický odkaz na phalcon.php skript:",
  "download_devtools_docs": "Dokumentace: <a href=':1:'>Vývojářské nástroje Phalconu</a>",
  "download_devtools_download": "Můžete si stáhnout multiplatformní nástroje pro vývojáře z <a href=':1:'> GitHubu</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Existuje mnoho způsobů, jak můžete využít Phalcon spolu s Dockerem.",
  "download_docker_2": "Naše oficiální obrázky jsou umístěny <a href=':1:'>zde</a>. Vždycky vítáme pull requesty a vylepšení. Repozitář se soubory dockeru je umístěn zde:",
  "download_docker_3": "Pomocí Phalcon-compose můžete vytvořit izolované prostředí s dockerem, které vám umožní využívat Phalcon bez jakýchkoli dalších instalací. Mějte na paměti, že využívání Phalcon Compose vyžaduje ",
  "download_docker_4": "a",
  "download_docker_5": "Služby",
  "download_docker_6": "Phalcon Compose nabízí v základním nastavení tyto služby:",
  "download_docker_7": "Využívání Phalcon Compose je velmi snadné. Představte si, že potřebujete vytvořit aplikaci, která bude umístěna v: ",
  "download_docker_8": "Nyní budeme muset spustit následující příkaz, aby mohla být naše kontejnerová aplikace vytvořena:",
  "download_docker_9": "Výše uvedený příkaz stáhne kostru dockerového prostředí.",
  "download_docker_10": "Proměnné",
  "download_docker_11": "Budete muset vytvořit nový soubor nazvaný",
  "download_docker_12": "v",
  "download_docker_13": "K dispozici je vzorový dokument nazvaný",
  "download_docker_14": "Proměnné v tomto souboru si nastavte podle svých potřeb. Nejdůležitější proměnnou je",
  "download_docker_15": "Název si změňte tak, abyste mohli soubor využívat. V našem případě jsme jednoduše ponechali výchozí název ",
  "download_docker_16": "Otevřete si soubor hosts (<code>/etc/hosts</code>) a vložte takovýto nový řádek:",
  "download_docker_17": "Možná budete chtít upravit soubor <code>docker-compose.yml</code> a odstranit z něj služby, které nebudete využívat. Jak jsme uvedli výše, Phalcon Compose nabízí mnoho služeb a vaše aplikace nemusí některé z nich potřebovat. Odstraněním příslušných služeb ze souboru <code>docker-compose.yml</code> snížíte využívání paměti vašeho prostředí.",
  "download_docker_18": "Budování",
  "download_docker_19": "Nyní můžete vybudovat vaše prostředí.",
  "download_docker_20": "Kontejnery se do vašeho prostředí podle potřeby stáhnou a nastaví.",
  "download_docker_21": "Spuštění",
  "download_docker_22": "Nyní můžete vaše prostředí spustit:",
  "download_docker_23": "Zadejte do vašeho prohlížeče adresu :1: a uvidíte, že vaše prostředí je nastaveno. Nyní můžete ve složce s aplikacemi vyvíjet své aplikace.",
  "download_docker_24": "Vypnutí",
  "download_docker_25": "Když už vaše prostředí není třeba, můžete jej vypnout tímto příkazem:",
  "download_docker_26": "Další informace naleznete na: ",
  "download_examples": "Před-instalovaný příklad",
  "download_examples_1": "The following examples are pre-installed on each vagrant box:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "A port is available for FreeBSD. You only need these few commands to install it:",
  "download_ide_stubs": "IDE pomůcky",
  "download_ide_stubs_1": "Video níže popisuje, jak pro PhpStorm povolit IDE stubs",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Potřebujete pomoc?",
  "download_need_help_1": "Podívejte se na naši <a href=':1:'>stránku podpory</a> se způsoby, jak získat podporu. Uděláme, co je v našich silách, abychom vám pomohli.",
  "download_note": "Phalcon je rozšíření C, takže si budete muset stáhnout odpovídající binární kód pro váš operační systém nebo si jej zkompilovat ze zdrojového kódu.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Balíček je k dispozici <a href=':1:'>zde</a> (děkujeme <a href=':2:'>Mariuszi Łączakovi</a>)",
  "download_requirements": "Požadavky",
  "download_requirements_1": "Musíte mít nainstalované balíky:",
  "download_requirements_2": "PHP 5.x zdroje",
  "download_requirements_3": "GCC kompilátor",
  "download_source_code": "Zdrojový kód: <a href=':1:' target='_download' title='GitHub Repo'>na githubu</a>",
  "download_source_code_switch": "Zdrojový kód (přepněte si prosím na příslušnou vývojovou větev): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps:",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command:",
  "download_ubuntu_2": "Chcete-li nainstalovat starší verzi Phalconu (1.x), využijte tento příkaz PPA: ",
  "download_ubuntu_or_debian": "Ubuntu nebo Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> je vynikající nástroj k vytváření a konfigurování odlehčených, reprodukovatelných a přenosných vývojářských prostředí.",
  "download_vagrant_2": "Využijte libovolný z následujících balíčků k testování nebo vývoji v předkonfigurovaném prostředí s Phalconem.",
  "download_vagrant_boxes": "Vagrant Boxy",
  "download_windows": "Windows DLL knihovny",
  "download_windows_download": "Stáhnout",
  "download_windows_dlls": "Windows DLL knihovny mohou být staženy z naší githubové release stránky <a href=':1:'>zde</a>",
  "download_windows_guides": "Související průvodci",
  "download_windows_guides_wamp": "Instalace na WAMP",
  "download_windows_guides_xampp": "Instalace na XAMPP",
  "download_windows_installation": "Instalace",
  "download_windows_installation_1": "K využívání Phalconu ve Windows si můžete stáhnout DLL knihovnu. Upravte váš soubor php.ini, připojte jej na konec a restartujte váš webový server, aby se rozšíření načetlo. <a href=':1:'>Více zde</a>.",
  "download_windows_note": "Důrazně doporučujeme používat nejnovější verzi PHP odpovídající našim DLL knihovnám, abyste mohli využívat výhod všech funkcí Phalconu.",
  "download_windows_older": "Starší verze",
  "download_windows_stable": "Stable/Master verze",
  "encryption": "Šifrování",
  "encryption_1": "Phalcon nabízí možnost šifrování prostřednictvím komponenty Phalcon\\Crypt. Tato třída nabízí jednoduché objektově orientované wrappery pro šifrovací PHP knihovnu openssl.",
  "encryption_2": "Toto je tajný klíč (32 bajtů).",
  "encryption_3": "Toto je text, který chcete zašifrovat.",
  "events": "Události",
  "events_description": "Rozšiřte většinu komponent v rozhraní nastavením „hook points“, záchytných bodů. Vytvořte své vlastní události a udělejte tak vaši aplikaci flexibilnější a výkonnější",
  "events_management": "Správa událostí",
  "events_management_1": "EventsManager nám umožňuje připojit konkrétnímu typu události listener. Typ události, který nás nyní zajímá, je „dispatch“, odešli. Následující kód filtruje všechny události vytvořené Dispatcherem:",
  "events_management_2": "Vytvořte správce událostí",
  "events_management_3": "Sledujte události vytvořené dispatcherem pomocí zásuvného modulu Security",
  "events_management_4": "Vypořádejte se s výjimkami a nenalezenými výjimkami pomocí NotFoundPlugin",
  "events_management_5": "Přiřaďte správce událostí k dispatcheru",
  "facebook": "Facebook",
  "flash_messages": "Flash zprávy",
  "flash_messages_1": "Využijte flash notifier ke zobrazení notifikací uživatelům ve webové aplikaci:",
  "flash_messages_2": "v tomto formuláři byly chyby",
  "flash_messages_3": "ano! vše proběhlo hladce",
  "flash_messages_4": "toto je upozornění pro uživatele",
  "flash_messages_5": "toto je jen varování",
  "flash_messages_description": "Bleskové zprávy jsou využívány k informování uživatele o stavu akcí.",
  "forms_builder": "Formuláře",
  "forms_builder_1": "Každý prvek ve formuláři může být vykreslen tak, jak developer vyžaduje. Phalcon\\Tag je interně využíván k vytváření správného HTML kódu pro každý prvek a vy můžete přidat další HTML atributy jako druhý parametr v render():",
  "forms_builder_2": "Domů",
  "forms_builder_3": "Telefon",
  "forms_builder_description": "Jednoduše vytvářejte HTML formuláře",
  "forum": "Fórum",
  "gab": "Gab.ai",
  "get_phalcon": "Získejte Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "Inovativní architektura Phalconu z něj dělá nejrychlejší PHP platformu, která kdy byla vyvinuta!",
  "header_tagline": "Komplexní PHP platforma dodávaná jako rozšíření C",
  "high_performance_php_framework": "Vysoce výkonná PHP platforma",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud dodává předplacenou škálovatelnou výpočetní kapacitu v cloudu.",
  "hosting_amazon_ec2_2": "Zvolte si přednastavenou šablonu Amazon Machine Image (AMI), abyste mohli začít okamžitě pracovat. Nebo si vytvořte AMI obsahující vaše aplikace, knihovny, data a přidružená konfigurační nastavení. <a href=':1:'>Více zde</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon je podporován ve všech hostingových balíčcích a programech se sdílenými windowsovými nebo Linux cPanel servery, není třeba žádná instalace nebo konfigurace. ASPnix nabízí celou škálu verzí PHP od 5.2 do 7.2, stejně jako mnoho <a href=':1:' target=\"_blank\">dalších rozšíření.</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "<a href=':1:'>Windows Azure cloud</a> vám pro vaše webové aplikace nabízí vysoce škálovatelný a nastavitelný Windows hosting. Využijte Phalcon, abyste snížili své objektové náklady.",
  "hosting_azure_2": "Pro nainstalování Phalconu postupujte krok za krokem podle návodu v <a href=':1:'>tomto článku na SitePoint</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services:",
  "hosting_digital_ocean_1": "Bleskově rychlá cloudová technologie. Vytvořeno pro developery. Spusťte SSD cloudový server za 55 vteřin. <a href=':1:'>Více zde</a>",
  "hosting_digital_ocean_2": "Začněte podle tohoto <a href=':1:'>tutoriálu</a>",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host nabízí více dostupných a vysoce kvalitních hostingových programů.",
  "hosting_dcthost_2": "V základním nastavení je Phalcon nainstalovaný ve všech jeho sdílených hostingových balíčcích.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit nabízí mnoho hostingových programů (je zde i jeden, který je pro vývojáře – s jistými omezeními – zdarma), které uspokojí potřeby většiny vývojářů, kteří chtějí vyzkoušet Phalcon nebo na něm spustit své aplikace.",
  "hosting_fortrabbit_2": "Nabízí řadu <a href=':1:'>rozšíření</a>, které by uspokojily i ty nejnáročnější projekty.",
  "hosting_fortrabbit_3": "Stabilní verze Phalconu jsou předinstalovány a můžete je aktivovat v administrativním rozhraní.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Nainstalujte Phalcon pomocí standardních instalačních pokynů.",
  "hosting_kinghost_1": "KingHost je jednou z největších brazilských hostingových společností. Od roku 2006 již \nposkytl hosting více než 300 tisícům stránek přibližně 60 tisíc zákazníků. Společnost se sídlem v Porto Alegre (RS) a datovými centry v Brazílii nabízí hostingové služby sdílených serverů, specifické balíčky pro zakázkové vývojáře a projekty v oblasti podnikatelských řešení včetně cloud computingu a dedikovaných serverů. Nabízí také řešení v oblasti digitálního marketingu, jako je e-mail marketing, a bezpečnosti.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Začněte podle tohoto <a href=':1:'>tutoriálu</a>",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Spusťte a spravujte virtuální linuxové servery v Linode Cloud. Získejte v několika vteřinách spustitelný server s linuxovou distribucí, zdroji a rozmístěním uzlů podle vašeho výběru. <a href=':1:'>Více zde</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "Vysoký výkon dedikovaných serverů s ochranou proti hrozbám včetně útoků Distributed Denial of Service (DDoS). Naše vysokokapacitní síť s DDoS ochranou může automaticky ochránit váš dedikovaný server před DDoS útokem až do to výše 4,2 Tbps. <a href=':1:'>Více zde</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloudové servery jsou virtuální počítače s Linuxem nebo s Windows&reg; Serverem spuštěné v Rackspace Cloud. Podle svých potřeb můžete zvyšovat nebo snižovat zdroje jako jsou výkon CPU, velikost paměti a úložiště dat. A nejlepší je, že hradíte přednabitým kreditem. <a href=':1:'>Více zde</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting pro vývojáře. Rychlé servery s kompletním přístupem skrze shell a se všemi vašimi oblíbenými nástroji, které jsou předinstalované a spravované.",
  "hosting_webfaction_2": "Pro nainstalování Phalconu ve WebFaction postupujte podle pokynů uvedených <a href=':1:'>zde</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "Komponenta Phalcon\\Translate pomáhá při vytváření vícejazyčných aplikací. Aplikace, které využívají tuto komponentu, zobrazují obsah v různých jazycích v závislosti na uživatelově volbě jazyka, který aplikace podporuje.",
  "i18n_2": "Zeptej se prohlížeče, který jazyk je nejlepší",
  "i18n_3": "Zjisti, jestli pro tento jazyk máme soubor s překladem",
  "i18n_4": "Vrať se zpět do základního nastavení",
  "i18n_5": "Vrať objekt s překladem",
  "i18n_description": "Jednoduše přeložte své aplikace do mnoha jazyků",
  "installing_phalcon_php": "Instalace Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Připojte se do naší aktivní vývojářské komunity!",
  "join_our_community_description": "Komunita přispívá rozšířeními, pluginy, adaptéry, VM, příklady, zdrojovými kódy... A dalšími způsoby",
  "language_text": "Anglicky",
  "learn": "Učte se",
  "license_new_bsd": "Phalcon je open source PHP platforma <br />vybudovaná jako rozšíření C. Je dostupný pod <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>novou BSD Licencí</a>.",
  "low_overhead": "Nízké režijní náklady",
  "low_overhead_1": "Rozšíření Zephir/C se nahrají zároveň s PHP v průběhu spouštění procesu deamon webového serveru",
  "low_overhead_2": "Třídy a funkce poskytované rozšířením jsou dostupné k využití v jakékoli aplikaci",
  "low_overhead_3": "Kód je kompilovaný a není interpretovaný, protože již byl kompilován pro konkrétní operační systém a procesor",
  "low_overhead_4": "Díky své nízkoúrovňové architektuře a optimalizacím <strong>nabízí Phalcon aplikacím založeným na MVC nejnižší režijní náklady</strong>",
  "low_overhead_description": "Nízké HW nároky v porovnání s tradičními frameworky",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "VÍCE...",
  "mvc": "MVC",
  "mvc_1": "Vytvořte jednoduše a s radostí aplikaci s jedním nebo více moduly. Využívejte souborové struktury, schémata a vzory, které již znáte.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Moduly, komponenty, modely, zobrazení a ovladače",
  "odm_for_mongo": "ODM pro Mongo",
  "odm_for_mongo_1": "Kromě své schopnosti mapovat tabulky v relačních databázích umí Phalcon zařadit dokumenty do databáze MongoDB. ODM nabízí funkce CRUD, události a validace napříč jinými službami.",
  "odm_for_mongo_2": "Kolik je tu robotů?",
  "odm_for_mongo_3": "Kolik je tu mechanických robotů?",
  "odm_for_mongo_4": "Je tu :1: robotů",
  "odm_for_mongo_description": "Mapování objektových dokumentů pro MongoDB",
  "oops": "Houstone, máme problém!",
  "or": "nebo",
  "orm": "ORM",
  "orm_1": "Phalconem poskytované výkonné ORM vám umožní zacházet se záznamy v databázi jako s třídami nebo objekty. MySQL, PostgreSQL a SQLite jsou podporovány hned po instalaci.",
  "orm_description": "Objektově relační mapování",
  "phalcon_team": "Phalcon Tým",
  "phalcon_team_1": "Mnoho dalších lidí",
  "phalcon_team_2": "Phalcon je a vždy byl dílem mnoha dobrovolníků: ",
  "phql": "PHQL",
  "phql_1": "PHQL je vysokoúrovňový objektově orientovaný dialekt SQL, který umožňuje psát příkazy pomocí standardizovaného jazyka podobného SQL. PHQL je implementovaný jako syntaktický analyzátor (napsaný v C), který překládá syntaxe do cílového RDBMS. K dosažení maximálního možného výkonu nabízí Phalcon syntaktický analyzátor, který využívá stejnou technologii jako SQLite. Tato technologie poskytuje malý paměťový převaděč s nízkou paměťovou zátěží, který je zároveň bezpečným vláknem.",
  "phql_2": "Jméno",
  "phql_description": "Výkonný a bezpečný Phalcon Query Language, PHQL",
  "polling_app": "Dotazníková aplikace vytvořená za méně než 15 minut",
  "queueing": "Řazení do fronty - procesy na pozadí",
  "queueing_1": "Činnosti jako zpracovávání videa, změny velikosti obrázků nebo odesílání e-mailů není vhodné vykonávat online v reálném čase, protože mohou zpomalit načítání stránek a výrazně ovlivnit uživatelský zážitek. Nejlepším řešením je implementace úloh na pozadí. Webová aplikace zařadí úlohu do fronty těch, které jsou vykonávány odděleně.",
  "queueing_2": "Připoj se k frontě",
  "queueing_3": "Přidej tuto úlohu do fronty",
  "queueing_description": "Využijte v Phalconu zabudovaný systém řazení do fronty k plánování úloh a snížení zátěže vašeho webového serveru",
  "resources": "Zdroje",
  "rest": "Rest",
  "rest_description": "V tomto případě můžete ke splnění vašich cílů využít buďto minimální, nebo kompletní verzi aplikace. Navíc je k dispozici výkonná sada HTTP pomocníků.",
  "restful_services": "Služby typu Rest",
  "restful_services_1": "Tvorba REST serverů a aplikací nebyla nikdy snazší. Žádné psaní dlouhých a zbytečných kódů. Jednoduché služby se vejdou do jednoho souboru.",
  "restful_services_2": "Vrácení dat ve formátu JSON",
  "roadmap": "Plán",
  "router": "Router",
  "router_1": "Směřování tak, jak má být. Nic víc. Nic méně.",
  "router_2": "Vytvoření routeru",
  "router_3": "Definice routy",
  "router_description": "Phalcon\\Mvc\\Router nabízí schopnost pokročilého směřování.",
  "sample_applications": "Ukázková aplikace",
  "see_for_yourself": "Posuďte sami...",
  "sharding": "Tříštění",
  "sharding_1": "Připojení modelů do různých databází",
  "sharding_2": "Tato služba vrátí MySQL databázi",
  "sharding_3": "Tato služba vrátí PostgreSQL databázi",
  "sharding_description": "Připojujte, ukládejte a načítejte data z mnoha databázových systémů zároveň",
  "slack": "Slack",
  "something_went_wrong": "Něco se pokazilo :(",
  "sponsored_by": "Sponzorováno",
  "sponsors": "Sponzoři",
  "sponsors_and_supporters": "Sponzoři a podporovatelé",
  "sponsors_and_supporters_upper": "SPONZOŘI A PODPOROVATELÉ",
  "sponsors_become_patron": "Staňte se Patronem!",
  "sponsors_description_1": "Těm, kteří by chtěli sponzorovat naši práci a další rozvoj Phalconu, nabízíme různé varianty sponzorství, které budou vyhovovat každému rozpočtu. Sponzorování naší práce nám umožňuje projektu věnovat více času, rychleji reagovat na chyby, nabízet nové funkce a zajistit stabilitu projektu.",
  "sponsors_our_great_sponsors": "Toto jsou naši sponzoři! Děkujeme vám!!",
  "stack_overflow": "Stack Overflow",
  "store": "Obchod",
  "support": "Podpora",
  "support_discord": "Připojte se k Phalconu na <a href=':1:'>Discordu</a>",
  "support_documentation_1": "Využijte prosím nejdříve :1:. Abyste nalezli to, co hledáte, můžete využít i funkci hledání v našich dokumentech. Kdyby vaše otázka zůstala nezodpovězena, níže naleznete další možnosti.",
  "support_download_page": "stránka ke stažení",
  "support_note_1": "Naše skvělá komunita a přispěvatelé budou rádi, když vám budou moci pomoci! Pro získání podpory prosím využijte těchto komunitních zdrojů informací.",
  "support_note_2": "Mnoho bugů se objeví proto, že uživatelé nepoužívají nejnovější verzi. Navštivte prosím :1:, stáhněte si nejnovější dostupnou verzi (nebo si ji zkompilujte) a ověřte, zda problém, který jste objevili, je opravdu bug.",
  "support_phalcon_forum": "Otázky směřujte na <a href=':1:'>oficiální fóra</a>",
  "support_please_note": "Please note:",
  "support_please_note_1": "Stack Overflow není koncipovaný jako podpora Phalconu",
  "support_please_note_2": "Nehlaste sem prosím nové bugy. K tomuto účelu prosím využijte <a href=':1:'>issue tracker</a> na Githubu",
  "support_please_note_3": "Nežádejte zde prosím o nové funkcionality. K tomuto účelu prosím využijte <a href=':1:'>issue tracker</a> na Githubu",
  "support_please_note_4": "Ujistěte se, že jste ke své otázce přidali tag „phalcon“",
  "support_please_note_5": "Ujistěte se, že jste „Phalcon“ v otázce zmínili",
  "support_reporting_a_bug": "Hlášení chyb",
  "support_reporting_a_bug_0": "Pokud stále ještě věříte, že jste objevili bug, vytvořte prosím <a href=':1:'>issue</a>",
  "support_reporting_a_bug_1": "Když vyčerpáte všechny možnosti výše, nahlaste prosím bug pomocí <a href=':1:'>issue tracker</a> na Githubu.",
  "support_slack": "Méně aktivní, ale fungující komunita je na <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Dalším způsobem je položit otázku na <a href=':1:' target='_blank'>Stack Overflow</a> využít při tom tag <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Naše účty na sociálních sítích jsou: <a href=':1:'>Gab.ai</a> , <a href=':2:'>Twitter</a>, <a href=':3:'>Facebook</a> a <a href=':4:'>Google+</a>",
  "support_us": "Podpořte nás",
  "team": "Tým",
  "team_andres_1": "Andersovi nejsou open source projekty cizí. V posledních devíti letech vytvořil a publikoval PHP frameworky a věnoval se své hlavní vášni – vývoji webových stránek.",
  "team_andres_2": "Hlavním cílem Andrease, držitele ocenění TRC35, je vždy pro každou činnost vybrat a implementovat nebo využít ten nejvhodnější nástroj, obvykle z pohledu výkonu. Proto přišel v roce 2011 s novou myšlenkou: vytvořit nový druh platformy pro PHP vývojáře, takový, který se zaměřuje na využitelnost, funkcionality a hlavně výkon.",
  "team_andres_3": "Skrze tento inovativní přístup se zrodil Phalcon. PHP platforma napsaná v C, která může vývojářům nabídnout bohatou škálu funkcí a při maximálním výkonu si udržuje nízké zatížení zdrojů.",
  "team_andres_4": "Anders je jedním z hlavních vývojářů a inspirátorů Phalconu.",
  "team_eduar_1": "Eduar je vývojář v C/PHP s několikaletou praxí s vývojem aplikací. Je jedním ze zakladatelů a vedoucích vývojářů projektu Phalcon, který začal v roce 2011.",
  "team_eduar_2": "Podílí se na všech oblastech vývoje od designu platformy přes dokumentaci a nástroje pro vývojáře až po vnitřní funkce jádra. Pohání ho fascinace frameworky, jazyky a novými technologiemi.",
  "team_eduar_3": "Eduar má rád sci-fi filmy a občas si zahraje fotbal.",
  "team_nikolay_1": "Nikolay už webové aplikace vyvíjí více než 10 let. Zajímá se zejména o vysoce výkonné a komplexní stránky a designy.",
  "team_nikolay_2": "Nikolay pracuje s open source projekty už dlouho a využívá je, kdykoli to požadavky umožní. A tak začal ve svém volné čase komunitě její úsilí splácet větvením projektů, nabízením změn architektury a zlepšovacími návrhy a jejich uskutečňováním. Je nápomocen při vylepšování open source CMS projektů, které mají u komunity pozitivní ohlas.",
  "team_nikolay_3": "His continuous involvement with open source projects has helped him advance his technical knowledge while abiding by the give back to the community mentality.",
  "team_nikolay_4": "Nikolay je vášnivým podporovatelem maximalizace výkonu webových aplikací. Po představení Phalconu se rozhodl do projektu vstoupit, začít Phalcon využívat a šířit o něm informace. Své úsilí směřuje do ruské komunity a nabízí dokumentace rusky mluvícím vývojářům.",
  "team_nikolay_5": "Mezi jeho přínosy patří: Ruská lokalizace hlavní stránky (<a href=':1:'>http://www.phalcon.ru</a>), ruská lokalizace repozitáře s dokumentací (<a href=':2:'>http://docs.phalconphp.ru</a>), neustálé úpravy a opravy anglické dokumentace a skupina na sociální síti Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos se již v oblasti IT pohybuje více než 20 let. Svět PHP poznal v roce 2000 a od té doby jej využívá ve svých osobních projektech i v projektech svých zaměstnavatelů.",
  "team_nikos_2": "Miluje objevování nových technologií a způsobů, jak je integrovat do stávajících aplikací, aby tak využil výhod, které nabízejí.",
  "team_nikos_3": "Je vášnivým podporovatelem programování řízeného testy (Test Driven Development – TDD). Vždy se snaží, aby jeho kód celý vznikl touto metodou.",
  "team_nikos_4": "Nikos' continuing interest in new and innovative technologies breaking out of the norm introduced him to Phalcon. He joined the core team and his tasks mainly involve coordination of NFRs and bug fixes, help with tests, documentation and the incubator. Nikos is also responsible for maintaining the Windows DLLs for the project and offers support whenever possible.",
  "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
  "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
  "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
  "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Šablony (Volt)",
  "template_engine_volt_1": "Volt je velmi rychlý, designérům přizpůsobený šablonový jazyk napsaný v Zephir/C pro PHP. Nabízí vám řadu pomocníků pro snadné psaní vizuálů. Volt je integrovaný do ostatních komponent Phalconu, ale můžete jej využít i jako samostatnou komponentu pro vaši aplikaci.",
  "template_engine_volt_description": "Vykreslovací jádro šablon inspirované Jinja, ale vytvořené v C pro PHP",
  "template_engines": "Šablonovací systémy",
  "template_engines_1": "Vizuály představují uživatelské rozhraní vaší aplikace. Často jde o HTML soubory s vloženým PHP kódem, který provádí výhradně úkoly spjaté se zobrazováním dat. Vizuály zajišťují poskytování dat internetovému prohlížeči nebo jinému nástroji, který je využíván ke kladení požadavků na vaši aplikaci.",
  "template_engines_description": "Vizuály představují uživatelské rozhraní vaší aplikace",
  "testimonials": "Ověření",
  "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits:  ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1хP4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing: )  Michael.",
  "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing! Best regards, Nikita Vershinin, Lead Developer, Kolesa.kz and krisha.kz",
  "testimonials_3": "Phalcon Team, The framework you guys have created is amazing. I've never used a framework that has combined speed, efficiency, brevity, and naturality all in one package. I intend on championing and contributing back to the project in any way that I can. I embarked recently on an ~800 hour project and am happy to say that we are using Phalcon Framework. Bravo. Brian Seymour",
  "testimonials_4": "Ahoj lidi! Zrovna jsem narazil na Phalcon a je prostě úžasný! Jen jsem vám chtěl říct, jak skvělí jste! Takže díky za tuto platformu a pokračujte v dobře odváděné práci! Ivan Penchev",
  "testimonials_5": "Ahoj lidi! S Phalconem jsem napsal jednoduché zkracovátko URL adres. To je úžasné! Opravdu. <a href=':1:'>:2:</a>. Demoverze je zde: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Ahoj týme Phalconu, pomocí vaší platformy jsem vytvořil drobný projekt pro polské uživatele. Musím uznat, že je úžasně výkonná. Gratuluji vám k dobře odvedené práci. Služba určená k ověřování obsahu webových stránek v polštině <a href=':1:'>:2:</a>",
  "testimonials_7": "Ahoj lidi! Jen jsem se s vámi chtěl podělit o poslední verzi našeho starého projektu – <a href=':1:'>:2: </a>. Přechod na Phalcon nám v porovnání s předchozí platformou umožnil snížit zátěž serverů na polovinu, což je skvělé!",
  "testimonials_description": "Níže je sbírka referencí a úspěchů vás, vývojářů a uživatelů Phalcon PHP. E-maily s vašimi úspěchy rádi přijímáme a budeme je uveřejňovat na našem blogu. Chcete-li nám popsat váš úspěch nebo se s námi spojit, neváhejte nám napsat e-mail na <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Zobrazit/skrýt navigaci",
  "transactions": "Transakce",
  "transactions_1": "Když proces provádí více databázových operací, může být důležité, aby byl každý krok úspěšně dokončen, aby tak mohla být udržována integrita dat. Transakce nabízí možnost zajistit, že všechny databázové operace byly úspěšně provedeny předtím, než jsou data vložena do databáze.",
  "transactions_2": "Vytvoř správce transakcí",
  "transactions_3": "Vyžádej si transakci",
  "transactions_4": "Nechej smazat roboty",
  "transactions_5": "Něco se pokazilo, měli bychom transakci zrušit",
  "transactions_6": "Všechno je v pořádku, potvrďme transakci",
  "transactions_7": "Roboti byli úspěšně vymazáni!",
  "transactions_8": "Nezdařilo se. Důvod: ",
  "transactions_description": "Transakce v Phalconu umožňují zabezpečovat integritu dat.",
  "try_phalcon": "Vyzkoušejte Phalcon",
  "tutorial": "Tutoriál",
  "twitter": "Twitter",
  "views_and_frontend": "Náhledy a frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Podívejte se na ukázkové video",
  "zephir": "Zephir"
}