{
  "about": "About",
  "about_blog": "BLOG",
  "about_blog_1": "Píšete-li rádi, mějte na paměti, že na <a href=':1:'>náš blog</a> je možné vkládat vámi vytvořené tutoriály. Máte-li vlastní blog, na kterém jste napsali něco o Phalconu, můžeme jej také zveřejnit na našich sociálních sítích, abychom dosáhli co nejvyšší publicity. Je-li váš blog v jiném jazyce než v angličtině, chceme jej sdílet a případně i přeložit, pokud to bude možné. Znáte-li nějaké blogy spjaté s PHP, které mají zájem prezentovat projekt svým čtenářům, dejte nám prosím vědět.",
  "about_description_1": "Amazing projects need amazing hands. We might not know you just yet, but we think you'd be a great fit for building a better web. Together, we're ready to change the world! Here at Phalcon, we’re building a new generation framework for PHP; we want to give you an amazing performance while helping you develop in an easy and fun way.",
  "about_description_2": "Doufáme, že si Phalcon užíváte stejně jako my. Vždy uvítáme vaši pomoc a spolupráci! <strong>Nemusíte být vývojáři v C, abyste mohli Phalconu pomoci!</strong> Jsou i jiné oblasti, ve kterých můžete přispět:",
  "about_documentation": "DOKUMENTACE",
  "about_documentation_1": "Na <a href=':1:'>github</a> je dostupný repozitář s kódem této stránky. Tento repozitář využíváme jako zdroj dokumentace, která je jen v angličtině.<br /><br /> Korektur, dodatků a vylepšení naší dokumentace si vždy vážíme, takže to jediné, co musíte udělat, je nakopírovat repozitář a váš příspěvek a vytvořit pull request.<br /><br /> Bylo by skvělé, kdybyste mohli pomoci vývojářům, kteří nemluví anglicky, překladem některé části dokumentace do jiných jazyků. Pro naše překlady využíváme <a href=':2:'>:3:</a> a náš projekt naleznete <a href=':4:'>zde</a>",
  "about_donations_sponsoring": "DARY / SPONZORING",
  "about_evangelism": "ŠÍŘENÍ POVĚDOMÍ",
  "about_evangelism_1": "Spousta lidí stále ještě neví, že Phalcon existuje nebo že je opravdu funkční. Jsme si jisti, že mnoha developerům by pomohlo získání povědomí o Phalconu, o jeho principech a o tom, jak jim může být užitečný. Znáte-li jakékoli PHP události nebo setkání, na kterých byste chtěli projekt prezentovat, máte naši plnou podporu. Kdo by se nechtěl dozvědět o nástroji, který revolučně mění vývoj PHP?",
  "about_facebook_page": "Facebooková stránka",
  "about_flying_with_phalcon": "Děkujeme, že lítáte s Phalconem! &lt;3",
  "about_follow_on_gab": "Sledujte nás na Gabu",
  "about_follow_on_twitter": "Sledujte nás na Twitteru",
  "about_official_blog": "Oficiální blog",
  "about_sample_applications": "UKÁZKOVÉ APLIKACE",
  "about_sample_apps_1": "Velké příklady pomáhají ostatním lépe pochopit, jak velké věci mohou být s Phalconem vytvořeny. Neváhejte sdílet repozitáře s ukázkovými aplikacemi, které pomáhají ostatním s jejich prací a také jim dovolí poskytnout vám zpětnou vazbu k vaší práci!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "We all love screencasts. If you have some extra time and want to support the community with some nice videos teaching any of the framework's features, it's very welcome. Check out our <a href=':1:'>Vimeo Channel</a> as a guide.",
  "about_share_experiences_1": "Don't be shy, feel free to share the ways through which Phalcon was useful to you with the community. If Phalcon is a success case for you, let us share that with the community. Also, discuss what components needed extra work, what you could do easier, what benefits you got by using Phalcon. Although not everything can be implemented immediately, your input on new feature requests can greatly help us shape the future of the project. Your feedback helps us all.",
  "about_share_your_experiences": "SHARE YOUR EXPERIENCES",
  "about_social_networks": "SOCIAL NETWORKS",
  "about_social_networks_1": "Phalcon is evolving on a daily basis, through our desire to make it better. Social networks are part of our lives now, and we all interact with others through them. Sharing your Phalcon experience with your social circles will greatly increase the visibility of the project. More and more people will engage in our community, thus making it more powerful, even more feature rich and popular. Like, '+1', share posts that we constantly post on every social network, engage in discussions regarding those posts. People who discover Phalcon through your interactions will thank you!",
  "about_social_networks_2": "We have a presence in most of the popular social networks. By following us, you are helping us increase the project's visibility: ",
  "about_sponsoring_1": "We're a tiny but effective core team of developers working our tails off. We try to spend as much time as possible on the project. All our passion for this project makes us want to be better every day. Phalcon is open-sourced software and volunteer efforts are needed for its constant evolution. You can help us keep the development active by donating to the project or sponsoring the development. More time and resources dedicated to the project means more activity, more improvement, better support, more amazing features, etc.",
  "about_star_on_github": "Star the project on Github",
  "about_tests": "TESTS",
  "about_tests_1": "No software is free of bugs. If you find any, please do not hesitate to tell us. We have a test suite with more than <a href=':1:'>16,000</a> tests. However, unit-tests are never enough. Help us improve our test suite by adding more tests or improve the current ones. Every added test makes the framework more stable.",
  "about_thank_you": "THANK YOU!",
  "about_thank_you_1": "We would like to thank all of our contributors and members of the community for pushing us to make Phalcon the best framework of its kind. Your kind words and engagement is what drives us to do better. We hope to meet and exceed the trust you put in Phalcon.",
  "about_translations": "TRANSLATIONS",
  "about_translations_1": "We are trying to reach as many developers as possible, breaking down the language barriers. We are using <a href=':1:'>:2:</a>, to handle all the words or sentences that need to be translated for this site. The project repository is located <a href=':3:'>here</a>.",
  "acl": "ACL",
  "acl_1": "This is how you can built the access control list (ACL):",
  "acl_2": "Create the ACL",
  "acl_3": "The default action is DENY access",
  "acl_4": "Register two roles, Users is registered users",
  "acl_5": "and guests are users without a defined identity",
  "acl_description": "Access Control List allows users to access the modules they're authorized to",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Register namespaces, prefixes, directories or classes. Take advantage of the autoloader events and maintain full control over what files are loaded and from where.",
  "auto_loader_2": "Creates the autoloader",
  "auto_loader_3": "Register some namespaces",
  "auto_loader_4": "Register autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.",
  "basic_features": "Basic Features",
  "blog": "Blog",
  "built_with_phalcon": "Built with Phalcon",
  "cache": "Cache",
  "cache_1": "The cache component allows faster access to frequently used or already processed data. It supports many backends such as Redis, Memcached, Mongo, Files, Apc and more",
  "cache_2": "Set the models cache service",
  "cache_3": "Cache data for one day by default",
  "cache_4": "Memcached connection settings",
  "cache_description": "Improve your performance with many of the backend caches that Phalcon provides",
  "community": "Community",
  "consulting": "Consulting",
  "consulting_header": "We have partnered with LEZGRO, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "LEZGRO congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve LEZGRO to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Contact LEZGRO through our <a href=':1:'>website</a>, where you can also see samples and testimonials of our work.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Contact us through our <a href=':1:'>website</a>, where you can take a look at the projects we have been involved in.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Contribute",
  "contributors": "Phalcon contributors",
  "contributors_description": "Phalcon is improved everyday by our amazing community",
  "crypt": "Crypt",
  "crypt_description": "Encrypt/Decrypt important data to keep them safe from unauthorized third-parties",
  "data_and_storage": "Data & storage",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon is built upon a powerful yet easy to understand and use pattern called Dependency Injection. Initialize or define services once - and use them virtually anywhere throughout the application.",
  "dependency_injection_2": "Create the Dependency Injector Container",
  "dependency_injection_3": "Register classes, functions, components",
  "dependency_injection_4": "Use anywhere else in code",
  "dependency_injection_description": "Dependency Injection and Location of services and it's itself a container for them.",
  "discord": "Discord",
  "docs": "Docs",
  "documentation": "Documentation",
  "donate": "Donate",
  "download": "Download",
  "download_arch": "Arch Linux",
  "download_arch_1": "There is a PKGBUILD for ArchLinux, available <a href=':1:'>here</a>",
  "download_box_1": "Box #1",
  "download_box_2": "Box #2",
  "download_box_doc_root": "Document Root: :1: ",
  "download_box_user_pass": "MySQL User: :1:  Password: :2: ",
  "download_compilation": "Compilation",
  "download_compilation_1": "On Linux you can easily compile and install the extension from source code.",
  "download_compilation_11": "1. To create the extension from C source follow these steps: ",
  "download_compilation_12": "2. Add the extension to your php.ini: ",
  "download_compilation_13": "3. Finally, restart the webserver",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "After requests from the community, the cPanel developers released a custom module that allows for installation of Phalcon in cPanel hosted sites. Information can be found <a href=':1:'>here</a>. The module is maintained in <a href=':2:'>Github</a>.",
  "download_dependencies": "Dependencies",
  "download_dependencies_1": "Although Phalcon does not binary link to other extensions it does use some of them to offer functionality. The extensions used are: ",
  "download_dependencies_2": "It is not necessary for all the above extensions to be present in the system that has Phalcon installed. You can only install the ones that meet your needs. For instance if you use a MySQL database, then you can only load PDO and PDO/MySQL ignoring the Oracle, SQlite, Postgresql and Mongo.",
  "download_developer_tools": "Developer Tools",
  "download_devtools_1": "These tools are a collection of useful scripts to generate skeleton code. Core components of your application can be generated with a simple command, allowing you to easily develop applications using Phalcon.",
  "download_devtools_composer": "Installing via Composer",
  "download_devtools_composer_1": "Install composer in a common location or in your project: ",
  "download_devtools_composer_2": "Create the composer.json file as follows: ",
  "download_devtools_composer_3": "Run the composer installer: ",
  "download_devtools_composer_4": "Create a symbolic link to the phalcon.php script: ",
  "download_devtools_docs": "Documentation:  <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "You can download or clone a cross platform package containing the developer tools from <a href=':1:'>Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "There are many ways that you can use Phalcon with Docker.",
  "download_docker_2": "Our official images are located <a href=':1:'>here</a>. We always welcome pull requests and improvements. The repository for the docker files is located here:",
  "download_docker_3": "With Phalcon-compose you can create an isolated environment with docker, that will allow you to use Phalcon without any additional installations. Note that using Phalcon Compose, requires ",
  "download_docker_4": "and",
  "download_docker_5": "Services",
  "download_docker_6": "Phalcon Compose offers the following services by default:",
  "download_docker_7": "Phalcon Compose is very easy to use. Assume that you need to create an application that will be located in: ",
  "download_docker_8": "We will now need to run the following command for our container application can be created:",
  "download_docker_9": "The above command will download the skeleton of the docker environment.",
  "download_docker_10": "Variables",
  "download_docker_11": "You will need to create a new file called",
  "download_docker_12": "in",
  "download_docker_13": "A sample file has been provided called",
  "download_docker_14": "Adjust the variables in that file to suit your needs. The most important variable is the",
  "download_docker_15": "Change the name to something you will be able to use. In our case we just leave the default called ",
  "download_docker_16": "Open your hosts file (<code>/etc/hosts</code>) and enter a new line like this:",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Build",
  "download_docker_19": "You can now build the environment.",
  "download_docker_20": "Containers will be downloaded as needed and set up on your environment.",
  "download_docker_21": "Launch",
  "download_docker_22": "You can now launch the environment:",
  "download_docker_23": "Go to :1: in your browser and you will see your environment is set up. You can now develop your application in the app folder.",
  "download_docker_24": "Shutdown",
  "download_docker_25": "To shut down the environment when is no longer needed you can issue the following command:",
  "download_docker_26": "Additional information can be found at: ",
  "download_examples": "Pre-Installed examples",
  "download_examples_1": "The following examples are pre-installed on each vagrant box: ",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "A port is available for FreeBSD. You only need these few commands to install it: ",
  "download_ide_stubs": "IDE stubs",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Need help?",
  "download_need_help_1": "Have a look at our <a href=':1:'>support page</a> for ways to get support. We will do our best to help you.",
  "download_note": "Phalcon is a C extension, so you need to download a binary for your platform or compile it from source code.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "There is a package available <a href=':1:'>here</a> (thanks to <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Requirements",
  "download_requirements_1": "We need some packages previously installed: ",
  "download_requirements_2": "PHP 5.x development resources",
  "download_requirements_3": "GCC compiler",
  "download_source_code": "Source Code:  <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Source Code (please switch to the relevant branch): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps: ",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command: ",
  "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
  "download_ubuntu_or_debian": "Ubuntu or Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> is an excellent tool to create and configure lightweight, reproducible, and portable development environments.",
  "download_vagrant_2": "Use any of the following boxes to test or develop with Phalcon on a pre-configured environment.",
  "download_vagrant_boxes": "Vagrant Boxes",
  "download_windows": "Windows DLLs",
  "download_windows_download": "Download",
  "download_windows_dlls": "Windows DLLs can be downloaded from our Github release page <a href=':1:'>here</a>",
  "download_windows_guides": "Related Guides",
  "download_windows_guides_wamp": "Installation on WAMP",
  "download_windows_guides_xampp": "Installation on XAMPP",
  "download_windows_installation": "Installation",
  "download_windows_installation_1": "To use phalcon on Windows you can download a DLL library. Edit your php.ini, append at the end, and restart your webserver to load the extension. <a href=':1:'>More</a>.",
  "download_windows_note": "We highly recommend you use the latest version of PHP corresponding to our DLLs, so as to take advantage of the full feature set of Phalcon.",
  "download_windows_older": "Older versions",
  "download_windows_stable": "Stable/Master versions",
  "encryption": "Encryption",
  "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
  "encryption_2": "This is a secret key (32 bytes).",
  "encryption_3": "This is the text that you want to encrypt.",
  "events": "Events",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Events Management",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Create an events manager",
  "events_management_3": "Listen for events produced in the dispatcher using the Security plugin",
  "events_management_4": "Handle exceptions and not-found exceptions using NotFoundPlugin",
  "events_management_5": "Assign the events manager to the dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Flash messages",
  "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
  "flash_messages_2": "there were errors in this form",
  "flash_messages_3": "yes!, everything went very smoothly",
  "flash_messages_4": "this is a notice for users",
  "flash_messages_5": "this is just a warning",
  "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
  "forms_builder": "Forms Builder",
  "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
  "forms_builder_2": "Home",
  "forms_builder_3": "Cellphone",
  "forms_builder_description": "Easily create HTML forms",
  "forum": "Forum",
  "gab": "Gab.ai",
  "get_phalcon": "Získejte Phalcon :1:",
  "header_slogan": "Inovativní architektura Phalconu z něj dělá nejrychlejší PHP platformu, která kdy byla vyvinuta!",
  "header_tagline": "Komplexní PHP platforma dodávaná jako rozšíření C",
  "high_performance_php_framework": "Vysoce výkonná PHP platforma",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud delivers scalable, pay-as-you-go compute capacity in the cloud.",
  "hosting_amazon_ec2_2": "Select a pre-configured, templated Amazon Machine Image (AMI) to get up and running immediately. Or create an AMI containing your applications, libraries, data, and associated configuration settings. <a href=':1:'>See more</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Linux cPanel and Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows and Linux cPanel shared web hosting packages and plans, no configuration or installation required! ASPnix offers a variety of PHP versions from 5.2 - 7.2 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "The <a href=':1:'>Windows Azure cloud</a> provides you with highly scalable and manageable Windows hosting for your web apps. Use Phalcon to reduce your instance costs.",
  "hosting_azure_2": "To install Phalcon, follow the step by step procedure in <a href=':1:'>this SitePoint article</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services: ",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
  "hosting_digital_ocean_2": "Follow this <a href=':1:'>tutorial</a> to get started",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host offers multiple affordable and high quality hosting plans.",
  "hosting_dcthost_2": "By default, they have Phalcon installed on all their shared hosting packages.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit offers many hosting plans (there is one for developers and is free - with some limitations) that would satisfy the needs of most of the developers that wish to either try Phalcon or deploy their applications using it.",
  "hosting_fortrabbit_2": "They offer a variety of <a href=':1:'>extensions</a> that would satisfy even the most demanding project.",
  "hosting_fortrabbit_3": "Stable versions of Phalcon are pre-installed, you can activate them from the administration dashboard.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Install Phalcon using the standard instructions of installation.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "Next generation, auto-sizing PaaS for Java, PHP, Ruby, Python, and Node.js apps. Fully isolated self-scaling role-based containers for each customer, including choice of Apache or Nginx, and full range of SQL and NoSQL servers. Pay for resource usage, not server instance size. SSD-powered. UK hosted.",
  "hosting_layershift_2": "Follow this <a href=':1:'>tutorial</a> to get started",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting for developers. Full shell access to fast servers with all your favorite tools pre-installed and maintained for the user.",
  "hosting_webfaction_2": "To install Phalcon in WebFaction, follow the instructions outlined <a href=':1:'>here</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Ask browser what is the best language",
  "i18n_3": "Check if we have a translation file for that lang",
  "i18n_4": "Fallback to some default",
  "i18n_5": "Return a translation object",
  "i18n_description": "Translate your applications to many languages easily",
  "installing_phalcon_php": "Installing Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Come join our vibrant developer community!",
  "join_our_community_description": "Community contributions in Extensions, Plugins, Adapters, VM, examples, source code... and more",
  "language_text": "English",
  "learn": "Learn",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
  "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
  "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "MORE...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM for MongoDB",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "There are :1: robots",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Houston we have a problem!",
  "or": "or",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Phalcon Team",
  "phalcon_team_1": "Many more people",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Name",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Resources",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Restful Services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Returning data in JSON",
  "roadmap": "Roadmap",
  "router": "Router",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Create the router",
  "router_3": "Define a route",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Sample applications",
  "see_for_yourself": "See for yourself...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Something went wrong :(",
  "sponsored_by": "Sponsored by",
  "sponsors": "Sponsors",
  "sponsors_and_supporters": "Sponsors and Supporters",
  "sponsors_and_supporters_upper": "SPONSORS AND SUPPORTERS",
  "sponsors_become_patron": "Become a Patron!",
  "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
  "stack_overflow": "Stack Overflow",
  "store": "Obchod",
  "support": "Podpora",
  "support_discord": "Připojte se k Phalconu na <a href=':1:'>Discordu</a>",
  "support_documentation_1": "Využijte prosím nejdříve :1:. Abyste nalezli to, co hledáte, můžete využít i funkci hledání v našich dokumentech. Kdyby vaše otázka zůstala nezodpovězena, níže naleznete další možnosti.",
  "support_download_page": "stránka ke stažení",
  "support_note_1": "Naše skvělá komunita a přispěvatelé budou rádi, když vám budou moci pomoci! Pro získání podpory prosím využijte těchto komunitních zdrojů informací.",
  "support_note_2": "Mnoho bugů se objeví proto, že uživatelé nepoužívají nejnovější verzi. Navštivte prosím :1:, stáhněte si nejnovější dostupnou verzi (nebo si ji zkompilujte) a ověřte, zda problém, který jste objevili, je opravdu bug.",
  "support_phalcon_forum": "Otázky směřujte na <a href=':1:'>oficiální fóra</a>",
  "support_please_note": "Please note:",
  "support_please_note_1": "Stack Overflow není koncipovaný jako podpora Phalconu",
  "support_please_note_2": "Nehlaste sem prosím nové bugy. K tomuto účelu prosím využijte <a href=':1:'>issue tracker</a> na Githubu",
  "support_please_note_3": "Nežádejte zde prosím o nové funkcionality. K tomuto účelu prosím využijte <a href=':1:'>issue tracker</a> na Githubu",
  "support_please_note_4": "Ujistěte se, že jste ke své otázce přidali tag „phalcon“",
  "support_please_note_5": "Ujistěte se, že jste „Phalcon“ v otázce zmínili",
  "support_reporting_a_bug": "Hlášení chyb",
  "support_reporting_a_bug_0": "Pokud stále ještě věříte, že jste objevili bug, vytvořte prosím <a href=':1:'>issue</a>",
  "support_reporting_a_bug_1": "Když vyčerpáte všechny možnosti výše, nahlaste prosím bug pomocí <a href=':1:'>issue tracker</a> na Githubu.",
  "support_slack": "Méně aktivní, ale fungující komunita je na <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Další možností je položit otázku na <a href=':1:' target='_blank'>Stack Overflow</a> využít při tom tag <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Naše účty na sociálních sítích jsou: <a href=':1:'>Gab.ai</a>, <a href=':2:'>Twitter</a> and <a href=':3:'>Facebook</a>",
  "support_us": "Podpořte nás",
  "team": "Tým",
  "team_andres_1": "Andersovi nejsou open source projekty cizí. V posledních devíti letech vytvořil a publikoval PHP frameworky a věnoval se své hlavní vášni – vývoji webových stránek.",
  "team_andres_2": "Hlavním cílem Andrease, držitele ocenění TRC35, je vždy pro každou činnost vybrat a implementovat nebo využít ten nejvhodnější nástroj, obvykle z pohledu výkonu. Proto přišel v roce 2011 s novou myšlenkou: vytvořit nový druh platformy pro PHP vývojáře, takový, který se zaměřuje na využitelnost, funkcionality a hlavně výkon.",
  "team_andres_3": "Skrze tento inovativní přístup se zrodil Phalcon. PHP platforma napsaná v C, která může vývojářům nabídnout bohatou škálu funkcí a při maximálním výkonu si udržuje nízké zatížení zdrojů.",
  "team_andres_4": "Anders je jedním z hlavních vývojářů a inspirátorů Phalconu.",
  "team_eduar_1": "Eduar je vývojář v C/PHP s několikaletou praxí s vývojem aplikací. Je jedním ze zakladatelů a vedoucích vývojářů projektu Phalcon, který začal v roce 2011.",
  "team_eduar_2": "Podílí se na všech oblastech vývoje od designu platformy přes dokumentaci a nástroje pro vývojáře až po vnitřní funkce jádra. Pohání ho fascinace frameworky, jazyky a novými technologiemi.",
  "team_eduar_3": "Eduar má rád sci-fi filmy a občas si zahraje fotbal.",
  "team_nikolay_1": "Nikolay už webové aplikace vyvíjí více než 10 let. Zajímá se zejména o vysoce výkonné a komplexní stránky a designy.",
  "team_nikolay_2": "Nikolay pracuje s open source projekty už dlouho a využívá je, kdykoli to požadavky umožní. A tak začal ve svém volné čase komunitě její úsilí splácet větvením projektů, nabízením změn architektury a zlepšovacími návrhy a jejich uskutečňováním. Je nápomocen při vylepšování open source CMS projektů, které mají u komunity pozitivní ohlas.",
  "team_nikolay_3": "Jeho dlouhodobé zapojení do open source projektů mu pomáhá zlepšovat si technické znalosti a současně trvale přispívat komunitním myšlenkám.",
  "team_nikolay_4": "Nikolay je vášnivým podporovatelem maximalizace výkonu webových aplikací. Po představení Phalconu se rozhodl do projektu vstoupit, začít Phalcon využívat a šířit o něm informace. Své úsilí směřuje do ruské komunity a nabízí dokumentace rusky mluvícím vývojářům.",
  "team_nikolay_5": "Mezi jeho přínosy patří: Ruská lokalizace hlavní stránky (<a href=':1:'>http://www.phalcon.ru</a>), ruská lokalizace repozitáře s dokumentací (<a href=':2:'>http://docs.phalconphp.ru</a>), neustálé úpravy a opravy anglické dokumentace a vytvořené skupiny na sociální síti Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos se již v oblasti IT pohybuje více než 20 let. Svět PHP poznal v roce 2000 a od té doby jej využívá ve svých osobních projektech i v projektech svých zaměstnavatelů.",
  "team_nikos_2": "Miluje objevování nových technologií a způsobů, jak je integrovat do stávajících aplikací, aby tak využil výhod, které nabízejí.",
  "team_nikos_3": "Je vášnivým podporovatelem programování řízeného testy (Test Driven Development – TDD). Vždy se snaží, aby celý jeho kód vznikl touto metodou.",
  "team_nikos_4": "Nikosovým dlouhodobým zájmem jsou nové a inovativní technologie, které se vymykají normě představené Phalconem. Stal se členem hlavního týmu a jeho úkoly zahrnují převážně koordinaci požadavků na nové funkce (NFR) a opravy bugů, pomoc s testováním, dokumentací a inkubátorem. Nikos je také zodpovědný za správu projektových Windows DLL knihoven a nabízí pomoc všude tam, kde je to možné.",
  "team_paul_1": "Paul se pokládá za šťastného člověka, protože strávil poslední dekádu svého života psaním uživatelsky příjemného software za pomoci open source frameworků a nástrojů, jako je Phalcon. V důsledku toho tráví svůj volný čas snahou o vylepšení FOSS nástrojů a životů vývojářů, jako je on sám. Touží po jednoduchém kódu a přehledném uživatelském prostředí. V Phalconu se zaměřuje na dokumentaci, nová uživatelská prostředí, vztahy s přispěvateli a rozšiřování komunity.",
  "team_paul_2": "Paul nedávno založil vlastní firmu, aby mohl pokračovat ve své vášni, tvorbě intuitivního software s nově vznikajícími technologiemi jako jsou ReactJS, Webpack, Ruby, a Elixir(Erlang). Na svůj stále rostoucí seznam nyní připsal Zephir a Phalcon a rád se stal propagátorem, který obhajuje jejich inovativní funkce.",
  "team_paul_3": "Když se Paul zrovna nevěnuje programování, vydává se po stopách své ženy a rozvíjí svůj zájem o tvorbu videí a videoklipů. Provozuje výukový kanál na YouTube, který je aktuálně zaměřený na Phalcon, tak, jak lektor IT potřebuje.",
  "team_serghei_1": "Serghei už 8 let pracuje jako vývojář Ruby/PHP a specializuje se na vývoj webových aplikací. Jako podporovatel a obhájce programování řízeného chováním (Behavior Driven Development – BDD) je také členem týmu <a href=':1:'>Codeception</a>.",
  "team_serghei_2": "Sergheje naleznete až po krk v inovativních technologiích, skrze které se dostal k Phalconu. Je zodpovědný za koordinaci oprav bugů, testování, vývojářské nástroje, inkubátor a podporu dalších projektů spjatých s Phalconem.",
  "team_serghei_3": "Když Serghei nepracuje, rád sleduje dokumentární a sci-fi filmy a občas hraje Mahjong nebo Go.",
  "team_volodymyr_1": "Volodymyr vyvíjí serverové a webové aplikace přes 20 let. Věnuje se projektování a tvorbě velmi komplexních a vysoce výkonných softwarových aplikací. Volodymyrova vášeň k psaní rychlého, robustního a optimalizovaného software ho přivedla k Phalconu, kde se přidal k týmu vývojářů.",
  "team_volodymyr_2": "Ve svém volném čase si Volodymyr užívá společnosti milované manželky, přispívá open source projektům a studuje cizí jazyky.",
  "template_engine_volt": "Šablony (Volt)",
  "template_engine_volt_1": "Volt je velmi rychlý, designérům přizpůsobený šablonovací jazyk napsaný pro PHP v Zephir/C. Nabízí vám řadu pomocníků pro snadné psaní vizuálů. Volt je integrovaný do ostatních komponent Phalconu, ale můžete jej využít i jako samostatnou komponentu pro vaši aplikaci.",
  "template_engine_volt_description": "Nástroj pro tvorbu šablon inspirovaný Jinja, ale vytvořené v C pro PHP",
  "template_engines": "Šablonovací systémy",
  "template_engines_1": "Vizuály představují uživatelské rozhraní vaší aplikace. Často jde o HTML soubory s vloženým PHP kódem, který provádí výhradně úkoly spjaté se zobrazováním dat. Vizuály zajišťují poskytování dat internetovému prohlížeči nebo jinému nástroji, který je využíván k předkládání požadavků vaší aplikaci.",
  "template_engines_description": "Vizuály představují uživatelské rozhraní vaší aplikace",
  "testimonials": "Ověření",
  "testimonials_1": "Zdravím tým Phalconu! Mám projekt vystavený na Phlacon frameworku. Jmenuje se Guitarama (<a href=':1:'>:2:</a>) a je to katalog kytarových tabulatur a akordů. Web je zaměřený na ruské uživatele a je v ruštině, ale doufám, že nebude problém většinu stránek pochopit. Web byl znovu spuštěn na nové platformě na začátku ledna 2013 a od té doby počet zobrazení stabilně roste. Aktuální denní statistiky: cca 1500 unikátních návštěvníků, 5000 zobrazení stránky. Web běží na starém fyzickém serveru 1хP4-3Ghz, 4GB RAM. Ještě jednou vám děkuji za skvělý framework a za všechno, co děláte :) Michael.",
  "testimonials_2": "Ahoj týme Phalconu. Rád bych se s vámi podělil o naše úspěchy při využívání Phalconu v projektech <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a>, nejnavštěvovanějších a nejvytíženějších stránkách v Kazachstánu, které se umístily v TOP 10 inzertních stránek v CIS. Oba weby pracují jako RESTful-like API vytvořené v Phalcon\\Mvc\\Micro. Ve špičce zpracovává API něco kolem 400 req/sec, a to ještě není limit. Přesun na Phalcon nám umožnil zkrátit čas na vygenerování odpovědi a snížit nároky na CPU a RAM, stejně jako šetří čas na vývoj. Phalcon budeme využívat i v našich nových projektech. Děkujeme za skvělou práci, kterou odvádíte. S pozdravem Nikita Vershinin, hlavní vývojář kolesa.kz a krisha.kz",
  "testimonials_3": "Týme Phalconu, framework, který jste vytvořili, je úžasný. Nikdy jsem nepoužíval framework, který v jediném balíčku kombinuje rychlost, výkonnost, úspornost a přirozenost. Mám v úmyslu projekt podporovat a přispívat do něj tak, jak jen budu moci. Nedávno jsem se pustil do asi osmisethodinového projektu a jsem rád, že mohu říct, že využíváme Phalcon framework. Smekám před vámi. Brian Seymour",
  "testimonials_4": "Ahoj lidi! Zrovna jsem narazil na Phalcon a je prostě úžasný! Jen jsem vám chtěl říct, jak skvělí jste! Takže díky za tuto platformu a pokračujte v dobře odváděné práci! Ivan Penchev",
  "testimonials_5": "Ahoj lidi! S Phalconem jsem napsal jednoduché zkracovátko URL adres. To je úžasné! Opravdu. <a href=':1:'>:2:</a>. Demoverze je zde: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Ahoj týme Phalconu, pomocí vaší platformy jsem vytvořil drobný projekt pro polské uživatele. Musím uznat, že je úžasně výkonná. Gratuluji vám k dobře odvedené práci. Služba určená k ověřování obsahu webových stránek v polštině <a href=':1:'>:2:</a>",
  "testimonials_7": "Ahoj lidi! Jen jsem se s vámi chtěl podělit o poslední verzi našeho starého projektu – <a href=':1:'>:2: </a>. Přechod na Phalcon nám v porovnání s předchozím frameworkem umožnil snížit zátěž serverů na polovinu, což je skvělé!",
  "testimonials_description": "Níže je sbírka referencí a úspěchů vás, vývojářů a uživatelů Phalcon PHP. E-maily s vašimi úspěchy rádi přijímáme a budeme je uveřejňovat na našem blogu. Chcete-li nám popsat váš úspěch nebo se s námi spojit, neváhejte nám napsat e-mail na <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Zobrazit/skrýt navigaci",
  "transactions": "Transakce",
  "transactions_1": "Když proces provádí více databázových operací, může být důležité, aby byl každý krok úspěšně dokončen, aby tak mohla být udržována integrita dat. Transakce nabízí možnost zajistit, že všechny databázové operace byly úspěšně provedeny předtím, než jsou data vložena do databáze.",
  "transactions_2": "Vytvoř správce transakcí",
  "transactions_3": "Vyžádej si transakci",
  "transactions_4": "Nechej smazat roboty",
  "transactions_5": "Něco se pokazilo, měli bychom transakci zrušit",
  "transactions_6": "Všechno je v pořádku, potvrďme transakci",
  "transactions_7": "Roboti byli úspěšně vymazáni!",
  "transactions_8": "Nezdařilo se. Důvod: ",
  "transactions_description": "Transakce v Phalconu umožňují zabezpečovat integritu dat.",
  "try_phalcon": "Vyzkoušejte Phalcon",
  "tutorial": "Tutoriál",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Watch the demo video",
  "zephir": "Zephir",
  "telegram": "Telegram",
  "mewe": "MeWe",
  "parler": "Parler",
  "stack_overflow": "Stack Overflow"
}
