{
  "about": "O projektu",
  "about_blog": "BLOG",
  "about_blog_1": "Píšete-li rádi, mějte na paměti, že na <a href=':1:'>náš blog</a> je možné vkládat vámi vytvořené tutoriály. Máte-li vlastní blog, na kterém jste napsali něco o Phalconu, můžeme jej také zveřejnit na našich sociálních sítích, abychom dosáhli co nejvyšší publicity. Je-li váš blog v jiném jazyce než v angličtině, chceme jej sdílet a případně i přeložit, pokud to bude možné. Znáte-li nějaké blogy spjaté s PHP, které mají zájem prezentovat projekt svým čtenářům, dejte nám prosím vědět.",
  "about_description_1": "Amazing projects need amazing hands. We might not know you just yet, but we think you'd be a great fit for building a better web. Together, we're ready to change the world! Here at Phalcon, we’re building a new generation framework for PHP; we want to give you an amazing performance while helping you develop in an easy and fun way.",
  "about_description_2": "Doufáme, že si Phalcon užíváte stejně jako my. Vždy uvítáme vaši pomoc a spolupráci! <strong>Nemusíte být vývojáři v C, abyste mohli Phalconu pomoci!</strong> Jsou i jiné oblasti, ve kterých můžete přispět:",
  "about_documentation": "DOKUMENTACE",
  "about_documentation_1": "Na <a href=':1:'>github</a> je dostupný repozitář s kódem této stránky. Tento repozitář využíváme jako zdroj dokumentace, která je jen v angličtině.<br /><br /> Korektur, dodatků a vylepšení naší dokumentace si vždy vážíme, takže to jediné, co musíte udělat, je nakopírovat repozitář a váš příspěvek a vytvořit pull request.<br /><br /> Bylo by skvělé, kdybyste mohli pomoci vývojářům, kteří nemluví anglicky, překladem některé části dokumentace do jiných jazyků. Pro naše překlady využíváme <a href=':2:'>:3:</a> a náš projekt naleznete <a href=':4:'>zde</a>",
  "about_donations_sponsoring": "DARY / SPONZORING",
  "about_evangelism": "ŠÍŘENÍ POVĚDOMÍ",
  "about_evangelism_1": "Spousta lidí stále ještě neví, že Phalcon existuje nebo že je opravdu funkční. Jsme si jisti, že mnoha developerům by pomohlo získání povědomí o Phalconu, o jeho principech a o tom, jak jim může být užitečný. Znáte-li jakékoli PHP události nebo setkání, na kterých byste chtěli projekt prezentovat, máte naši plnou podporu. Kdo by se nechtěl dozvědět o nástroji, který revolučně mění vývoj PHP?",
  "about_facebook_page": "Facebooková stránka",
  "about_flying_with_phalcon": "Děkujeme, že lítáte s Phalconem! &lt;3",
  "about_follow_on_gab": "Sledujte nás na Gabu",
  "about_follow_on_twitter": "Sledujte nás na Twitteru",
  "about_google_plus_page": "Google+ stránka",
  "about_official_blog": "Oficiální blog",
  "about_sample_applications": "UKÁZKOVÉ APLIKACE",
  "about_sample_apps_1": "Velké příklady pomáhají ostatním lépe pochopit, jak velké věci mohou být s Phalconem vytvořeny. Neváhejte sdílet repozitáře s ukázkovými aplikacemi, které pomáhají ostatním s jejich prací a také jim dovolí poskytnout vám zpětnou vazbu k vaší práci!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "Všichni milujeme videonávody. Vřele uvítáme, pokud máte trochu volného času a chuti pomoci komunitě vytvořením hezkých výukových videí o kterékoli funkci našeho rozhraní. Pro inspiraci navštivte náš <a href=':1:'>Vimeo kanál</a>.",
  "about_share_experiences_1": "Don’t be shy, feel free to share the ways through which Phalcon was useful to you with the community. If Phalcon is a success case for you, let us share that with the community. Also, discuss what components needed extra work, what you could do easier, what benefits you got by using Phalcon. Although not everything can be implemented immediately, your input on new feature requests can greatly help us shape the future of the project. Your feedback helps us all.",
  "about_share_your_experiences": "PODĚLTE SE O SVÉ ZKUŠENOSTI",
  "about_social_networks": "SOCIÁLNÍ SÍTĚ",
  "about_social_networks_1": "Díky naší touze pracovat stále lépe se Phalcon dennodenně vyvíjí. Sociální sítě jsou v dnešní době součástí našich životů a jsme na nich v kontaktu s ostatními lidmi. Povědomí o projektu Phalcon výrazně zvýší, když budete své zkušenosti s ním sdílet ve vašem sociálním okruhu. Více a více lidí se zapojí do naší komunity, čímž ji posílí, obohatí o nové funkce a popularitu. Lajk, „+1“ nebo sdílení příspěvků, které neustále publikujeme na všech sociálních sítích, vyústí v diskuse o těchto příspěvcích. Lidé, kteří objeví Phalcon skrze vaše interakce, vám poděkují!",
  "about_social_networks_2": "We have a presence in most of the popular social networks. By following us, you are helping us increase the project's visibility:",
  "about_sponsoring_1": "We’re a tiny but effective core team of developers working our tails off. We try to spend as much time as possible on the project. All our passion for this project makes us want to be better every day. Phalcon is open-sourced software and volunteer efforts are needed for its constant evolution. You can help us keep the development active by donating to the project or sponsoring the development. More time and resources dedicated to the project means more activity, more improvement, better support, more amazing features, etc.",
  "about_star_on_github": "Ohodnoťte projekt na Github",
  "about_tests": "TESTY",
  "about_tests_1": "Žádný software není bezchybný. Najdete-li nějakou chybu, neváhejte nám ji nahlásit. Máme testovací sestavu s více než <a href=':1:'>16 000</a> testy. Ale unit testů není nikdy dost. Pomozte nám zlepšit naši testovací sestavu přidáním nových testů nebo vylepšením těch stávajících. Každý přidaný test činí celou platformu stabilnější.",
  "about_thank_you": "DĚKUJEME!",
  "about_thank_you_1": "Chtěli bychom poděkovat všem našim přispěvatelům a členům komunity, že nás tlačí k tomu, abychom z Phalcon udělali nejlepší platformu svého druhu. Vaše slova uznání a angažování se nás ženou k lepším výkonům. Doufáme, že si zasloužíme důvěru, kterou do Phalconu vkládáte, a že předčíme vaše očekávání.",
  "about_translations": "PŘEKLADY",
  "about_translations_1": "Odbouráváním jazykových bariér se snažíme se oslovit tolik developerů, kolik je jen možné. Abychom se vypořádali se všemi slovy a větami, které pro tuto stránku musí být přeloženy, používáme <a href=':1:'>:2:</a>. Repozitář projektu je umístěn <a href=':3:'>zde</a>.",
  "acl": "ACL",
  "acl_1": "Takto můžete vytvořit access control list (ACL):",
  "acl_2": "Vytvořit ACL",
  "acl_3": "Výchozí akce je odmítnutí přístupu - DENY access",
  "acl_4": "Registrujte dvě skupiny, Users jsou registrovaní uživatelé",
  "acl_5": "a hosté jsou uživatelé bez definované identity",
  "acl_description": "Access Control List umožňuje uživatelům přistupovat k modulům, ke kterým mají oprávnění",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Registrujte jmenné prostory, předpony, adresáře a třídy. Využijte automatické načítání událostí a udržte si kontrolu nad tím, které soubory a odkud jsou načítány.",
  "auto_loader_2": "Vytvoří autoloader",
  "auto_loader_3": "Registrujte jmenné prostory",
  "auto_loader_4": "Registrujte autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Poskytuje automatický samonačítací mechanismus tříd PHP pod specifikací PSR-4.",
  "basic_features": "Základní funkce",
  "blog": "Blog",
  "built_with_phalcon": "Vytvořeno s Phalconem",
  "cache": "Cache",
  "cache_1": "Komponenta mezipaměť umožňuje rychlejší přístup k často využívaným nebo již zpracovaným datům. Podporuje celou řadu backendů jako jsou Redis, Memcached, Mongo, Files, Apc a jiné",
  "cache_2": "Nastavte modelům službu mezipaměti",
  "cache_3": "V základním nastavení uchovejte data v mezipaměti jeden den",
  "cache_4": "Nastavení připojení Memcached",
  "cache_description": "Zlepšete svůj výkon s mnoha beckend mezipaměťmi, které Phalcon nabízí",
  "community": "Komunita",
  "consulting": "Porada",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO</a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO</a> congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Od doby, kdy v roce 2003 spatřila naše společnost světlo světa, jsme při vývoji software vyzkoušeli mnoho technologií a přístupů.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO</a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Teď, když jsme získali pozitivní zkušenosti s Phalconem, vám můžeme otevřeně poradit rozhodnout se pro vývoj na Phalconu a můžeme vám pomoci dodat váš na Phalconu vystavěný produkt na trh.",
  "consulting_lezgro_5": "Kontaktujte LEZGRO prostřednictvím naší <a href=':1:'>webové stránky</a>, na které také naleznete ukázky a ocenění naší práce.",
  "consulting_mctekk_1": "MCTekK naskočil do vlaku Phalconu hned první den. Od samého počátku jsme viděli velké výhody, které Phalcon nabízel, a které by mohl nabízet v budoucnu.",
  "consulting_mctekk_2": "Máme s Phalconem bohaté zkušenosti a na jeho jádru jsme vyvinuli bezpočet projektů. Jsme tu, abychom vám poradili s čímkoli, co budete ohledně Phalconu potřebovat ke zlepšení vaší připravenosti, rychlosti a kvality.",
  "consulting_mctekk_3": "Kontaktujte nás prostřednictvím naší <a href=':1:'>webové stránky</a>, kde se můžete podívat na projekty, do kterých jsme se zapojili.",
  "consulting_mctekk_header": "MCTekK již vydal různé špičkové Phalcon projekty, jejichž hlavními přednostmi byl vývoj pro web a mobilní zařízení.",
  "contribute": "Přispějte",
  "contributors": "Přispěvatelé Phalconu",
  "contributors_description": "Phalcon je dennodenně vylepšován naší úžasnou komunitou",
  "crypt": "Crypt",
  "crypt_description": "Zašifruje/dešifruje důležitá data, aby byla chráněna před neautorizovanými třetími stranami",
  "data_and_storage": "Data & úložiště",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon je vystavěn na výkonném, ale snadno pochopitelném principu nazývaném Vkládání závislostí. Služby jednou definujete a spustíte, a pak už je můžete využívat prakticky kdekoli napříč celou aplikací.",
  "dependency_injection_2": "Vytvoření Dependency Injection kontejneru",
  "dependency_injection_3": "Registrace tříd, funkcní a komponent",
  "dependency_injection_4": "Použít ve kterékoli jiné části kódu",
  "dependency_injection_description": "Phalcon\\Di je komponenta implementující vkládání závislostí a lokalizaci služeb a je sama o sobě jejich úložištěm.",
  "discord": "Discord",
  "docs": "Dokumentace",
  "documentation": "Dokumentace",
  "donate": "Podpořit",
  "download": "Stáhnout",
  "download_arch": "Arch Linux",
  "download_arch_1": "PKGBUILD pro ArchLinux je k dispozici <a href=':1:'>zde</a>",
  "download_box_1": "Box #1",
  "download_box_2": "Box #2",
  "download_box_doc_root": "Dokument Root: :1:",
  "download_box_user_pass": "MySQL Uživatel: :1: Heslo: :2:",
  "download_compilation": "Sestavení",
  "download_compilation_1": "Na Linuxu můžete snadno sestavit a nainstalovat rozšíření ze zdrojového kódu.",
  "download_compilation_11": "1. Pro vytvoření rozšíření z C kódu postupujte podle těchto kroků:",
  "download_compilation_12": "2. Přidat extension do souboru php.ini:",
  "download_compilation_13": "3. A restartujeme webový server",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Na žádosti z komunity vydali vývojáři z cPanelu modul, který umožňuje nainstalovat Phalcon na stránky hostované cPanelem. Podrobnější informace naleznete <a href=':1:'>zde</a>. Modul je spravován na <a href=':2:'>Githubu</a>.",
  "download_dependencies": "Závislost",
  "download_dependencies_1": "Although Phalcon does not binary link to other extensions it does use some of them to offer functionality. The extensions used are:",
  "download_dependencies_2": "Není nutné, aby se všechna výše zmíněná rozšíření nacházela v systému s nainstalovaným Phalconem. Můžete si nainstalovat jen ta, která odpovídají vašim požadavkům. Používáte-li například MySQL databázi, můžete si nahrát jen PDO a PDO/MySQL a ignorovat Oracle, SQlite, Postgresql a Mongo.",
  "download_developer_tools": "Vývojářský nástroje",
  "download_devtools_1": "Tyto nástroje jsou sbírkou užitečných skriptů, které slouží k vygenerování kostry kódu. Základní komponenty vaší aplikace mohou být vygenerovány jednoduchým příkazem, což vám umožní pomocí Phalconu snadno vyvíjet aplikace.",
  "download_devtools_composer": "Instalace pomocí Composeru",
  "download_devtools_composer_1": "Nainstalujte composer ve společném umístění, nebo v projektu:",
  "download_devtools_composer_2": "Vytvořte soubor composer.json takto:",
  "download_devtools_composer_3": "Spustit nainstalovaný composer:",
  "download_devtools_composer_4": "Vytvořit symbolický odkaz na phalcon.php skript:",
  "download_devtools_docs": "Dokumentace: <a href=':1:'>Vývojářské nástroje Phalconu</a>",
  "download_devtools_download": "Můžete si stáhnout multiplatformní nástroje pro vývojáře z <a href=':1:'> GitHubu</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Existuje mnoho způsobů, jak můžete využít Phalcon spolu s Dockerem.",
  "download_docker_2": "Naše oficiální obrázky jsou umístěny <a href=':1:'>zde</a>. Vždycky vítáme pull requesty a vylepšení. Repozitář se soubory dockeru je umístěn zde:",
  "download_docker_3": "Pomocí Phalcon-compose můžete vytvořit izolované prostředí s Dockerem, které vám umožní využívat Phalcon bez jakýchkoli dalších instalací. Mějte na paměti, že využívání Phalcon Compose vyžaduje ",
  "download_docker_4": "a",
  "download_docker_5": "Služby",
  "download_docker_6": "Phalcon Compose nabízí v základním nastavení tyto služby:",
  "download_docker_7": "Využívání Phalcon Compose je velmi snadné. Představte si, že potřebujete vytvořit aplikaci, která bude umístěna v: ",
  "download_docker_8": "Nyní budeme muset spustit následující příkaz, aby mohla být naše kontejnerová aplikace vytvořena:",
  "download_docker_9": "Výše uvedený příkaz stáhne kostru dockerového prostředí.",
  "download_docker_10": "Proměnné",
  "download_docker_11": "Budete muset vytvořit nový soubor nazvaný",
  "download_docker_12": "v",
  "download_docker_13": "K dispozici je vzorový dokument nazvaný",
  "download_docker_14": "Proměnné v tomto souboru si nastavte podle svých potřeb. Nejdůležitější proměnnou je",
  "download_docker_15": "Název si změňte tak, abyste mohli soubor využívat. V našem případě jsme jednoduše ponechali výchozí název ",
  "download_docker_16": "Otevřete si soubor hosts (<code>/etc/hosts</code>) a vložte takovýto nový řádek:",
  "download_docker_17": "Možná budete chtít upravit soubor <code>docker-compose.yml</code> a odstranit z něj služby, které nebudete využívat. Jak jsme uvedli výše, Phalcon Compose nabízí mnoho služeb a vaše aplikace nemusí některé z nich potřebovat. Odstraněním příslušných služeb ze souboru <code>docker-compose.yml</code> snížíte využívání paměti vašeho prostředí.",
  "download_docker_18": "Budování",
  "download_docker_19": "Nyní můžete vybudovat vaše prostředí.",
  "download_docker_20": "Kontejnery se do vašeho prostředí podle potřeby stáhnou a nastaví.",
  "download_docker_21": "Spuštění",
  "download_docker_22": "Nyní můžete vaše prostředí spustit:",
  "download_docker_23": "Zadejte do vašeho prohlížeče adresu :1: a uvidíte, že vaše prostředí je nastaveno. Nyní můžete ve složce s aplikacemi vyvíjet své aplikace.",
  "download_docker_24": "Vypnutí",
  "download_docker_25": "Když už vaše prostředí není třeba, můžete jej vypnout tímto příkazem:",
  "download_docker_26": "Další informace naleznete na: ",
  "download_examples": "Před-instalovaný příklad",
  "download_examples_1": "The following examples are pre-installed on each vagrant box:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "A port is available for FreeBSD. You only need these few commands to install it:",
  "download_ide_stubs": "IDE pomůcky",
  "download_ide_stubs_1": "Video níže popisuje, jak pro PhpStorm povolit IDE stubs",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Potřebujete pomoc?",
  "download_need_help_1": "Podívejte se na naši <a href=':1:'>stránku podpory</a> se způsoby, jak získat podporu. Uděláme, co je v našich silách, abychom vám pomohli.",
  "download_note": "Phalcon je rozšíření C, takže si budete muset stáhnout odpovídající binární kód pro váš operační systém nebo si jej zkompilovat ze zdrojového kódu.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Balíček je k dispozici <a href=':1:'>zde</a> (děkujeme <a href=':2:'>Mariuszi Łączakovi</a>)",
  "download_requirements": "Požadavky",
  "download_requirements_1": "Musíte mít nainstalované balíky:",
  "download_requirements_2": "PHP 5.x zdroje",
  "download_requirements_3": "GCC kompilátor",
  "download_source_code": "Zdrojový kód: <a href=':1:' target='_download' title='GitHub Repo'>na githubu</a>",
  "download_source_code_switch": "Zdrojový kód (přepněte si prosím na příslušnou vývojovou větev): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps:",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command:",
  "download_ubuntu_2": "Chcete-li nainstalovat starší verzi Phalconu (1.x), využijte tento příkaz PPA: ",
  "download_ubuntu_or_debian": "Ubuntu nebo Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> je vynikající nástroj k vytváření a konfigurování odlehčených, reprodukovatelných a přenosných vývojářských prostředí.",
  "download_vagrant_2": "Využijte libovolný z následujících balíčků k testování nebo vývoji v předkonfigurovaném prostředí s Phalconem.",
  "download_vagrant_boxes": "Vagrant Boxy",
  "download_windows": "Windows DLL knihovny",
  "download_windows_download": "Stáhnout",
  "download_windows_dlls": "Windows DLL knihovny mohou být staženy z naší Githubové release stránky <a href=':1:'>zde</a>",
  "download_windows_guides": "Související průvodci",
  "download_windows_guides_wamp": "Instalace na WAMP",
  "download_windows_guides_xampp": "Instalace na XAMPP",
  "download_windows_installation": "Instalace",
  "download_windows_installation_1": "K využívání Phalconu ve Windows si můžete stáhnout DLL knihovnu. Upravte váš soubor php.ini, připojte jej na konec a restartujte váš webový server, aby se rozšíření načetlo. <a href=':1:'>Více zde</a>.",
  "download_windows_note": "Důrazně doporučujeme používat nejnovější verzi PHP odpovídající naší DLL knihovně, abyste mohli využívat výhod všech funkcí Phalconu.",
  "download_windows_older": "Starší verze",
  "download_windows_stable": "Stable/Mastre verze",
  "encryption": "Šifrování",
  "encryption_1": "Phalcon nabízí možnost šifrování prostřednictvím komponenty Phalcon\\Crypt. Tato třída nabízí jednoduché objektově orientované wrappery pro PHP kryptovací knihovnu openssl.",
  "encryption_2": "Toto je tajný klíč (32 bajtů).",
  "encryption_3": "Toto je text, který chcete zašifrovat.",
  "events": "Události",
  "events_description": "Rozšiřte většinu komponent v rozhraní nastavením „hook points“, záchytných bodů. Vytvořte své vlastní události a udělejte tak vaši aplikaci flexibilnější a výkonnější",
  "events_management": "Správa událostí",
  "events_management_1": "EventsManager nám umožňuje připojit konkrétnímu typu události listener. Typ události, který nás nyní zajímá, je „dispatch“, odešli. Následující kód filtruje všechny události vytvořené Dispatcherem:",
  "events_management_2": "Vytvořte správce událostí",
  "events_management_3": "Sledujte události vytvořené dispatcherem pomocí zásuvného modulu Security",
  "events_management_4": "Vypořádejte se s výjimkami a nenalezenými výjimkami pomocí NotFoundPlugin",
  "events_management_5": "Přiřaďte správce událostí k dispatcheru",
  "facebook": "Facebook",
  "flash_messages": "Flash zprávy",
  "flash_messages_1": "Využijte flash notifier ke zobrazení notifikací uživatelům ve webové aplikaci:",
  "flash_messages_2": "v tomto formuláři byly chyby",
  "flash_messages_3": "ano! vše proběhlo hladce",
  "flash_messages_4": "toto je upozornění pro uživatele",
  "flash_messages_5": "toto je jen varování",
  "flash_messages_description": "Bleskové zprávy jsou využívány k informování uživatele o stavu akcí.",
  "forms_builder": "Formuláře",
  "forms_builder_1": "Každý prvek ve formuláři může být vykreslen tak, jak developer potřebuje. Phalcon\\Tag je interně využíván k vytváření správného HTML kódu pro každý prvek a vy můžete přidat další HTML atributy jako druhý parametr v render():",
  "forms_builder_2": "Domů",
  "forms_builder_3": "Telefon",
  "forms_builder_description": "Jednoduše vytvářejte HTML formuláře",
  "forum": "Fórum",
  "gab": "Gab.ai",
  "get_phalcon": "Získejte Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "Inovativní architektura Phalconu z něj dělá nejrychlejší PHP platformu, která kdy byla vyvinuta!",
  "header_tagline": "Komplexní PHP platforma dodávaná jako rozšíření C",
  "high_performance_php_framework": "Vysoce výkonná PHP platforma",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud dodává předplacenou škálovatelnou výpočetní kapacitu v cloudu.",
  "hosting_amazon_ec2_2": "Zvolte si přednastavenou šablonu Amazon Machine Image (AMI), abyste mohli začít okamžitě pracovat. Nebo si vytvořte AMI obsahující vaše aplikace, knihovny, data a přidružená konfigurační nastavení. <a href=':1:'>Více zde</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows shared web hosting packages and plans, no configuration or installation required! They offer a variety of PHP versions from 5.2 - 7.0 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "<a href=':1:'>Windows Azure cloud</a> vám pro vaše webové aplikace nabízí vysoce škálovatelný a nastavitelný Windows hosting. Využijte Phalcon, abyste snížili své objektové náklady.",
  "hosting_azure_2": "Pro nainstalování Phalconu postupujte krok za krokem podle návodu v <a href=':1:'>tomto článku na SitePoint</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services:",
  "hosting_digital_ocean_1": "Bleskově rychlá cloudová technologie. Vytvořeno pro developery. Spusťte SSD cloudový server za 55 vteřin. <a href=':1:'>Více zde</a>",
  "hosting_digital_ocean_2": "Začněte podle tohoto <a href=':1:'>tutoriálu</a>",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host nabízí více dostupných a vysoce kvalitních hostingových programů.",
  "hosting_dcthost_2": "V základním nastavení je Phalcon nainstalovaný ve všech jeho sdílených hostingových balíčcích.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit offers many hosting plans (there is one for developers and is free - with some limitations) that would satisfy the needs of most of the developers that wish to either try Phalcon or deploy their applications using it.",
  "hosting_fortrabbit_2": "They offer a variety of <a href=':1:'>extensions</a> that would satisfy even the most demanding project.",
  "hosting_fortrabbit_3": "Stable versions of Phalcon are pre-installed, you can activate them from the administration dashboard.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Install Phalcon using the standard instructions of installation.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Follow this <a href=':1:'>tutorial</a> to get started",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting for developers. Full shell access to fast servers with all your favorite tools pre-installed and maintained for the user.",
  "hosting_webfaction_2": "To install Phalcon in WebFaction, follow the instructions outlined <a href=':1:'>here</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Ask browser what is the best language",
  "i18n_3": "Check if we have a translation file for that lang",
  "i18n_4": "Fallback to some default",
  "i18n_5": "Return a translation object",
  "i18n_description": "Translate your applications to many languages easily",
  "installing_phalcon_php": "Installing Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Come join our vibrant developer community!",
  "join_our_community_description": "Community contributions in Extensions, Plugins, Adapters, VM, examples, source code... and more",
  "language_text": "English",
  "learn": "Learn",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
  "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
  "low_overhead_description": "Nízké HW nároky v porovnání s tradičními frameworky",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "VÍCE...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM pro Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "There are :1: robots",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Houstone, máme problém!",
  "or": "nebo",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Phalcon Tým",
  "phalcon_team_1": "Mnoho dalších lidí",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Jméno",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Resources",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Restful Services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Returning data in JSON",
  "roadmap": "Plán",
  "router": "Router",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Vytvoření routeru",
  "router_3": "Definice routy",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Ukázková aplikace",
  "see_for_yourself": "Posuďte sami...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Something went wrong :(",
  "sponsored_by": "Sponsored by",
  "sponsors": "Sponzoři",
  "sponsors_and_supporters": "Sponsors and Supporters",
  "sponsors_and_supporters_upper": "SPONSORS AND SUPPORTERS",
  "sponsors_become_patron": "Become a Patron!",
  "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
  "stack_overflow": "Stack Overflow",
  "store": "Obchod",
  "support": "Podpora",
  "support_discord": "Come join the Phalcon <a href=':1:'>Discord</a>",
  "support_documentation_1": "Please use the :1: before anything else. You can also use the search feature in our documents to find what you are looking for. If your question is still not answered, there are more options below.",
  "support_download_page": "stránka ke stažení",
  "support_note_1": "Our great community and contributors are happy to help you though! Please use these community resources for obtaining help.",
  "support_note_2": "Many bugs are raised because users are not running the latest version. Please visit the :1:, download the latest available version (or compile it) and confirm if the issue you are experiencing is indeed a bug.",
  "support_phalcon_forum": "Questions should go to <a href=':1:'>Official Forums</a>",
  "support_please_note": "Please note:",
  "support_please_note_1": "Stack Overflow is not dedicated to support Phalcon",
  "support_please_note_2": "Please do not raise new bugs there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_3": "Please do not ask for feature requests there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_4": "Make sure you include the 'phalcon' tag with your question",
  "support_please_note_5": "Make sure you mention 'Phalcon' in the question",
  "support_reporting_a_bug": "Hlášení chyb",
  "support_reporting_a_bug_0": "If you still believe that what you found is a bug, please <a href=':1:'>open an issue</a>",
  "support_reporting_a_bug_1": "Please report bugs when you've exhausted all of the above options, using the <a href=':1:'>issue tracker</a> in Github.",
  "support_slack": "There is a less active but still functioning community on <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Another way is to ask a question on <a href=':1:' target='_blank'>Stack Overflow</a> and tag it with <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Our social network accounts are: <a href=':1:'>Gab.ai</a> , <a href=':2:'>Twitter</a>, <a href=':3:'>Facebook</a> and <a href=':4:'>Google+</a>",
  "support_us": "Podpořte nás",
  "team": "Tým",
  "team_andres_1": "Andres is no stranger to open source projects. In the last nine years, he has designed and released frameworks for PHP and has been involved in web development - his main passion.",
  "team_andres_2": "A TR35 winner, Andres' main drive is to always choose and implement or use the right tool for the job, mostly focused on performance. Therefore in 2011 a new idea was in the works; to create a new kind of framework for PHP developers, one that focuses on usability, features and mostly performance.",
  "team_andres_3": "Through this new innovative approach Phalcon was born. A PHP framework written in C that can offer a wealth of features to developers while maximizing performance and keeping resource utilization low.",
  "team_andres_4": "Andres is one of the core developers of Phalcon and its inspiration.",
  "team_eduar_1": "Eduar is a C/PHP developer with several years of experience in application development. He is one of the founders and lead developers of the Phalcon project which began in 2011.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar likes science fiction movies and sometimes plays football.",
  "team_nikolay_1": "Nikolay has been developing web applications for over 10 years. He has been involved in high performance as well as complex websites and designs.",
  "team_nikolay_2": "Nikolay has been working with Open Source projects for a long time, utilizing them whenever requirements allow. He thus started using his personal time to give back to the community, by forking projects, offering architectural changes and suggestions, as well as performance ones. He has been instrumental in improving Open Source CMS projects receiving positive feedback from the community.",
  "team_nikolay_3": "His continuous involvement with open source projects has helped him advance his technical knowledge while abiding by the give back to the community mentality.",
  "team_nikolay_4": "Nikolay is an avid supporter of maximizing performance in web applications. After his introduction to Phalcon, he decided to pursue and use the project and become an Evangelist for it. He is leading the effort toward the Russian community and offers resources for Russian speaking developers.",
  "team_nikolay_5": "His contributions include:  A mirror of the main website in Russian (<a href=':1:'>http://www.phalcon.ru</a>), a mirror of the documentation repository in Russian (<a href=':2:'>http://docs.phalconphp.ru</a>), ongoing changes and corrections to the documentation in English, a group in the social network Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos has been in the IT industry for over 20 years. He was introduced to the PHP world in 2000 and has been using it ever since in personal projects as well as projects for his employers.",
  "team_nikos_2": "He loves discovering new technologies and ways to integrate them with existing applications and thus reap the benefits they offer.",
  "team_nikos_3": "He is an avid supporter of Test Driven Development (TDD) and always tries to get full coverage in his code.",
  "team_nikos_4": "Nikos' continuing interest in new and innovative technologies breaking out of the norm introduced him to Phalcon. He joined the core team and his tasks mainly involve coordination of NFRs and bug fixes, help with tests, documentation and the incubator. Nikos is also responsible for maintaining the Windows DLLs for the project and offers support whenever possible.",
  "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
  "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
  "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
  "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Šablony (Volt)",
  "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
  "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
  "template_engines": "Šablonovací systémy",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Views represent the user interface of your application",
  "testimonials": "Ověření",
  "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits:  ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1хP4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing: )  Michael.",
  "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing! Best regards, Nikita Vershinin, Lead Developer, Kolesa.kz and krisha.kz",
  "testimonials_3": "Phalcon Team, The framework you guys have created is amazing. I've never used a framework that has combined speed, efficiency, brevity, and naturality all in one package. I intend on championing and contributing back to the project in any way that I can. I embarked recently on an ~800 hour project and am happy to say that we are using Phalcon Framework. Bravo. Brian Seymour",
  "testimonials_4": "Hi guys, I just ran across Phalcon and it's just awesome! I've merely wanted to say to you how awesome you are! So, thanks for this framework and keep up the good work! Ivan Penchev",
  "testimonials_5": "Hi Guys, i wrote simple url-shortener service with phalcon. That was amazing! really. <a href=':1:'>:2:</a>. Demo is here: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Hello Phalcon Team, I created a small project designed for Polish users using your framework. I have to admit that the performance is amazing, congratulations good job. Service to validate the content of the web pages in Polish language <a href=':1:'>:2:</a>",
  "testimonials_7": "Hi guys! Just wanted to share with you the latest release of our old project - <a href=':1:'>:2: </a>. Switching to phalcon allowed us to halve the server load compared to the previous framework, which is great!",
  "testimonials_description": "Below is a collection of testimonials and success stories, from you, the developers and users of Phalcon PHP. We always welcome emails with success stories and will be posting those in our blog. If you wish to send us your success story or get in touch with us, feel free to mail us at <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Toggle navigation",
  "transactions": "Transakce",
  "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
  "transactions_2": "Create a transaction manager",
  "transactions_3": "Request a transaction",
  "transactions_4": "Get the robots to be deleted",
  "transactions_5": "Something's gone wrong, we should rollback the transaction",
  "transactions_6": "Everything's gone fine, let's commit the transaction",
  "transactions_7": "Robots were deleted successfully!",
  "transactions_8": "Failed, reason: ",
  "transactions_description": "Transactions in Phalcon allows to keep the data integrity safe.",
  "try_phalcon": "Try Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Watch the demo video",
  "zephir": "Zephir"
}