{
  "about": "Über uns",
  "about_blog": "BLOG",
  "about_blog_1": "Wenn Du gerne schreibst, denke Sie daran, dass <a href=':1:'> unser Blog</a> offen dafür ist von Dir erstellte Tutorials zu posten. Wenn Du Deinen eigenen Blog und etwas über Phalcon geschrieben hast, können wir das auch in unseren sozialen Netzwerk-Seiten veröffentlichen um maximale Sichtbarkeit zu erreichen. Wenn Dein Blog-Post in einer anderen Sprache als Englisch ist, wollen wir es teilen und möglicherweise, wenn möglich, übersetzen. Wenn Du Blogs rund um PHP kennst, welche daran interessiert sind das Projekt deren Publikum zu präsentieren, lasse es uns bitte wissen.",
  "about_description_1": "Großartige Projekte benötigen großartige Helfer. Wir mögen dich noch nicht kennen, aber wir wissen, dass du der Richtige bist. Gemeinsam können wir die Welt verändern! Hier bei Phalcon entwickeln wir die nächste Framework-Generation für PHP und wir möchten dir beeindruckende Geschwindigkeit bieten, während wir die Entwicklung zu einem einfachen und entspannten Erlebnis machen.",
  "about_description_2": "Wir hoffen, dass Du Phalcon genauso genießt, wie wir. Wir freuen uns immer über Deine Zusammenarbeit und Hilfe! <strong>Du musst kein C-Entwickler sein, um Phalcon zu unterstützen!</strong> Es gibt viele andere Bereiche, zu der Du beitragen kannst:",
  "about_documentation": "DOKUMENTATION",
  "about_documentation_1": "Das Repository dieser Website ist auf <a href=':1:'>Github</a> verfügbar. Wir verwenden dieses Repository als eine Quelle für unsere Dokumentation nur für die englische Sprache!. <br /><br /> Wir schätzen immer Korrekturen, Ergänzungen und Verbesserungen in unserer Dokumentation, so dass alles, was Du tun musst, ist das Repository zu klonen und einen Pull-Request anzufordern! <br /><br /> Wenn Du nicht Englisch sprechenden Entwicklern helfen kannst, indem Du einige der Inhalte in eine andere Sprache übersetzt, wäre das toll! Wir verwenden <a href=':2:'>:3:</a> für unsere Übersetzungen, und unser Projekt findest Du <a href=':4:'> hier</a>",
  "about_donations_sponsoring": "SPENDEN / SPONSORING",
  "about_evangelism": "EVANGELISMUS",
  "about_evangelism_1": "Es gibt eine Menge Leute, die noch nicht wissen, dass es Phalcon gibt oder dass es wirklich funktioniert. Wir sind sicher, dass viele Entwickler davon profitieren, wenn sie hören, was Phalcon alles kann und wie sie es unterstützen können. Wenn Du eine PHP-Veranstaltung oder ein Treffen kennst und gerne einen Vortrag über das Projekt halten möchtest, hast Du unsere volle Unterstützung. Wer möchte nicht das Tool kennen, dass die PHP-Entwicklung revolutioniert?",
  "about_facebook_page": "Facebook-Seite",
  "about_flying_with_phalcon": "Danke, dass du Phalcon benutzt! &lt;3",
  "about_follow_on_gab": "Folge uns bei Gab",
  "about_follow_on_twitter": "Folge uns bei Twitter",
  "about_google_plus_page": "Google+-Seite",
  "about_official_blog": "Offizieller Blog",
  "about_sample_applications": "BEISPIEL-ANWENDUNGEN",
  "about_sample_apps_1": "Umfangreiche Beispiele helfen beim Verständnis der vielen Möglichkeiten des Phalcon-Frameworks. Teile Deine Repositories, denn Beispielanwendungen helfen anderen bei Ihrer Arbeit und unterstützen Dich zudem mit Feedback über Deine eigene Arbeit!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "Jeder liebt Screencasts. Wenn Du etwas Zeit hast und die Community mit lehrreichen Videos unterstützen möchtest, freuen wir uns sehr. Schau Dir unseren <a href=':1:'>Vimeo-Kanal</a> zum Einstieg an.",
  "about_share_experiences_1": "Sei nicht schüchtern, Deine Erfahrungen mit Phalcon oder einzelnen Komponenten zu teilen. Obwohl nicht alle Anfragen sofort implementiert werden können, hilft uns Dein Feedback bei der Entwicklung von neuen Funktionen, welche die Entwicklung des Projekts prägen können.",
  "about_share_your_experiences": "TEILE DEINE ERFAHRUNGEN",
  "about_social_networks": "SOZIALE NETZWERKE",
  "about_social_networks_1": "Phalcon entwickelt sich durch unsere Verbesserungswünsche täglich weiter. Soziale Netzwerke sind Teil unseres heutigen Lebens und jeder interagiert mit anderen durch diese. Teile Deine Phalcon-Erlebnisse mit Deinen sozialen Kreisen und verbreite das Projekt. Zunehmend mehr Menschen beteiligen sich an unserer Gemeinschaft und machen sie dadurch kraftvoller, facettenreicher und populärer. Like, '+1' oder teile Beiträge, welche wir regelmäßig durch verschiedenen sozialen Netzwerke verbreiten. Die Leute, welche Phalcon durch Dich entdecken, werden es Dir danken!",
  "about_social_networks_2": "Wir sind in den populäreren sozialen Netzwerken vertreten. Wenn Du uns folgst, hilfst Du uns dabei, die Verbreitung und Sichtbarkeit des Projektes zu erhöhen.",
  "about_sponsoring_1": "Wir sind ein kleines aber effektives Entwicklerteam. Wir versuchen, so viel Zeit wie möglich mit dem Projekt zu verbringen. Unsere Leidenschaft für das Projekt verbessert dieses permanent. Phalcon ist Open-Source-Software und freiwillige Beiträge sind für die weitere Entwicklung erforderlich. Sie können die Entwicklung aktiv durch Spenden an das Projekt oder Entwickler unterstützen. Mehr Zeit und Ressourcen für das Projekt bedeutet mehr Aktivität, mehr Verbesserung, mehr Untersützung und mehr nützliche Features.",
  "about_star_on_github": "Sterne das Projekt auf Github",
  "about_tests": "TESTS",
  "about_tests_1": "Keine Software ist frei von Fehlern. Wenn Du welche findest, zögere bitte nicht, es uns zu mitzuteilen. Wir haben eine Testsuite mit mehr als <a href=':1:'> 16.000</a> Tests. Unit-Tests sind jedoch nie genug. Hilf uns unsere Testsuite zu verbessern, indem mehr Tests oder die jetzigen verbessern werden. Alle hinzugefügten Tests machen das Framework stabiler.",
  "about_thank_you": "DANKE!",
  "about_thank_you_1": "Wir danken allen Helfern und Mitgliedern der Gemeinschaft, welche Phalcon zum besten Framework seiner Art machen. Euer Engagement motiviert uns jeden Tag. Wir danken für euer Vertrauen in Phalcon.",
  "about_translations": "ÜBERSETZUNGEN",
  "about_translations_1": "Wir versuchen, möglichst viele Entwickler durch Abbau von Sprachbarrieren zu erreichen. Wir verwenden <a href=':1:'>:2:</a>, um die Wörter oder Sätze zu behandeln, die für diese Website übersetzt werden müssen. Die Projekt-Repository befindet sich <a href=':3:'> hier</a>.",
  "acl": "ACL",
  "acl_1": "So kannst Du die Access Control Liste (ACL) erstellen:",
  "acl_2": "Erstellen der ACL",
  "acl_3": "Die Standard-Aktion ist den Zugriff zu verweigern",
  "acl_4": "Registrieren Sie zwei Rollen, Users sind registrierte Benutzer",
  "acl_5": "und Gäste sind Benutzer ohne eine definierte Identität",
  "acl_description": "Access Control List ermöglicht Benutzern den Zugriff auf Module, zu denen Sie berechtigt sind",
  "api": "API",
  "auto_loader": "Auto-loader",
  "auto_loader_1": "Registeren Sie Namespaces, Präfixe, Verzeichnisse oder Klassen. Profitieren Sie von den Autoloader Ereignissen und erhalten Sie volle Kontrolle darüber welche Dateien geladen werden und von wo.",
  "auto_loader_2": "Erzeugt den autoloader",
  "auto_loader_3": "Einige Namespaces registrieren",
  "auto_loader_4": "Autoloader registrieren",
  "autoloader": "Autoloader",
  "autoloader_description": "Stellt den autoloading Mechanismus von PHP-Klassen gemäß PSR-4 zur Verfügung.",
  "basic_features": "Grundfunktionen",
  "blog": "Blog",
  "built_with_phalcon": "Erstellt mit Phalcon",
  "cache": "Cache",
  "cache_1": "Die Cache-Komponente ermöglicht schnelleren Zugriff auf häufig verwendete oder bereits verarbeitete Daten. Es unterstützt viele Backends wie Redis, Memcached, Mongo, Dateien, Apc und mehr",
  "cache_2": "Legt den Cache für Modelle fest",
  "cache_3": "Cachet Daten für einen Tag in der Standardeinstellung",
  "cache_4": "Memcached-Verbindungseinstellungen",
  "cache_description": "Verbessere die Leistung mit vielen Back-End-Caches, welche Phalcon bietet",
  "community": "Community",
  "consulting": "Beratung",
  "consulting_header": "Wir haben eine Partnerschaft mit <a href=':1:'>LEZGRO</a>, einer Firma die darauf spezialisiert ist Web- und Mobile-Anwendungen zu schaffen. LEZGRO hat viel Erfahrung mit der Entwicklung Phalcon basierter Anwendungen.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO</a> gratuliert Dir zu Deiner Entscheidung, Phalcon in denen Technologie-Stack aufzunehmen!",
  "consulting_lezgro_2": "Seit unsere Firma 2003 das Licht der Welt erblickte, haben wir viele Technologien und Ansätze der Softwareentwicklung ausprobiert.",
  "consulting_lezgro_3": "Produktmanager, CTOs, und technikferne Gründer ziehen <a href=':1:'>LEZGRO</a> heran um herausragende Produkte zügig und mit hoher Qualität zu erschaffen.",
  "consulting_lezgro_4": "Da wir nun positive Erfahrungen mit Phalcon sammeln konnten, können wir Dir dazu raten mit Phalcon zu arbeiten und deinem Phalcon basierten Produkt zur Marktreife verhelfen.",
  "consulting_lezgro_5": "Kontaktieren Sie LEZGRO über unsere <a href=':1:'>website</a>, dort finden sie ebenfalls Samples und Empfehlungen über unsere Arbeit.",
  "consulting_mctekk_1": "MCTekK sprang auf dem Phalcon Zug seit dem ersten Tag. Von seiner Konzeption sahen wir die großen Vorteile, die Phalcon bot und in der Zukunft bieten könnte.",
  "consulting_mctekk_2": "Wir haben reichlich Erfahrung mit Phalcon und haben eine Vielzahl von Projekten damit als Kern entwickelt. Wir stehen für Sie bereit, um in allen Dingen zu beraten, was Sie bezüglich Phalcon benötigen, um Ihre Fertigstellung, Schnelligkeit und Qualität zu verbessern.",
  "consulting_mctekk_3": "Kontaktieren Sie uns über unsere <a href=':1:'> Webseite</a>, wo Sie einen Blick auf die Projekte nehmen können, an denen wir beteiligt waren.",
  "consulting_mctekk_header": "MCTekK hat bereits verschiedene high-End Phalcon Projekte ausgeliefert, durch ihren wichtigsten Stärken, Web und mobile Entwicklung.",
  "contribute": "Beitragen",
  "contributors": "Phalcon Mitwirkende",
  "contributors_description": "Phalcon wird täglich durch unsere fantastische Community verbessert",
  "crypt": "Verschlüsselung",
  "crypt_description": "Encrypte/Decrypte wichtige Daten um sie sicher vor Zugriffen Dritter zu machen",
  "data_and_storage": "Data &amp; Storage",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon baut auf einer leistungsstarken und dennoch einfach zu verstehenden und nutzbaren Dependency Injection auf. Initialisieren oder definieren Sie Services einmal - und verwenden sie praktisch überall in der gesamten Anwendung.",
  "dependency_injection_2": "Den Dependency-Injektor-Container erstellen",
  "dependency_injection_3": "Registrieren Sie, Klassen, Funktionen, Komponenten",
  "dependency_injection_4": "Überall sonst im Code verwenden",
  "dependency_injection_description": "Dependency Injection und Lage der Dienste und es ist selbst ein Container für sie.",
  "discord": "Discord",
  "docs": "Dokumentation",
  "documentation": "Dokumentation",
  "donate": "Spenden",
  "download": "Download",
  "download_arch": "Arch Linux",
  "download_arch_1": "Für ArchLinux ist ein <a href=':1:'>PKGBUILD</a> verfügbar.",
  "download_box_1": "Container #1",
  "download_box_2": "Container #2",
  "download_box_doc_root": "HTTP-Root: :1:",
  "download_box_user_pass": "MySQL Benutzer: :1: Passwort: :2:",
  "download_compilation": "Kompilieren",
  "download_compilation_1": "Auf Linux kannst Du die Erweiterung mithilfe des Quellcodes kompilieren und installieren.",
  "download_compilation_11": "1. Um die Erweiterung zu kompilieren sind folgende Schritte erforderlich:",
  "download_compilation_12": "2. Füge die Erweiterung zur php.ini hinzu:",
  "download_compilation_13": "3. Zum Schluss noch den Webserver neu starten",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Nach Anfragen aus der Community haben die cPanel-Entwickler ein benutzerdefiniertes Modul veröffentlicht, das die Installation von Phalcon in cPanel gehosteten Websites ermöglicht. Informationen finden Sie <a href=':1:'> hier</a>. Das Modul wird in <a href=':2:'> Github</a> gepflegt.",
  "download_dependencies": "Abhängigkeiten",
  "download_dependencies_1": "Obwohl Phalcon nicht direkt auf andere PHP-Erweiterungen zugreift, nutzt es einige um die Funktionalität zu erweitern. Die genutzten Erweiterungen sind:",
  "download_dependencies_2": "Es ist nicht notwendig dass die oben genannten Erweiterungen im System vorhanden sind, wo Phalcon installiert ist. Du brauchst nur solche installieren, welche Deinen Bedürfnissen entsprechen. Wenn Du zum Beispiel eine MySQL-Datenbank nutzt, dann brauchst Du nur PDO und PDO/MySQL Oracle laden und stattdessen SQlite, Postgresql und Mongo ignorieren.",
  "download_developer_tools": "Entwicklungswerkzeuge",
  "download_devtools_1": "Diese Anwendungssammlung enthält nützliche Skripte, um ein Codegerüst zu generieren. Kernkomponenten Deiner Anwendung können mit einem einfachen Befehl erstellt werden - dies ermöglicht die einfache Entwicklung von Anwendungen mit Phalcon.",
  "download_devtools_composer": "Installation via Composer",
  "download_devtools_composer_1": "Installiere Composer in einem beliebigen Verzeichnis:",
  "download_devtools_composer_2": "composer.json wie folgt erstellen:",
  "download_devtools_composer_3": "Führe den Composer-Installer aus:",
  "download_devtools_composer_4": "Erstelle eine Verknüpfung zum phalcon.php-Skript:",
  "download_devtools_docs": "Dokumentation: <a href=':1:'>Phalcon Entwicklerwerkzeuge</a>",
  "download_devtools_download": "Du kannst ein Cross-Plattform-Paket mit den Entwicklertools von <a href=':1:'> Github</a> herunterladen oder Klonen.",
  "download_docker": "Docker",
  "download_docker_1": "Es gibt viele Arten auf die Phalcon mit Docker genutzt werden kann.",
  "download_docker_2": "Unsere offiziellen Images befinden sich <a href=':1:'> hier</a>. Pull-Requests und Verbesserungen sind immer willkommen. Hier befindet sich das Repository für die Docker-Dateien:",
  "download_docker_3": "Mit Phalcon-compose können Sie eine isolierte Umgebung mit Docker erstellen, mit der Sie Phalcon ohne zusätzliche Installation verwenden können. Beachten Sie, dass die Verwendung von Phalcon-composer folgendes erfordert ",
  "download_docker_4": "und",
  "download_docker_5": "Dienste",
  "download_docker_6": "Phalcon Compose stellt standardmäßig die folgenden Dienste bereit:",
  "download_docker_7": "Phalcon Compose ist einfach zu benutzen. Angenommen Sie müssen eine App erstellen, welche an folgendem Ort liegt: ",
  "download_docker_8": "Wir müssen nun den folgende Befehl ausführen, um unsere Container-Anwendung zu erstellen:",
  "download_docker_9": "Der obige Befehl wird das Skelett der Docker Umgebung herunterladen.",
  "download_docker_10": "Variablen",
  "download_docker_11": "Sie müssen eine neue Datei erstellen, diese nennen Sie dann",
  "download_docker_12": "in",
  "download_docker_13": "Eine Beispiel-Datei wurde zur Verfügung gestellt",
  "download_docker_14": "Passe Sie die Variablen ihren Bedürfnissen an. Die wichtigste Variable ist die",
  "download_docker_15": "Ändern Sie den Namen in etwas, das Sie verwenden können. In unserem Fall lassen wir nur die Standardeinstellung genannt ",
  "download_docker_16": "Öffnen Sie die Hosts-Datei (<code>Hosts/Etc/Hosts</code>) und geben Sie eine neue Zeile wie folgt ein:",
  "download_docker_17": "Vielleicht möchten die <code>docker-compose.yml</code>-Datei bearbeiten und Dienste entfernen, die Sie nicht verwenden werden. Phalcon Compose bietet, wie oben erwähnt, eine Menge von Diensten, so dass Ihre Anwendung eventuell einige davon nicht benötigt. Entfernen die entsprechenden Dienste aus der <code>docker-compose.yml</code>-Datei um die Speicherauslastung Ihrer Umgebung zu verringern.",
  "download_docker_18": "Version",
  "download_docker_19": "Sie können nun die Umgebung erstellen.",
  "download_docker_20": "Container werden bei Bedarf heruntergeladen und auf Ihrem System installiert.",
  "download_docker_21": "Start",
  "download_docker_22": "Sie können die Umgebung nun starten:",
  "download_docker_23": "Gehen Sie zu :1: in Ihrem Browser und Sie werden sehen, dass Ihre Umgebung eingerichtet ist. Sie können jetzt Ihre Anwendung im Ordner \"app\" entwickeln.",
  "download_docker_24": "Ausschalten",
  "download_docker_25": "Um die Umgebung bei nicht-gebrauch auszuschalten können Sie den folgenden Befehl nutzen:",
  "download_docker_26": "Weitere Informationen finden Sie hier: ",
  "download_examples": "Vorinstallierte Beispiele",
  "download_examples_1": "Die folgenden Beispiele sind auf allen Vagrant-Containern vorinstalliert:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Eine Version für FreeBSD ist vorhanden. Du musst lediglich die folgenden Befehle ausführen um sie zu installieren:",
  "download_ide_stubs": "IDE-Integration",
  "download_ide_stubs_1": "Das Video unten beschreibt, wie IDE Stubs für PhpStorm aktiviert werden",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Brauchen Sie Hilfe?",
  "download_need_help_1": "Schauen Sie auf unserer <a href=':1:'> Support-Seite</a> nach Möglichkeiten, Unterstützung zu erhalten. Wir tun unser Bestes, um Ihnen zu helfen.",
  "download_note": "Phalcon ist eine in C geschriebene Erweiterung, daher musst Du die passende Binary herunterladen oder neu kompilieren.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Ein Paket ist <a href=':1:'> hier</a> verfügbar (Dank an <a href=':2:'> Mariusz Łączak</a>)",
  "download_requirements": "Systemanforderungen",
  "download_requirements_1": "Es werden einige vorinstallierte Softwarepakete benötigt:",
  "download_requirements_2": "PHP5-Entwicklerressourcen",
  "download_requirements_3": "GCC-Compiler",
  "download_source_code": "Source Code:  <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Source Code (wechseln Sie bitte in den entsprechenden Branch): <a href=':1:' target='_download' title='GitHub Repo'> Github</a>",
  "download_ubuntu": "Um Phalcon unter Ubuntu zu installieren folge diesen Schritten:",
  "download_ubuntu_1": "Wenn dir apt-add-repository fehlt führe folgendes aus:",
  "download_ubuntu_2": "Wenn Sie die ältere Version von Phalcon (1.x) installieren möchten, verwenden Sie die folgende PPA: ",
  "download_ubuntu_or_debian": "Ubuntu oder Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'> Vagrant</a> ist ein hervorragendes Tool zum Erstellen und Konfigurieren von leichten, reproduzierbaren und portablen Entwicklungsumgebungen.",
  "download_vagrant_2": "Nutze einen der folgenden Container um Phalcon auf einer vorkonfigurierten Umgebung zu testen oder um etwas zu entwickeln.",
  "download_vagrant_boxes": "Vagrant-Container",
  "download_windows": "Windows-DLLs",
  "download_windows_download": "Download",
  "download_windows_dlls": "Windows-DLLs können von unserer Github Release Seite <a href=':1:'> hier</a> heruntergeladen werden",
  "download_windows_guides": "Ähnliche Anleitungen",
  "download_windows_guides_wamp": "WAMP Installation",
  "download_windows_guides_xampp": "XAMPP Installation",
  "download_windows_installation": "Installation",
  "download_windows_installation_1": "Um Phalcon unter Windows zu verwenden, können Sie eine DLL-Bibliothek herunterladen. Bearbeiten Sie Ihre php.ini, fügen Sie am Ende hinzu und starten Sie Ihren Webserver um die Erweiterung zu laden. <a href=':1:'>Mehr</a>.",
  "download_windows_note": "Wir empfehlen Ihnen dringendst die letztmögliche PHP-Version passend zu unseren DLLs zu nutzen, da Sie nur auf diesem Weg den vollen Funktionsumfang von Phalcon nutzen können.",
  "download_windows_older": "Ältere Versionen",
  "download_windows_stable": "Veröffentlichte Versionen",
  "encryption": "Verschlüsselung",
  "encryption_1": "Phalcon bietet Verschlüsselung über die Phalcon\\Crypt-Komponente. Diese Klasse bietet einfache objektorientierten Wrapper um die Openssl PHP Verschlüsselungsbibliothek.",
  "encryption_2": "Dies ist ein geheimer Schlüssel (32 Byte).",
  "encryption_3": "Dies ist der Text, den Sie verschlüsseln möchten.",
  "events": "Ereignisse",
  "events_description": "Erweitern Sie der Großteil der Framework-Komponenten durch Festlegen von \"hook Punkten\". Erstellen Sie Ihre eigenen Ereignisse und machen Sie Ihre Anwendung flexibler und leistungsfähiger",
  "events_management": "Eventmanagement",
  "events_management_1": "Ein Ereignis Manager ermöglicht es uns, Listener an bestimmte Ereignisse zu knüpfen. Der Typ, der uns jetzt interessiert ist \"dispatch\". Der folgende Code filtert alle Ereignisse, die vom Dispatcher produziert wurden:",
  "events_management_2": "Erstellt einen Event-Manager",
  "events_management_3": "Auf Ereignisse des Dispatcher mit dem Security-plugin reagieren",
  "events_management_4": "Behandlung von Ausnahmen und nicht gefundener Ausnahmen mit dem NotFoundPlugin",
  "events_management_5": "Dem Dispatcher die Event-Manager zuweisen",
  "facebook": "Facebook",
  "flash_messages": "Flash Messages",
  "flash_messages_1": "Benutzen Sie den Flash-Notifier um Benachrichtigungen an einen Benutzer in einer Webanwendung anzuzeigen:",
  "flash_messages_2": "es existierten Fehler im Formular",
  "flash_messages_3": "ja!, alles verlief reibungslos",
  "flash_messages_4": "dies ist ein Hinweis für Benutzer",
  "flash_messages_5": "dies ist nur eine Warnung",
  "flash_messages_description": "Flash-Mitteilungen werden verwendet, um den Benutzer über den Status der Aktionen zu informieren.",
  "forms_builder": "Formulargenerierung",
  "forms_builder_1": "Jedes Element im Formular kann nach Bedarf durch den Entwickler gerendert werden. Intern wird Phalcon\\Tag verwendet, um den korrekten HTML-Code für jedes Element zu produzieren und Sie können zusätzliche HTML-Attribute als zweiten Parameter der render() Funktion übergeben:",
  "forms_builder_2": "Home",
  "forms_builder_3": "Mobiltelefon",
  "forms_builder_description": "Einfach HTML-Formulare erstellen",
  "forum": "Forum",
  "gab": "Gab.ai",
  "get_phalcon": "Hol' Dir Phalcon",
  "github": "GitHub",
  "google_plus": "Google+",
  "header_slogan": "Seine überzeugende Architektur macht Phalcon zum schnellsten PHP Framework das es je gab!",
  "header_tagline": "Ein full-stack PHP Framework als C basierte Erweiterung",
  "high_performance_php_framework": "Hochleistungs-PHP-Framework",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud bietet eine skalierbare Lösung bei der nur die tatsächlich genutzten Ressourcen bezahlt werden.",
  "hosting_amazon_ec2_2": "Wählen Sie eine vorkonfigurierte, vorgefertigte Amazon Maschine Image (AMI), und sie läuft sofort. Oder erstellen Sie ein AMI, die Ihre Anwendungen, Bibliotheken, Daten und zugehörigen Konfigurationseinstellungen enthält. <a href=':1:'> mehr sehen</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows and Linux cPanel shared web hosting packages and plans, no configuration or installation required! ASPnix offers a variety of PHP versions from 5.2 - 7.2 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "Die <a href=':1:'> Windows Azure-Cloud</a> bietet Ihnen hoch skalierbares und verwaltbares Windows hosting für Ihre Web-Anwendungen. Verwenden Sie Phalcon um Ihre Instanz-Kosten zu senken.",
  "hosting_azure_2": "Um Phalcon zu installieren, befolgen Sie die Schritt-für-Schritt-Anleitung in <a href=':1:'> diesem SitePoint Artikel </a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon kann auf jedem Computer installiert werden, sofern ein SSH Root (oder sudo) Zugriff vorhanden ist. Unten findest Du eine Reihe von Firmen, welche dies anbieten:",
  "hosting_digital_ocean_1": "Extrem schnelle Cloud-Technologie. Gebaut für Entwickler. Bereitstellung eines SSD-Cloud-Servers in 55 Sekunden. <a href=':1:'> mehr sehen</a>",
  "hosting_digital_ocean_2": "Folgen Sie diesem <a href=':1:'> Tutorial</a> für den Einstieg",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT-Host bietet mehrere günstige und qualitativ hochwertige Hosting-Angebote.",
  "hosting_dcthost_2": "Standardmäßig haben sie Phalcon auf ihren shared Hosting-Paketen installiert.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit bietet verschiedene Hostingprodukte an, welche die Wünsche von Entwicklern für nahezu sämtliche Anwendungsfälle befriedigen sollten.",
  "hosting_fortrabbit_2": "Sie bieten eine Vielzahl von <a href=':1:'>Erweiterungen</a>, die selbst das anspruchsvollste Projekt erfüllen würden.",
  "hosting_fortrabbit_3": "Stabile Versionen von Phalcon sind vorinstalliert, Du kannst diese einfach von dem Administrations-Dashboard aus aktivieren.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Installiere Phalcon mithilfe der Standardanleitung.",
  "hosting_kinghost_1": "Seit 2006 ist KingHost einer der größten Hosting-Unternehmen in Brasilien und hat bereits mehr als 300.000 Seiten mit ca. 60.000 Kunden gehostet. Mit Sitz in Porto Alegre (RS), mit Rechenzentren in Brasilien, bietet das Unternehmen den Hosting-Service von gemeinsam genutzten Servern, konkrete Pläne für benutzerdefinierte Entwickler und Projekte im Bereich der Enterprise-Lösungen, Cloud computing und dedizierte Server. Es bietet auch digitale Marketinglösungen wie e-Mail Marketing und Security-Lösungen.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "Du machst den Code, wir machen die Server. Next generation, auto-sizing PaaS für PHP",
  "hosting_layershift_2": "Folgen Sie diesem <a href=':1:'> Tutorial</a> für den Einstieg",
  "hosting_layershift_title": "Ebenenschicht",
  "hosting_linode_1": "Bereitstellen und Verwalten von virtuellen Linux-Servern in der Cloud Linode. Erhalten Sie einen Server in Sekunden mit Ihrer Wahl der Linux-Distribution, Ressourcen und Position für Knoten. <a href=':1:'> mehr sehen</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "Hochleistungs-Dedizierte-Server mit Schutz vor Bedrohungen, einschließlich Distributed Denial of Service (DDoS)-Angriffen. Unser Hochleistungs-DDoS-geschütztes Netzwerk kann vor DDoS-Angriffen bis zu 4,2 Tbps <a href=':1:'> mehr sehen</a> Ihren dedizierten Server automatisch schützen",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud-Server sind virtuelle Maschinen, die unter Linux oder Windows&reg; Server in die Rackspace Cloud laufen. Sie können Ressourcen wie CPU, Arbeitsspeicher und Speicherplatz, je nach Bedarf, nach oben oder unten skalieren. Und das beste ist, Sie zahlen nur das, was Sie verbrauchen. <a href=':1:'> mehr sehen</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting für Entwickler. Shell Zugang und schnelle Server auf denen sämtliche Werkzeuge vorinstalliert und gewartet werden.",
  "hosting_webfaction_2": "Um Phalcon in WebFaction zu installieren, folgen Sie den Anweisungen welche <a href=':1:'> hier</a> beschrieben sind",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "Die Komponente Phalcon\\Translate hilft beim Erstellen von mehrsprachigen Anwendungen. Anwendungen, mit dieser Komponente zeigen Inhalte in verschiedenen Sprachen, basierend auf der gewählten Sprache des Benutzers, welche von der Anwendung unterstützt wird.",
  "i18n_2": "Den Browser fragen, was die beste Sprache ist",
  "i18n_3": "Überprüfen Sie, ob wir eine Übersetzungsdatei für diese Sprache haben",
  "i18n_4": "Fallback auf einen Standard",
  "i18n_5": "Gibt ein Übersetzungs-Objekt zurück",
  "i18n_description": "Einfach Ihre Anwendungen in viele Sprachen übersetzen",
  "installing_phalcon_php": "Phalcon PHP installieren",
  "issue_tracker": "Bug-Tracker",
  "join_our_community": "Kommen Sie zu unserer Vagrant Entwicklergemeinschaft!",
  "join_our_community_description": "Community-Beiträge in Erweiterungen, Plugins, Adaptern, VM, Beispielen, Quellcode... und mehr",
  "language_text": "Englisch",
  "learn": "Lernen",
  "license_new_bsd": "Phalcon ist ein Open-Source-PHP-Framework <br /> dass als C-Erweiterung erstellt wird. Es steht unter der <br /> <a href='http: //opensource.org/licenses/BSD-3-Clause' target='_blank'> neuen BSD-Lizenz</a>.",
  "low_overhead": "Kaum Overhead",
  "low_overhead_1": "Zephir/C Erweiterungen werden einmalig zusammen mit PHP bei dem Web-Server Daemon Startprozess geladen",
  "low_overhead_2": "Die von der Erweiterung zur Verfügung gestellten Klassen und Funktionen sind bereit in jeder Anwendung verwendet zu werden",
  "low_overhead_3": "Der Code wird kompiliert und ist nicht interpretiert, da er bereits für eine bestimmte Plattform und Prozessor kompiliert wurde",
  "low_overhead_4": "Dank der Low-Level-Architektur und Optimierungen <strong>bietet Phalcon den geringsten Aufwand für MVC-basierte Anwendungen</strong>",
  "low_overhead_description": "Geringen Speicherverbrauch und CPU im Vergleich zu herkömmlichen Frameworks",
  "low_overhead_title": "C PHP-Erweiterung (Phalcon)",
  "more": "MEHR...",
  "mvc": "MVC",
  "mvc_1": "Erstellen Sie Einzel- und Multi-Module-Anwendungen mit Leichtigkeit und Freude. Mit den Datei-Strukturen, Schemata und Muster, welche Sie bereits kennen.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Module, Komponenten, Modelle, Ansichten und Controller",
  "odm_for_mongo": "ODM für MongoDB",
  "odm_for_mongo_1": "Zusätzlich zu dessen Fähigkeit, Tabellen in relationalen Datenbanken abzubilden kann Phalcon Dokumente einer MongoDB-Datenbank zuordnen. Die ODM bietet eine CRUD-Funktionalität, Ereignisse, Validierungen zwischen anderen Services.",
  "odm_for_mongo_2": "Wie viele Roboter gibt es?",
  "odm_for_mongo_3": "Wie viele mechanische Roboter gibt es?",
  "odm_for_mongo_4": "Es gibt :1: Roboter",
  "odm_for_mongo_description": "Objekt-Dokumenten-Mapping für MongoDB",
  "oops": "Houston, wir haben ein Problem!",
  "or": "oder",
  "orm": "ORM",
  "orm_1": "Eine leistungsstarkes ORM wird von Phalcon bereitgestellt sodass Sie Datenbank-Datensätzen als Klassen und Objekte manipulieren können. MySQL, PostgreSQL und SQLite werden von Grund auf unterstützt.",
  "orm_description": "Objekt-relationales Mapping",
  "phalcon_team": "Das Phalcon-Team",
  "phalcon_team_1": "Viel mehr Menschen",
  "phalcon_team_2": "Phalcon ist und war schon immer ein Ergebnis von vielen Freiwilligen: ",
  "phql": "PHQL",
  "phql_1": "PHQL ist ein High-Level, Objekt-orientierter SQL-Dialekt, der es ermöglicht Abfragen unter Verwendung einer standardisierten SQL-ähnliche Sprache zu schreiben. PHQL ist als ein Parser (in C geschrieben) implementiert, welcher die Syntax in die des Ziels RDBMS übersetzt. Um die höchste Leistung zu erreichen, bietet Phalcon einen Parser, der die gleiche Technologie wie SQLite verwendet. Diese Technologie bietet einen kleinen speicherinternen Parser mit einem sehr geringen Speicherbedarf, der auch threadsicher ist.",
  "phql_2": "Name",
  "phql_description": "Die leistungsfähige und sichere Phalcon Abfragesprache, PHQL",
  "polling_app": "Ein Polling-App von Grund auf in <15 min erstellt",
  "queueing": "Queueing",
  "queueing_1": "Aktivitäten wie Verarbeitung von Videos, Bildgrößeänderung oder Senden von E-Mails sind nicht geeignet, um online oder in Echtzeit ausgeführt zu werden, da es die Ladezeiten der Seiten langsam und die Benutzerfreundlichkeit erheblich beeinträchtigen kann. Die beste Lösung hier ist Hintergrundjobs einzusetzen. Die Webanwendung stellt Aufträge in eine Warteschlange welche separat verarbeitet werden.",
  "queueing_2": "Mit der Queue verbinden",
  "queueing_3": "Legen Sie den Auftrag in die Warteschlange",
  "queueing_description": "Verwenden Sie das integrierte Queueing-System in Phalcon um Jobs einplanen und die Belastung des Webservers zu reduzieren",
  "resources": "Resourcen",
  "rest": "REST",
  "rest_description": "In diesem Fall können Sie entweder eine micro oder full Stack-Anwendung nutzen, um Ihr Ziel zu erreichen. Darüber hinaus eine leistungsstarke Reihe von HTTP-Helfern.",
  "restful_services": "RESTful Services",
  "restful_services_1": "REST-Server und Anwendungen zu schreiben war noch nie einfacher. Keine vorformulierten Texte. Einfache Services passen in eine Datei.",
  "restful_services_2": "Zurückgeben von Daten als JSON",
  "roadmap": "Roadmap",
  "router": "Router",
  "router_1": "Routing, wie es sein soll. Nicht mehr. Nicht weniger.",
  "router_2": "Erstellen Sie den router",
  "router_3": "Eine Route definieren",
  "router_description": "Phalcon\\Mvc\\Router bietet erweiterte routing-Funktionen.",
  "sample_applications": "Beispielanwendungen",
  "see_for_yourself": "Sehen Sie selbst...",
  "sharding": "Sharding",
  "sharding_1": "Modelle an verschiedenen Datenbanken binden",
  "sharding_2": "Dieser Service liefert eine MySQL-Datenbank",
  "sharding_3": "Dieser Service liefert eine PostgreSQL-Datenbank",
  "sharding_description": "Verbinden, Speichern und Abrufen von Daten aus vielen Datenbanksystemen zur gleichen Zeit",
  "slack": "Slack",
  "something_went_wrong": "Etwas ist schief gelaufen :(",
  "sponsored_by": "Gesponsert von",
  "sponsors": "Sponsoren",
  "sponsors_and_supporters": "Sponsoren und Förderer",
  "sponsors_and_supporters_upper": "SPONSOREN UND FÖRDERER",
  "sponsors_become_patron": "Werde ein Patron!",
  "sponsors_description_1": "Für diejenigen, die unsere Arbeit unterstützen und die Weiterentwicklung von Phalcon vorantreiben möchten, bieten wir verschiedene Sponsoring-Möglichkeiten an, die in jedes Budget passen. Sponsoring unserer Arbeit ermöglicht es uns, dem Projekt mehr Zeit zu widmen, schnellere Reaktionen auf Bugs und Features zu bieten und dem Projekt Stabilität zu gewährleisten.",
  "sponsors_our_great_sponsors": "Das sind unsere Sponsoren! Danke!!",
  "stack_overflow": "Stack Overflow",
  "store": "Shop",
  "support": "Hilfe",
  "support_discord": "Sei Teil von Phalcon <a href=':1:'>Discord</a>",
  "support_documentation_1": "Bitte nutze zuerst :1:. Du kannst zudem die Suchfunktion in unserer Dokumentation nutzen, um zu finden, was Du suchst. Falls Deine Frage noch immer nicht beantwortet wurde, findest Du im Folgenden weitere Möglichkeiten.",
  "support_download_page": "Download-Seite",
  "support_note_1": "Unsere große Community und Mitwirkende beraten Sie gerne! Bitte verwenden Sie diese Community-Ressourcen um Hilfe zu erhalten.",
  "support_note_2": "Viele Fehler entstehen, weil Nutzer nicht die aktuellste Version benutzen. Bitte besuche :1:, lade die aktuellste verfügbare Version herunter (oder kompiliere diese) und prüfe, ob das beobachtete Fehlverhalten tatsächlich noch ein Fehler ist.",
  "support_phalcon_forum": "Fragen bitte im <a href=':1:'>Offiziellen Forum</a> stellen",
  "support_please_note": "Bitte beachte:",
  "support_please_note_1": "Stack Overflow steht in keiner Verbindung zu Phalcon",
  "support_please_note_2": "Bitte erstellen Sie keinen neue Bugs hier. Bitte verwenden Sie dafür den <a href=':1:'> Issue tracker</a> auf Github",
  "support_please_note_3": "Bitte fragen Sie hier nicht nach Feature-Requests. Bitte verwenden Sie dafür den <a href=':1:'> Issue tracker</a> auf Github",
  "support_please_note_4": "Stelle sicher, dass Du 'phalcon' als Tag in der Frage integrierst",
  "support_please_note_5": "Stelle sicher, dass Du 'Phalcon' in der Frage erwähnst",
  "support_reporting_a_bug": "Fehler melden",
  "support_reporting_a_bug_0": "Wenn Sie immer noch glauben, einen Fehler gefunden zu haben, <a href=':1:'> Öffnen Sie bitte ein Thema</a>",
  "support_reporting_a_bug_1": "Bitte melden Sie Fehler, wenn Sie alle oben genannten Optionen ausgeschöpft haben mit dem <a href=':1:'> Issue tracker</a> auf Github.",
  "support_slack": "Es gibt eine weniger aktive, aber immer noch funktionierende Gemeinschaft auf <a href=':1:'> Slack</a>",
  "support_stack_overflow": "Eine weitere Möglichkeit Fragen zu stellen auf <a href=':1:' target='_blank'> Stack Overflow</a> und markiere es mit <a href=':2:'> <code>phalcon</code></a>",
  "support_social_network_accounts": "Unsere social Network-Konten sind: <a href=':1:'> Gab.ai</a>, <a href=':2:'> Twitter</a>, <a href=':3:'> Facebook</a> und <a href=':4:'> Google +</a>",
  "support_us": "Unterstützen Sie uns",
  "team": "Team",
  "team_andres_1": "Andres ist kein Open-Source-Neuling. In den letzten neun Jahren hat er verschiedene Frameworks für PHP entwickelt und veröffentlicht. Zudem ist er mit der Entwicklung von Webanwendungen vertraut - seiner Hauptleidenschaft.",
  "team_andres_2": "Als TR35-Gewinner versucht Andres mit der richtigen Wahl und Implementation oder dem richtigen Werkzeug einen Auftrag mit Fokus auf Durchsatz auszuführen. Um dies zu erreichen entwickelte er 2011 die Idee eine neue Art von Framework für PHP-Entwickler zu entwerfen, welches auf Benutzerfreundlichkeit, Funktionsreichtum und insbesondere Geschwindigkeit ausgelegt ist.",
  "team_andres_3": "Durch diesen neuen innovativen Ansatz wurde Phalcon geboren. Ein PHP-Framework, in C geschrieben, welches zahlreiche Funktionen für Entwickler bietet und trotzdem maximale Geschwindigkeit und minimalen Ressourcenverbrauch vereint.",
  "team_andres_4": "Andres ist einer der Kernentwickler von Phalcon und die Inspirationsquelle des Projektes.",
  "team_eduar_1": "Eduar ist ein C/PHP-Entwickler mit mehrjähriger Erfahrung in der Anwendungsentwicklung. Er ist einer der Gründer und leitende Entwickler des Phalcon Projekts, welches im Jahr 2011 begann.",
  "team_eduar_2": "Er hat in allen Bereichen, vom framework Design bis zu den internen Kernfunktionen, einschließlich Dokumentation und Entwickler-Tools teilgenommen. Er treibt eine Faszination mit Frameworks, Sprachen und neue Technologien.",
  "team_eduar_3": "Eduar mag Science-Fiction-Filme und spielt manchmal Fußball.",
  "team_nikolay_1": "Nikolay entwickelt seit mehr als 10 Jahren Webanwendungen. Er ist sowohl mit hochperformanten, als auch komplexen Websites und Designs vertraut.",
  "team_nikolay_2": "Nikolay arbeitet bereits seit langem mit Open-Source-Projekten und nutzt diese immer, wenn die Anforderungen dies zulassen. Auf diese Art und Weise verbringt er einen großen Teil seiner Freizeit mit der Community, um einen Beitrag zur Entwicklung der Anwendungsarchitektur und der Geschwindigkeit beizusteuern. Er half insbesondere bei der Verbesserung von Open-Source CMS-Systemen, bei welchen er viel positives Feedback von der Community erhielt.",
  "team_nikolay_3": "Seine große Erfahrung mit Open-Source Projekten half ihm, sein technischen Wissen zur verbessern und dies der Gemeinschaft zur Verfügung zu stellen. ",
  "team_nikolay_4": "Nikolay ist ein begeisterter Unterstützer von maximaler Performance bei Webanwendungen. Nachdem er Phalcon kennen lernte, beschloss er diese Ideen weiter zu verfolgen und wurde ein Evangelist des Projektes. Er betreut die russische Community und bietet Ressourcen für russisch-sprechende Entwickler.",
  "team_nikolay_5": "Seine Beiträge sind unter anderem: Eine Spiegelung der Haupt-Website auf Russisch (<a href=':1:'> http://www.phalcon.ru</a>), eine Spiegelung des Dokumentations Repositorys in russischer Sprache (<a href=':2:'> http://docs.phalconphp.ru</a>), laufende Änderungen und Korrekturen an der Dokumentation in englischer Sprache, eine Gruppe im sozialen Netzwerk Vkontakte (<a href=':3:'> https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos arbeitet seit mehr als 20 Jahren in der IT-Industrie. Im Jahr 2000 wurde er Teil der PHP-Welt und nutzt die Sprache seitdem für persönliche Projekte und Projekte seiner Arbeitgeber.",
  "team_nikos_2": "Er liebt es, neue Technologien und Wege zu entdecken, welche eine Integration mit bestehenden Anwendungen ermöglichen. Dies führt zur Maximierung von Vorteilen sämtlicher beteiligten Projekte.",
  "team_nikos_3": "Er ist ein begeisterter Unterstützer von Test Driven Development (TDD) und versucht immer, seinen Programmcode vollständig abzudecken.",
  "team_nikos_4": "Nikos bestehendes Interesse an neuen und innovativen Technologien abseits der bestehenden Wege führte ihn zu Phalcon. Er trat dem Kernteam bei und seine Aufgaben betreffen vor allem die Koordinierung von NFRs, Fehlerberichten, Hilfe mit Tests, Dokumentation und dem Incubator. Nikos ist zudem für die Bereitstellung der Windows DLLs des Projektes zuständig und bietet - wann immer dies möglich ist - Hilfe und Support.",
  "team_paul_1": "Paul bezeichnet sich als sehr glücklich, das letzte Jahrzehnt seines Lebens mit dem Schreiben von benutzerfreundlicher Software mit Hilfe von open-Source-Frameworks und Tools wie Phalcon verbracht zu haben. Infolgedessen, verbringt er seine Freizeit damit, FOSS Werkzeuge und das Leben anderer Entwicklern, wie ihn selbst, zu verbessern. Er hat ein starkes Bedürfnis nach einfachen Code und verständlichem UX. Mit Phalcon konzentriert er sich auf die Dokumentation, neue User Experience, Beziehungen zur Mitwirkenden und Gemeinschaft zu erweitern.",
  "team_paul_2": "Paul begann vor kurzem seine eigene Firma zu gründen, um seine Leidenschaft der Erstellung intuitiveren Software mit neuen Technologien wie, ReactJS, Webpack, Ruby und Elixir(Erlang) zu folgen. Jetzt ergänzt er stolz Zephir und Phalcon dieser ständig wachsenden Liste und freut sich, die Rolle des Cheerleaders für ihre innovativen Funktionen zu übernehmen.",
  "team_paul_3": "Falls er einmal nicht programmiert, folgt Paul der Spuren seiner Frau und entwickelt sein Interesse an der Videografie und Video Produktion. Er betreibt einen pädagogischen YouTube Kanal, der sich derzeit auf Phalcon konzentriert und je nach Bedarf als Informatik-Dozent.",
  "team_serghei_1": "Serghei arbeitet seit über 8 Jahren als Ruby/PHP-Entwickler und hat sich auf Web-Anwendungsentwicklung spezialisiert. Als Unterstützer und Verfechter des Behaviour Driven Development (BDD) ist er auch ein Mitglied des <a href=':1:'> Codeception</a>-Teams.",
  "team_serghei_2": "Serghei findet sich tief in innovative Technologien wieder, welches ihn in Phalcon einführt. Er ist verantwortlich für die Koordination von Bug-Fixes, Tests, Entwickler-Tools, Inkubator und um andere Phalcon-Projekten zu unterstützen.",
  "team_serghei_3": "Wenn er nicht arbeitet, genießt es Serghei Dokumentationen oder Science-Fiction-Filme anzuschauen und spielt manchmal Mahjong oder Go.",
  "team_volodymyr_1": "Volodymyr entwickelt seit über 20 Jahren Server und Web-Anwendungen. Er war am Design und Schreiben von sehr komplexen und leistungsstarken Software-Anwendungen beteiligt. Volodymyr Leidenschaft für das Schreiben von schneller, robuster und optimierter Software brachte ihn zu Phalcon und trat dem Entwicklungs-Team bei.",
  "team_volodymyr_2": "In seiner Freizeit genießt Volodymyr das Unternehmen seiner geliebten Frau, trägt zu Source-Projekte bei und studiert Fremdsprachen.",
  "template_engine_volt": "Template-Engine (Volt)",
  "template_engine_volt_1": "Volt ist eine ultraschnelle und Designer freundliche Template-Sprache geschrieben in Zephir/C für PHP. Es bietet Ihnen eine Reihe von Helfern, um Ansichten auf einfache Weise zu schreiben. Volt ist eng mit anderen Komponenten von Phalcon integriert, Sie können es aber auch als eigenständige Komponente in Ihren Anwendungen verwenden.",
  "template_engine_volt_description": "Eine Template-Engine von Jinja inspiriert aber für PHP in C erstellt",
  "template_engines": "Template-Engines",
  "template_engines_1": "Views stellen die Benutzeroberfläche Ihrer Anwendung dar. Views sind oft HTML-Dateien mit eingebetteten PHP-Code, der Aufgaben ausschließlich im Zusammenhang mit der Darstellung der Daten übernimmt. Views übernehmen die Aufgabe der Bereitstellung von Daten an den Web-Browser oder ein anderes Werkzeug, das verwendet wird, um Anfragen aus Ihrer Anwendung durchzuführen.",
  "template_engines_description": "Views stellen die Benutzeroberfläche Ihrer Anwendung dar",
  "testimonials": "Referenzen",
  "testimonials_1": "Grüße, Phalcon-Team! Ich habe ein Projekt mit dem Phalcon Framework erstellt. Es ist ein Guitarama (<a href=':1:'>:2:</a>) - Gitarren-Tabs und Akkorde-Katalog. Die Website richtet sich an das russischen Publikum und die, die russische Sprache beherrschen, aber ich hoffe, es gibt keine Probleme, die meisten Seiten zu verstehen. Die Seite wurde wieder auf einer neuen Plattform Anfang Januar 2013 ins Leben gerufen und hat seitdem stetiges Wachstum gezeigt. Aktuelle tägliche Besuche: ~ 1500 Besucher, ~ 5000 Seitenaufrufe. Die Website läuft auf einem alten physischen Server 1хP4 - 3 Ghz, 4 GB RAM. Nochmal vielen Dank für ein großartiges Framework und alles was ihr macht:) Michael.",
  "testimonials_2": "Hallo, Phalcon-Team. Ich würde gerne unsere Erfolgsgeschichte über Phalcon in <a href=':1:'>:2:</a> und <a href=':3:'>:4:</a> Projekte mit Ihnen teilen, die am meisten besuchte und Highloaded Seiten in Kasachstan, in TOP-10 klassifizierten Websites in den GUS-Staaten eingestuft. Beide Seiten arbeiten an einzelner RESTful-ähnlichen API geschrieben mit Phalcon\\Mvc\\Micro. Bei Spitzenbelastungen verarbeitet die API etwa 400 Req/s und dies ist keine Grenze. Der Umzug nach Phalcon erlaubt uns die Antwortzeit und den Verbrauch von CPU und RAM, sowie die Zeit des Entwicklungsprozesses zu reduzieren. Wir werden weiterhin mit Phalcon in unsere neuen Projekten arbeiten. Vielen Dank für die großartige Arbeit, die ihr macht! Mit freundlichen Grüßen, Nikita Vershinin, Lead Developer, Kolesa.kz und krisha.kz",
  "testimonials_3": "Phalcon-Team, das Framework, dass ihr erstellt habt, ist erstaunlich. Ich habe noch nie ein Framework verwendet, welches Geschwindigkeit, Effizienz, Kürze und Natürlichkeit alles in einem Paket kombiniert hat. Ich beabsichtige es zu verteidigen und einen Beitrag zum Projekt in irgendeiner Weise die ich, kann zu leisten. Ich begann vor kurzem ein ~ 800 Stunden Projekt und freue mich zu sagen, dass wir Phalcon Framework nutzen. Bravo. Brian Seymour",
  "testimonials_4": "Hallo Leute, ich bin gerade auf Phalcon gestoßen und es ist einfach genial! Ich wollte nur sagen wie toll ihr seid! Also, vielen Dank für diese Framework und macht weiter solche gute Arbeit! Ivan Penchev",
  "testimonials_5": "Hallo Leute, ich haben einen einfachen Url-Shortener Dienst mit Phalcon geschrieben. Das war unglaublich! Wirklich. <a href=':1:'>:2:</a>. Demo ist hier: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Hallo Phalcon-Team, ich habe ein kleines Projekt für polnische Benutzer mit Ihrem Framework entwickelt. Ich muss zugeben, dass die Leistung erstaunlich ist, herzlichen Glückwunsch, guter Job. Ein Service um den Inhalt der Web-Seiten in polnischer Sprache zu überprüfen <a href=':1:'>:2:</a>",
  "testimonials_7": "Hallo Leute! Ich wollte nur die neueste Version von unserem alten Projekt - <a href=':1:'>:2:</a> mit Ihnen teilen. Umstellung auf Phalcon erlaubt uns, die Auslastung des Servers im Vergleich zu den vorherigen Framework zu halbieren, und das ist großartig!",
  "testimonials_description": "Unten stehend finden Sie eine Sammlung von Referenzen und Erfolgsgeschichten, von Ihnen, den Entwicklern und Anwendern von Phalcon PHP. Wir begrüßen E-Mails mit Erfolgsgeschichten und werden über solche in unserem Blog berichten. Wenn Sie möchten, senden Sie uns Ihre Erfolgsgeschichte oder kontaktieren Sie uns, zögern Sie nicht, uns zu mailen an <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Navigation umschalten",
  "transactions": "Transaktionen",
  "transactions_1": "Wenn ein Prozess mehrere Datenbank-Operationen durchführt, könnte es wichtig sein, dass jeder Schritt erfolgreich abgeschlossen ist, damit die Datenintegrität gewahrt werden kann. Transaktionen bieten die Möglichkeit, sicherzustellen, dass alle Datenbank-Operationen erfolgreich durchgeführt wurden, bevor die Daten an die Datenbank übergeben werden.",
  "transactions_2": "Einen Transaktion Manager erstellen",
  "transactions_3": "Einer Transaktion anfordern",
  "transactions_4": "Die Roboter sollen gelöscht werden",
  "transactions_5": "Etwas ist schief gelaufen, wir sollten die Transaktion zurückrollen",
  "transactions_6": "Alles ist gut, die Transaktion wird durch einen Commit ausgeführt",
  "transactions_7": "Die Roboter wurden erfolgreich gelöscht!",
  "transactions_8": "Fehlgeschlagen, Grund: ",
  "transactions_description": "Transaktionen in Phalcon ermöglichen es, die Integrität der Daten sicherzustellen.",
  "try_phalcon": "Ausprobieren",
  "tutorial": "Einführungen",
  "twitter": "Twitter",
  "views_and_frontend": "Views & Frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Sieh Dir das Demo Video an",
  "zephir": "Zephir"
}