{
  "about": "Περί",
  "about_blog": "Blog",
  "about_blog_1": "Εάν σας αρέσει να γράφετε, μη ξεχνάτε ότι το <a href=':1:'>blog μας</a> είναι ανοιχτό να τα άρθρα σας. Αν έχετε ένα δικό σας blog και έχετε γράψει κάτι για το Phalcon, μπορούμε να το δημοσιεύσουμε στο κοινωνικό δίκτυο μας, ώστε να επιτευχθεί η μέγιστη ορατότητα. Αν το blog σας είναι σε μια γλώσσα εκτός της αγγλικής, θέλουμε να το μοιραστούμε και να το μεταφράσουμε αν είναι δυνατόν. Εάν γνωρίζετε σχετικά με τα blogs που σχετίζονται με το PHP που ενδιαφέρονται στην παρουσίαση του Phalcon με το κοινό τους, παρακαλούμε να μας ενημερώσετε.",
  "about_description_1": "Καταπληκτικές εφαρμογές χρειάζονται καταπληκτικούς προγραμματιστές. Μπορεί να μην σας γνωρίζουμε ακόμα, αλλά νομίζουμε ότι θα είστε ένα καταπληκτικό ταίρι για τη δημιουργία ενός καλύτερου ιστού. Μαζί, είμαστε έτοιμοι να αλλάξουμε τον κόσμο! Εδώ στο Phalcon, χτίζουμε το νέας γενιάς framework για το PHP. Θέλουμε να σας δώσουμε καταπληκτική απόδοση, ενώ παράλληλα να  βοηθήσουμε την ανάπτυξη των εφαρμογών σας με έναν εύκολο και διασκεδαστικό τρόπο.",
  "about_description_2": "We hope that you enjoy Phalcon as much as we do. We always welcome your collaboration and help! <strong>You don't have to be a C developer to help Phalcon!</strong> There are many other areas that you can contribute:",
  "about_documentation_1": "The repository of this website is available on <a href=':1:'>github</a>. We are using <a href=':2:'>readthedocs</a> to manage our documentation.<br /><br />We always appreciate corrections, additions and enhancements in our documentation, so all you have to do is clone the repository and issue a pull request!<br /><br />If you can help non English speaking developers by translating some of the content to another language, that would be great!",
  "about_documentation_upper": "DOCUMENTATION",
  "about_donations_sponsoring": "Donations / Sponsoring",
  "about_evangelism": "Ευαγγελισμός",
  "about_evangelism_1": "Υπάρχουν πολλοί προγραμματιστές που εξακολουθούν να μην γνωρίζουν ότι Phalcon υπάρχει ή ότι λειτουργεί πραγματικά. Είμαστε σίγουροι ότι πολλοί προγραμματιστές θα επωφεληθούν από ακούσουν για το Phalcon και πώς μπορεί να τους βοηθήσει. Αν γνωρίζετε οποιεσδήποτε εκδηλώσεις/συναντήσεις PHP και θέλετε να δώσετε μια ομιλία για το Phalcon , έχετε την πλήρη υποστήριξή μας. Ποιος δεν θα ήθελε να μάθει για το εργαλείο που φέρνει επανάσταση στην ανάπτυξη εφαρμογών PHP;",
  "about_facebook_page": "Σελίδα Facebook",
  "about_flying_with_phalcon": "Σας ευχαριστούμε που πετάτε με το Phalcon &lt;3",
  "about_follow_on_gab": "Ακολοθήστε μας στο Gab",
  "about_follow_on_twitter": "Ακολοθήστε μας στο Twitter",
  "about_google_plus_page": "Σελίδα Google+",
  "about_official_blog": "Επίσημο Blog",
  "about_sample_applications": "Sample Applications",
  "about_sample_apps_1": "Παραδείγματα μεγάλων εφαρμογών βοηθούν άλλους προγραμματιστές να κατανοήσουν καλύτερα το πώς μεγάλες εφαρμογές μπορούν να δημιουργηθούν με το Phalcon. Μη διστάσετε να μοιραστείτε μαζί μας repositories δειγμάτων εφαρμογών,  βοηθώντας άλλους προγραμματιστές με τη δουλειά τους και επιτρέπωντας άλλους να σας δώσουν ανατροφοδότηση για τη δουλειά σας!",
  "about_screencasts": "Screencasts",
  "about_screencasts_1": "We all love screencasts. If you have some extra time and want to support the community with some nice videos teaching any of the framework's features, it's very welcome. Check out our <a href=':1:'>Vimeo Channel</a> as a guide.",
  "about_share_experiences_1": "Μη ντέπεστε, μοιραστείτε με την κοινώτητα και με μας, τους τρόπους μέσω τους οποίους το Phalcon ήταν χρήσιμο για σας. Αν το Phalcon επέφερε επιτυχία σε σας, ας το μοιραστούμε με την κοινότητα. Επίσης, συζητήστε μαζί μας για το ποια στοιχεία χρειάζονται επιπλέον εργασία, τι θα μπορούσατε να κάνετε πιο εύκολα και ποια είναι τα οφέλη σας με τη χρήση του Phalcon. Παρόλο που όλες οι αιτήσεις αλλαγών/βελτιώσεων δεν μπορούν να υλοποιηθούν άμεσα, η συμβολή σας στις αιτήσεις νέων βελτιώσεων σε μεγάλο βαθμό μας βοηθάει να διαμορφώσουμε το μέλλον του Phalcon. Η γνώμη σας βοηθά όλους μας.",
  "about_share_your_experiences": "Μοιραστείτε τις εντυπώσεις σας",
  "about_social_networks": "Κοινωνικά Δίκτυα",
  "about_social_networks_1": "Phalcon is evolving on a daily basis, through our desire to make it better. Social networks are part of our lives now, and we all interact with others through them. Sharing your Phalcon experience with your social circles will greatly increase the visibility of the project. More and more people will engage in our community, thus making it more powerful, even more feature rich and popular. Like, '+1', share posts that we constantly post on every social network, engage in discussions regarding those posts. People who discover Phalcon through your interactions will thank you!",
  "about_social_networks_2": "Έχουμε παρουσία στα περισσότερα από πιό δημοφιλή κοινωνικά δίκτυα. Ακολουθώντας μας, μας βοηθάτε να αυξήσουμε την δημοσιότητα του Phalcon:",
  "about_sponsoring_1": "Είμαστε μιά μικρή αλλά αποτελεσματική βασική ομάδα προγραμματιστών, που εργάζονται πολύ σκληρά. Προσπαθούμε να ξοδέψουμε όσο πιό πολύ χρόνο μπορούμε για το framework.  Όλα το πάθος μας για το framework είναι αυτό μας κάνει να θέλουμε να είναι καλύτερο κάθε μέρα. Το Phalcon είναι λογισμικό ανοιχτού κώδικα και οι προσπάθειες εθελοντών είναι αναγκαίες για τη συνεχή εξέλιξή του. Μπορείτε να μας βοηθήσουν να διατηρήσουμε την ανάπτυξη ενεργό με δωρεές στο framework ή γινόμενοι σπόνσορς στην ανάπτυξης του. Περισσότερος χρόνος και πόροι για το έργο σημαίνει περισσότερη δράση, μεγαλύτερη βελτίωση, καλύτερη υποστήριξη, πιο εκπληκτικά χαρακτηριστικά, κλπ.",
  "about_star_on_github": "Υποβάλλετε αστέρι για το Phalcon στο Github",
  "about_tests": "Τέστς",
  "about_tests_1": "No software is free of bugs. If you find any, please do not hesitate to tell us. We have a testsuite with more than <a href=':1:'>8000</a> tests. However, unit-tests are never enough. Help us improve our testsuite by adding more tests or improve the current ones. Every added test makes the framework more stable.",
  "about_thank_you": "Ευχαριστούμε!",
  "about_thank_you_1": "Θα θέλαμε να ευχαριστήσουμε όλους τους εισηγητές και τα μέλη της κοινότητας μας, που μας ενθαρρύνουν να κάνουμε το Phalcon το καλύτερο framework στην κατηγορία του. Τα ευγενικά σας λόγια και η συμμετοχή σας είναι οι παράγοντες που μασ ωθούν να κάνουμε κάτι καλύτερο. Ελπίζουμε να ανταποκριθούμε και να υπερβούμε την εμπιστοσύνη που έχετε στο Phalcon.",
  "about_translations": "Μεταφράσεις",
  "about_translations_1": "We are trying to reach as many developers as possible, breaking down the language barriers. We are using <a href=':1:'>:2:</a>, to handle all the words or sentences that need to be translated for this site. The project repository is located <a href=':3:'>here</a> and below you can see the current status of our translation effort.",
  "acl": "ACL",
  "acl_1": "This is how you can built the access control list (ACL):",
  "acl_2": "Create the ACL",
  "acl_3": "The default action is DENY access",
  "acl_4": "Register two roles, Users is registered users",
  "acl_5": "and guests are users without a defined identity",
  "acl_description": "Access Control List allows users to access the modules they're authorized to",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Register namespaces, prefixes, directories or classes. Take advantage of the autoloader events and maintain full control over what files are loaded and from where.",
  "auto_loader_2": "Creates the autoloader",
  "auto_loader_3": "Register some namespaces",
  "auto_loader_4": "Register autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.",
  "basic_features": "Basic Features",
  "blog": "Blog",
  "built_with_phalcon": "Built with Phalcon",
  "cache": "Cache",
  "cache_1": "The cache component allows faster access to frequently used or already processed data. It supports many backends such as Redis, Memcached, Mongo, Files, Apc and more",
  "cache_2": "Set the models cache service",
  "cache_3": "Cache data for one day by default",
  "cache_4": "Memcached connection settings",
  "cache_description": "Improve your performance with many of the backend caches that Phalcon provides",
  "community": "Community",
  "consulting": "Συμβουλευτείτε",
  "consulting_header": "We have partnered with LEZGRO, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "LEZGRO congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve LEZGRO to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Contact LEZGRO through our <a href=':1:'>website</a>, where you can also see samples and testimonials of our work.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Contact us through our <a href=':1:'>website</a>, where you can take a look at the projects we have been involved in.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Συνεισφέρετε",
  "contributors": "Phalcon contributors",
  "contributors_description": "Phalcon is improved everyday by our amazing community",
  "crypt": "Crypt",
  "crypt_description": "Encrypt/Decrypt important data to keep them safe from unauthorized third-parties",
  "data_and_storage": "Δεδομένα και αποθήκευση",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon is built upon a powerful yet easy to understand and use pattern called Dependency Injection. Initialize or define services once - and use them virtually anywhere throughout the application.",
  "dependency_injection_2": "Create the Dependency Injector Container",
  "dependency_injection_3": "Register classes, functions, components",
  "dependency_injection_4": "Use anywhere else in code",
  "dependency_injection_description": "Dependency Injection and Location of services and it's itself a container for them.",
  "docs": "Documentation",
  "documentation": "Τεκμηρίωση",
  "donate": "Δωρεές",
  "download": "Λήψη",
  "download_arch": "Arch Linux",
  "download_arch_1": "There is a PKGBUILD for ArchLinux, available <a href=':1:'>here</a>",
  "download_box_1": "Κουτί #1",
  "download_box_2": "Κουτί #2",
  "download_box_doc_root": "Φάκελος εγγράφων ιστού: :1:",
  "download_box_user_pass": "Χρήστης MySQL: :1: Κωδικός: :2:",
  "download_compilation": "Compilation",
  "download_compilation_1": "Στο Linux μπορείτε εύκολα να εγκαταστήσετε την επέκταση από τον πηγαίο κώδικα.",
  "download_compilation_11": "1. Για να δημιουργήσετε την επέκταση από τον πηγαίο κώδικα C ακολουθήστε τα εξής βήματα:",
  "download_compilation_12": "2. Προσθέστε την επέκταση στο φάκελο php.ini:",
  "download_compilation_13": "3. Επανεκκινείστε τον webserver",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "After requests from the community, the cPanel developers released a custom module that allows for installation of Phalcon in cPanel hosted sites. Information can be found <a href=':1:'>here</a>. The module is maintained in <a href=':2:'>Github</a>.",
  "download_dependencies": "Εξαρτήσεις",
  "download_dependencies_1": "Παρόλο που το Phalcon δεν έχει δυαδικές συνδέσεις με άλλες επεκτάσεις, χρησιμοποιεί κάποιες από αυτές για πλέον λειτουργικότητα. Οι επεκτάσεις που χρησιμοποιούνται είναι:",
  "download_dependencies_2": "Δεν είναι απαραίτητο για όλες τις παραπάνω επεκτάσεις να είναι παρόντες στο σύστημα που έχει το Phalcon εγκατεστημένο. Μπορείτε να εγκαταστήσετε μόνο αυτές τις επεκτάσεις που ανταποκρίνονται στις ανάγκες σας. Για παράδειγμα, αν χρησιμοποιείτε μια βάση δεδομένων MySQL, τότε μπορείτε να φορτώσετε μόνο τις επεκτλασεις PDO και PDO/MySQLαγνοώντας τις Oracle, SQlite, Postgresql και Mongo.",
  "download_developer_tools": "Εργαλεία για προγραμματιστές",
  "download_devtools_1": "Τα εργαλεία αυτά είναι μια συλλογή από χρήσιμα scripts για τη δημιουργία σκελετό κώδικα. Κύρια μέρη της εφαρμογής σας μπορούν να δημιουργηθούνε με μια απλή εντολή, που σας επιτρέπει να αναπτήξετε πολύ εύκολα εφαρμογές με το Phalcon.",
  "download_devtools_composer": "Εγκατάσταση με Composer",
  "download_devtools_composer_1": "Εγκαταστήστε το composer σε μια κοινή τοποθεσία ή στην εφαρμογή σας:",
  "download_devtools_composer_2": "Δημιουργήστε το αρχείο composer.json ως εξής:",
  "download_devtools_composer_3": "Εκτελέστε το πρόγραμμα εγκατάστασης composer:",
  "download_devtools_composer_4": "Δημιουργήστε μια συμβολική σύνδεση στο phalcon.php script:",
  "download_devtools_docs": "Documentation:  <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "You can download or clone a cross platform package containing the developer tools from <a href=':1:'>Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "You can start using Phalcon using Docker.",
  "download_examples": "Προ-εγκατεστημμένα παραδείγματα",
  "download_examples_1": "Τα παρακάτω παραδείγματα εφαρμογών είναι προ-εγατεστημένα σε κάθε κουτί vagrant:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Ένα port είναι διαθέσιμο για το FreeBSD. Χρειάζεται μόνο αυτές τις λίγες εντολές για να το εγκαταστήσετε:",
  "download_ide_stubs": "Στελέχη IDE",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Θέλετε βοήθεια;",
  "download_need_help_1": "Have a look at our <a href=':1:'>support page</a> for ways to get support. We will do our best to help you.",
  "download_note": "Το Phalcon είναι μια C επέκταση, οπότε θα πρέπει να κατεβάσετε ένα δυαδικό για την πλατφόρμα σας ή να το μεταφράσετε από τον πηγαίο κώδικα.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "There is a package available <a href=':1:'>here</a> (thanks to <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Aπαιτήσεις",
  "download_requirements_1": "Χρειάζεστε κάποια πακέτα να έχουν εγκατασταθεί προηγουμένως:",
  "download_requirements_2": "PHP 5.x πόροι για την ανάπτυξη",
  "download_requirements_3": "GCC compiler",
  "download_source_code": "Source Code:  <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Source Code (please switch to the relevant branch): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "Για να εγκαταστήσετε το Phalcon στο Ubuntu, χρειάζετε να ακολουθήσετε τα παρακάτω βήματα:",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command:",
  "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
  "download_ubuntu_or_debian": "Ubuntu or Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> is an excellent tool to create and configure lightweight, reproducible, and portable development environments.",
  "download_vagrant_2": "Χρησιμοποιήστε οποιαδήποτε από τα παρακάτω κουτιά για να δοκιμάσετε ή να αναπτύξετε εφαρμογές με το Phalcon σε ένα προ-ρυθμισμένο περιβάλλον.",
  "download_vagrant_boxes": "Κουτιά Vagrant",
  "download_version": "Download v:1:",
  "download_windows": "Windows DLLs",
  "download_windows_guides": "Σχετικοί Οδηγοί",
  "download_windows_guides_wamp": "Εγκατάσταση σε WAMP",
  "download_windows_guides_xampp": "Εγκατάσταση σε XAMPP",
  "download_windows_installation": "Εγκατάσταση",
  "download_windows_installation_1": "To use phalcon on Windows you can download a DLL library. Edit your php.ini, append at the end, and restart your webserver to load the extension. <a href=':1:'>More</a>.",
  "download_windows_note": "Σας συνιστούμε να χρησιμοποιείτε την πιο πρόσφατη έκδοση του PHP που αντιστοιχοεί στα αρχεία DLL μας, έτσι ώστε να επωφεληθοείτε από το πλήρες σύνολο δυνατοτήτων του Phalcon.",
  "download_windows_older": "Παλιότερες εκδόσεις",
  "download_windows_stable": "Σταθερή/Master Έκδοση",
  "encryption": "Kρυπτογράφηση",
  "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
  "encryption_2": "This is a secret key (32 bytes).",
  "encryption_3": "This is the text that you want to encrypt.",
  "events": "Γεγονότα",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Διαχείριση Γεγονότων",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Create an events manager",
  "events_management_3": "Listen for events produced in the dispatcher using the Security plugin",
  "events_management_4": "Handle exceptions and not-found exceptions using NotFoundPlugin",
  "events_management_5": "Assign the events manager to the dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Flash μηνύματα",
  "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
  "flash_messages_2": "there were errors in this form",
  "flash_messages_3": "yes!, everything went very smoothly",
  "flash_messages_4": "this is a notice for users",
  "flash_messages_5": "this is just a warning",
  "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
  "forms_builder": "Δημιουργία Φόρμων",
  "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
  "forms_builder_2": "Home",
  "forms_builder_3": "Cellphone",
  "forms_builder_description": "Easily create HTML forms",
  "forum": "Φόρουμ",
  "gab": "Gab.ai",
  "get_phalcon": "Get Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "Its innovative architecture makes Phalcon the fastest PHP framework ever built!",
  "header_tagline": "A full-stack PHP framework delivered as a C-extension",
  "hosting": "Φιλοξενεία",
  "hosting_amazon_ec2_1": "Το Amazon Elastic Compute Cloud προσφέρει επεκτάσιμη, pay-as-you-go υπολογιστική δυναμικότητα στο σύννεφο.",
  "hosting_amazon_ec2_2": "Select a pre-configured, templated Amazon Machine Image (AMI) to get up and running immediately. Or create an AMI containing your applications, libraries, data, and associated configuration settings. <a href=':1:'>See more</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "<p>Phalcon is supported on all Windows shared web hosting packages and plans, no configuration or installation required! They offer a variety of PHP versions from 5.2 - 7.0 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!</p>",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "The <a href=':1:'>Windows Azure cloud</a> provides you with highly scalable and manageable Windows hosting for your web apps. Use Phalcon to reduce your instance costs.",
  "hosting_azure_2": "To install Phalcon, follow the step by step procedure in <a href=':1:'>this SitePoint article</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Το Phalcon μπορεί να εγκατασταθεί σε οποιοδήποτε υπολογιστή με την προυπόθεση ότι έχετε πρόσβαση SSH root (ή sudo). Παρακάτω θα βρείτε τη λίστα από ευυπόληπτες εταιρείες που προσφέρουν αυτές τις υπηρεσίες:",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
  "hosting_digital_ocean_2": "<p>Follow this <a href=':1:'>tutorial</a> to get started</p>",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_fortrabbit_1": "Το Fortrabbit προσφέρει πολλά πακέτα φιλοξενίας (υπάρχει ένα για τους προγραμματιστές και είναι δωρεάν - με ορισμένους περιορισμούς) που θα ικανοποιήσει τις ανάγκες των περισσότερων από τους προγραμματιστές που επιθυμούν είτε να δοκιμάσουν το Phalcon ή να αναπτύξουν τις εφαρμογές τους γραμμένες με αυτό.",
  "hosting_fortrabbit_2": "They offer a variety of <a href=':1:'>extensions</a> that would satisfy even the most demanding project.",
  "hosting_fortrabbit_3": "Οι σταθερές εκδόσεις του Phalcon είναι προ-εγκατεστημένες, μπορείτε να τις ενεργοποιήσετε από το ταμπλό διοίκησης.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Εγκατασήστε το Phalcon χρησιμοποιώντας τις βασικές οδηγείες εγκατάστασης.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "<p>Follow this <a href=':1:'>tutorial</a> to get started</p>",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
  "hosting_linode_title": "Linode",
  "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction φιλοξενεία για προγραμματιστές. Πλήρης πρόσβαση shell σε γρήγορους servers με όλα τα αγαπημένα σας εργαλεία προ-εγκατεστημένα και να διατηρούμενα για το χρήστη.",
  "hosting_webfaction_2": "To install Phalcon in WebFaction, follow the instructions outlined <a href=':1:'>here</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Ask browser what is the best language",
  "i18n_3": "Check if we have a translation file for that lang",
  "i18n_4": "Fallback to some default",
  "i18n_5": "Return a translation object",
  "i18n_description": "Translate your applications to many languages easily",
  "install_instructions": "Install instructions",
  "installing_phalcon_php": "Installing Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Come join our vibrant developer community!",
  "join_our_community_description": "Community contributed with Extensions, Plugins, Adapters, VM, examples, source code... and more",
  "language_text": "Ελληνικά",
  "learn": "Learn",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http: //opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
  "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
  "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "MORE...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM για Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "Βρέθηκαν :1: ρομπότς",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Houston we have a problem!",
  "or": "ή",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Η ομάδα του Phalcon",
  "phalcon_team_1": "Many more people",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Name",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Resources",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Restful Services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Returning data in JSON",
  "roadmap": "Χάρτης πορείας",
  "router": "Router",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Create the router",
  "router_3": "Define a route",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Δείγματα Εφαρμογών",
  "see_for_yourself": "See for yourself...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Something went wrong :(",
  "sponsored_by": "Sponsored by",
  "sponsors": "Σπόνσορες",
  "sponsors_and_supporters": "Sponsors and Supporters",
  "sponsors_become_patron": "Become a Patron!",
  "sponsors_description_1": "Για εκείνους που επιθυμούν να υποστηρίξουν το έργο μας και την περαιτέρω ανάπτυξη του Phalcon, προσφέρουμε διάφορες επιλογές χορηγίας που θα ταιριάζουν σε οποιοδήποτε πορτοφόλι. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
  "stack_overflow": "Stack Overflow",
  "store": "Μαγαζί",
  "support": "Υποστήρηξη",
  "support_documentation_1": "Παρακαλούμε χρησιμοποιήστε την :1: πριν από οτιδήποτε άλλο. Μπορείτε επίσης να χρησιμοποιήσετε τη δυνατότητα αναζήτησης στα τεκμήριά μας για να βρείτε αυτό που ψάχνετε. Εάν η ερώτησή σας δεν έχει ακόμα απαντηθεί, υπάρχουν περισσότερες επιλογές παρακάτω.",
  "support_download_page": "σελίδα λήψης",
  "support_forum_1": "You can ask a question in our <a href=':1:'>Discussion Forum</a>",
  "support_note": "Πολλά bugs αναφέρονται επειδή οι χρήστες δε χρησιμοπουούν την τελευταία έκδοση. Παρακαλούμε επισκεφθείτε το :1:, κατεβάστε την τελευταία διαθέσιμη έκδοση (ή ξαναδημιουργηστε το με τον πηγαίο κώδικα) και επιβεβαιώστε εάν το θέμα που αντιμετωπίζετε είναι πράγματι ένα bug.",
  "support_phalcon_forum": "Phalcon Φόρυμ",
  "support_please_note": "Παρακαλούμε σημειώστε:",
  "support_please_note_1": "Το Stack Overflow δεν είναι αφιερωμένο στην υποστήριξη του Phalcon",
  "support_please_note_2": "Please do not raise new bugs there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_3": "Please do not ask for feature requests there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_4": "Make sure you include the 'phalcon' tag with your question",
  "support_please_note_5": "Make sure you mention 'Phalcon' in the question",
  "support_reporting_a_bug": "Αναφορά bug",
  "support_reporting_a_bug_1": "Please report bugs when you've exhausted all of the above options, using the <a href=':1:'>issue tracker</a> in Github.",
  "support_slack": "Slack",
  "support_slack_1": "You can find us in the <a href=':1:'>PhalconChats</a> channel on Slack.",
  "support_stack_overflow_1": "If you are familiar or prefer Stack Overflow, there is a <a href=':1:'>phalcon</a> tag that you can use to search or to tag your query.",
  "support_us": "Support Us",
  "team": "Ομάδα",
  "team_andres_1": "Ο Andres γνωρίζει πάρα πολύ καλά τις εφαρμογές ανοικτού κώδικα. Κατά τα τελευταία εννέα χρόνια, έχει σχεδιάσει και κυκλοφορήσει frameworks για PHP και έχει συμμετάσχει στην ανάπτυξη ιστοσελίδων και εφαρμογών Ιστού - το κύριο πάθος του.",
  "team_andres_2": "Νικητής του διαγωνισμού TR35, ο Andres έχει ένα κύριο σκοπό, να διαλέγει, αναπτύσει ή να χρησιμοποιήσει το κατάλληλο εργαλείο για την κατάλληλη δουλειά. Γιαυτό, το 2011 είχε μια καινούργια ιδεα: να δημιουργήσει ένα νέο είδος framework για προγραμματιστές PHP, το οποίο που εστιάζει στην χρηστικότητα, χαρακτηριστικά, και κυρίως την απόδοση.",
  "team_andres_3": "Μέσα από αυτή τη νέα καινοτόμο προσέγγιση γεννήθηκε το Phalcon. Ένα PHP framework γραμμένο σε γλώσσα C, που μπορεί να προσφέρει μια πληθώρα δυνατοτήτων για τους προγραμματιστές, ενώ ταυτόχρονα μεγιστοποιοεί την απόδοση των εφαρμογών και διατηρεί την χρησιμοποίηση πόρων σε χαμηλά επίπεδα.",
  "team_andres_4": "Ο Andres είναι ένας από τους κύριους προγραμματιστές του Phalcon και αυτός που το εμπνεύστηκε.",
  "team_eduar_1": "O Eduar είναι έναs C/PHP προγραμματιστής με πολλά χρόνια εμπειρίας στην ανάπτυξη εφαρμογών. Είναι ένας από τους ιδρυτές και δημιουργούς του Phalcon που ξεκίνησε το 2011.",
  "team_eduar_2": "Έχει λάβει μέρος σε όλους τους τομείς, από το σχεδιασμό πλαισίου έως τον εσωτερικό πυρήνα λειτουργιών, συμπεριλαμβανομένης της τεκμηρίωσης και των εργαλείων προγραμματιστή. Οδηγείται από μια γοητεία με τα πλαίσια, γλωσσών και νέες τεχνολογίες.",
  "team_eduar_3": "Του αρέσουν ταινίες επιστημονικής φαντασίας και μερικές φορές παίζει ποδόσφαιρο.",
  "team_nikolay_1": "Ο Nikolay έχει πάνω από 10 χρόνια πείρα στην ανάπτυξη εφαρμογών ιστού. Έχει συμμετάσχει σε εφαρμογές υψηλής απόδοσης, καθώς και πολύπλοκες, και σε πολύπλοκους σχεδιασμούς ιστοσελίδων.",
  "team_nikolay_2": "Ο Nikolay έχει ασχοληθεί με έργα Open Source για ένα μεγάλο χρονικό διάστημα, αξιοποιώντας τους όποτε απαιτήσεις επιτρέπουν. Άρχισε να προσφέρες τον προσωπικό χρόνο του για να δώσει πίσω στην κοινότητα ανοιχτού λογισμικου, με διακλάδωσεις εφαρμογών, προσφέροντας αρχιτεκτονικές αλλαγές και προτάσεις, καθώς και αλλαγες επιδόσεων. Έχει συμβάλει στη βελτίωση Open Source CMS εφαρμογών λαμβάνωντας θετικά σχόλια από την κοινότητα.",
  "team_nikolay_3": "Η συνεχής ενασχόλησή του με εφαρμογές ανοικτού κώδικα, τον έχει βοήθησε να προωθήσει τις τεχνικές του γνώσεις, ενώ ταυτόχρονα δίνει πίσω στην κοινότητας με τον χρόνο του.",
  "team_nikolay_4": "Ο Nikolay είναι ένας φανατικός υποστηρικτής της μεγιστοποίησης απόδοσης σε εφαρμογές ιστού. Μετά την εισαγωγή του στην ομάδα Phalcon, αποφάσισε να συνεχίσει και να χρησιμοποιήσει το framework και να γίνει ένας ευαγγελιστής για αυτό. Οδηγεί την προσπάθεια για τη Ρωσική κοινότητα και προσφέρει πόρους για Ρωσόφωνους προγραμματιστές.",
  "team_nikolay_5": "His contributions include:  A mirror of the main website in Russian (<a href=':1:'>http://www.Phalcon.ru</a>), a mirror of the documentation repository in Russian (<a href=':2:'>http://docs.Phalcon.ru</a>), ongoing changes and corrections to the documentation in English, a group in the social network Vkontakte (<a href=':3:'>http://vk.com/Phalcon</a>).",
  "team_nikos_1": "Ο Νίκος δουλεύει στον κλάδο του ΙΤ για πάνω από 20 χρόνια. Εισάχθηκε στον κόσμο του PHP το 2000 και έχει το χρησιμοποιεί από τότε σε προσωπικά έργα, καθώς και έργα για τους εργοδότες του.",
  "team_nikos_2": "Αγαπά την ανακάλυψη νέων τεχνολογιών και τρόπους για να τους ενσωματώσει με τις υπάρχουσες εφαρμογές και συνεπώς, να καρπωθούν με τα οφέλη που προσφέρουν.",
  "team_nikos_3": "Είναι ένας φανατικός υποστηρικτής του Test Driven Development (TDD) και προσπαθεί πάντα να έχει πλήρη κάλυψη στον κώδικά του.",
  "team_nikos_4": "Το συνεχές ενδιαφέρον του Νίκου σε νέες και καινοτόμες τεχνολογίες αποκλίνωντας από τους κανόνες τον φέρανε στον Phalcon. Εντάχθηκε στην ομάδα και τα καθήκοντά του αφορούν κυρίως το συντονισμό των NFRs και bugs, βοήθεια με τέστς, τεκμηρίωση και το incubator. Ο Νίκος είναι επίσης υπεύθυνος για τη δημιουργία των Windows DLLs για το Phalcon και να προσφέρει υποστήριξη όποτε είναι δυνατόν.",
  "team_serghei_1": "Ο Serghei έχει εργαστεί ως προγραμματιστής Ruby/PHP για πάνω από 7 χρόνια και έχει ειδικευτεί στην ανάπτυξη εφαρμογών ιστού.. Είναι φανατικός υποστηρικτής και υπέρμαχος της Ανάπτυξης με Γνώμονα Συμπεριφοράς (BDD) και είναι μέλος της ομάδας <a href=':1:'>Codeception</a>.",
  "team_serghei_2": "Ο Serghei έχει πάθος με καινοτόμες τεχνολογίες, και έτσι βρήκε το Phalcon. Ο ρόλος του είναι να συντονίζει NFRs και bugs, τεστς, τα εργαλεία για προγραμματιστές (developer tools), incubator και υποστήρηξη για άλλες εφαρμογές που έχουν δημιουργηθεί με το Phalcon.",
  "team_serghei_3": "Όταν δεν εργάζεται, ο Serghei απολαμβάνει ντοκιμαντέρ, ταινίες επιστημονικής φαντασίας και παίζει μερικές φορές Mahjong ή Go.",
  "template_engine_volt": "Μηχανή Προτύπων (Volt)",
  "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
  "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
  "template_engines": "Template Engines",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Views represent the user interface of your application",
  "testimonials": "Πιστοποιήσεις",
  "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits:  ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1хP4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing: )  Michael.",
  "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing! Best regards, Nikita Vershinin, Lead Developer, Kolesa.kz and krisha.kz",
  "testimonials_3": "Ομάδα Phalcon, το framework που έχετε δημιουργήσει είναι καταπληκτικό. Δεν έχω ποτέ χρησιμοποιήσει ένα τέτοιο framework συνδυάζει ταχύτητα, αποτελεσματικότητα, συντομία και  φυσικότητας όλα σε ένα πακέτο. Σκοπεύω να προασπίσω το Phalcon και να συμβάλλω με οποιοδήποτε τρόπο που μπορώ. Ξεκίνησα πρόσφατα ένα ~ 800-ωρο έργο και είμαι ευτυχής να δηλώσω ότι χρησιμοποιούμε το Phalcon framework. Μπράβο. Brian Seymour",
  "testimonials_4": "Γεια σας παιδιά, ανακάλυψα το Phalcon και είναι απλά φοβερό! Ήθελα μόνο να πω πόσο φοβεροί είστε! Οπότε, σας ευχαριστώ γι 'αυτό το framework και να διατηρήστε την καλή δουλειά! Ivan Penchev",
  "testimonials_5": "Hi Guys, i wrote simple url-shortener service with phalcon. That was amazing! really. <a href=':1:'>:2:</a>. Demo is here: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Hello Phalcon Team, I created a small project designed for Polish users using your framework. I have to admit that the performance is amazing, congratulations good job. Service to validate the content of the web pages in Polish language <a href=':1:'>:2:</a>",
  "testimonials_7": "Hi guys! Just wanted to share with you the latest release of our old project - <a href=':1:'>:2: </a>. Switching to phalcon allowed us to halve the server load compared to the previous framework, which is great!",
  "testimonials_description": "Below is a collection of testimonials and success stories, from you, the developers and users of Phalcon PHP. We always welcome emails with success stories and will be posting those in our blog. If you wish to send us your success story or get in touch with us, feel free to mail us at <a href='mailto: :1:'>:2:</a>.",
  "transactions": "Συναλλαγές",
  "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
  "transactions_2": "Create a transaction manager",
  "transactions_3": "Request a transaction",
  "transactions_4": "Get the robots to be deleted",
  "transactions_5": "Something's gone wrong, we should rollback the transaction",
  "transactions_6": "Everything's gone fine, let's commit the transaction",
  "transactions_7": "Robots were deleted successfully!",
  "transactions_8": "Failed, reason: ",
  "transactions_description": "Transactions in Phalcon allows to keep the data integrity safe.",
  "try_phalcon": "Δοκιμάστε το Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Watch the demo video",
  "zephir": "Zephir"
}
