{
  "about": "Acerca de",
  "about_blog": "BLOG",
  "about_blog_1": "Si te gusta escribir, recuerda que <a href=':1:'>nuestro blog</a> está abierto a tutoriales creados por ti. Si tienes un blog y has escrito algo sobre Phalcon, podemos publicarlo en nuestra redes sociales dándole mayor visibilidad. Si tus posts están en un idioma diferente a inglés, nos gustaría compartirlo y potencialmente intentar traducirlo. Si conoces blogs de PHP que estén interesados en presentar Phalcon a sus audiencias por favor háznoslo saber.",
  "about_description_1": "Proyectos increíbles necesitan manos increíbles, tal vez no nos conozcamos aún pero pensamos que puedes ser una gran ayuda para construir una web mejor. Juntos, estamos listos para cambiar el mundo!, Aquí en Phalcon, estamos creando una nueva generación de frameworks para PHP, queremos darte un rendimiento increíble mientras te ayudamos a desarrollar de una manera sencilla y divertida.",
  "about_description_2": "Esperamos que disfrutes Phalcon tanto como nosotros. ¡Siempre agradecemos tu colaboración y ayuda! <strong>¡No necesitas ser un desarrollador de C para ayudar en Phalcon!</strong> Hay otras muchas áreas en las que puedes contribuir:",
  "about_documentation": "DOCUMENTACIÓN",
  "about_documentation_1": "El repositorio de este sitio web esta disponible en <a href=':1:'>GitHub</a>. Estamos utilizando este repositorio, como fuente para nuestra documentación, solo para el idioma ingles. <br /><br /> Siempre agradecemos las correcciones, adiciones y mejoras en nuestra documentación, todo lo que tienes que hace es clonar el repositorio y enviar una pull request.<br/><br/>Si puedes ayudar a los desarrolladores que no hablan ingles, traduciendo algunos de los contenidos a otro idioma, ¡sería genial! Estamos utilizando <a href=':2:'>:3:</a> para las traducciones, puedes encontrar nuestro proyecto <a href=':4:'>aquí</a>",
  "about_donations_sponsoring": "DONACIONES / PATROCINIO",
  "about_evangelism": "EVANGELIZACIÓN",
  "about_evangelism_1": "Hay muchos desarrolladores que aún no saben que Phalcon existe o que realmente funciona. Estamos seguros que muchos desarrolladores se beneficiarán al conocer sobre Phalcon y todo lo que ofrece. Si sabes de algún evento ó reunión de PHP donde puedas darlo a conocer, tienes todo nuestro apoyo. ¿A quién no le gustaría saber acerca de la herramienta que está revolucionando el desarrollo de PHP?",
  "about_facebook_page": "Página de Facebook",
  "about_flying_with_phalcon": "¡Gracias por volar con Phalcon! &lt;3",
  "about_follow_on_gab": "Síguenos en Gab",
  "about_follow_on_twitter": "Síguenos en Twitter",
  "about_official_blog": "Blog oficial",
  "about_sample_applications": "APLICACIONES DE EJEMPLO",
  "about_sample_apps_1": "Grandes ejemplos ayudan a otros a entender como pueden hacerse grandes cosas en Phalcon. Siéntete libre de compartir repositorios con aplicaciones de ejemplo que ayuden a otros a empezar con Phalcon. ¡Dándote también la oportunidad de recibir comentarios sobre tu trabajo!",
  "about_screencasts": "VIDEO TUTORIALES",
  "about_screencasts_1": "Nos encantan los video tutoriales, si tienes tiempo extra y quieres apoyar a nuestra comunidad con algunos buenos videos explicando como funciona el framework y alguna de sus características, serán bienvenidos. Revisa nuestro canal en <a href=':1:'>Vimeo</a> como guía.",
  "about_share_experiences_1": "No seas tímido, comparte tus experiencias y las formas en las Phalcon fue útil con la comunidad. Si Phalcon es un caso de éxito para ti, permítenos compartirlo con la comunidad. Discutir sobre los componentes que necesitan más trabajo, qué podría ser más fácil y los beneficios que obtuviste al usar Phalcon. A pesar que no todo puede ser implementado de manera inmediata, tus comentarios sobre nuevas características nos ayudan a moldear de mejor manera el proyecto. Tus comentarios ayudan a todos.",
  "about_share_your_experiences": "COMPARTE TUS EXPERIENCIAS",
  "about_social_networks": "REDES SOCIALES",
  "about_social_networks_1": "Phalcon está evolucionando cada día, a través del deseo de hacerlo mejor. Las redes sociales son parte de nuestras vidas, e interactuamos con otros a través de ellas. Compartir tu experiencia con tus círculos sociales nos ayuda a aumentar la visibilidad del proyecto. Más y más gente se unirá a nuestra comunidad, haciéndola más poderosa. Dando \"me gusta\" o \"+1\", compartiendo los posts, permite que otros conozcan lo que estamos haciendo. ¡Las personas que conozcan Phalcon gracias a ti te lo agradecerán!",
  "about_social_networks_2": "Tenemos presencia en la mayor parte de redes sociales, al seguirnos, nos ayudas a tener mayor visibilidad.",
  "about_sponsoring_1": "Somos un equipo de desarrolladores pequeño pero efectivo trabajando sin descanso. Intentamos dedicar todo el tiempo posible al proyecto. Nuestra pasión por este proyecto nos hace querer que sea mejor cada día. Phalcon es un proyecto de software abierto y el esfuerzo de los voluntarios es necesarios para su constante evolución. Puedes ayudarnos a mantener el desarrollo activo donando o patrocinando su desarrollo. Más tiempo y recursos dedicados significan mayor actividad, más mejoras, mejor soporte, más características, etc.",
  "about_star_on_github": "Califica el proyecto en Github",
  "about_tests": "PRUEBAS",
  "about_tests_1": "Ningún software está libre bugs. Si encuentras uno, por favor no dudes en decirnoslo. Nuestra suite de test unitarios contiene más de <a href=':1:'>16.000</a> tests. Pero nunca hay suficientes test unitarios. Ayúdanos a mejorar la suite de tests agregando más o mejorando los existentes. Cada test hace al framework sea más estable.",
  "about_thank_you": "¡GRACIAS!",
  "about_thank_you_1": "Queremos dar gracias a todos los colaboradores y miembros de la comunidad por ser nuestro empuje para crear el mejor framework en su tipo. Sus amables palabras y confianza es lo que nos motiva a ser mejores. Esperamos alcanzar y superar las expectativas y confianza que ponen en Phalcon.",
  "about_translations": "TRADUCCIONES",
  "about_translations_1": "Estamos tratando de llegar a tantos desarrolladores como sea posible, rompiendo las barreras del idioma. Estamos usando <a href=':1:'>:2:</a>, para administrar todas las palabras o frases que deben ser traducidas en este sitio. El repositorio del proyecto está ubicado <a href=':3:'>aquí</a>.",
  "acl": "ACL",
  "acl_1": "Así es como puedes crear listas de control de acceso (ACL):",
  "acl_2": "Crear la ACL",
  "acl_3": "La acción predeterminada es DENEGAR el acceso",
  "acl_4": "Registre dos roles, Los usuarios son usuarios registrados",
  "acl_5": "y los invitados son usuarios sin una identidad definida",
  "acl_description": "La Lista de Control de Acceso (ALC) permite a los usuarios acceder a los módulos que están autorizados a",
  "api": "API",
  "auto_loader": "Cargador automático",
  "auto_loader_1": "Registra espacios de nombres, prefijos, directorios o clases. Aprovecha las ventajas de los eventos del auto cargador y mantén el control total sobre qué archivos se cargan y desde donde.",
  "auto_loader_2": "Crea el auto cargador",
  "auto_loader_3": "Registrar algunos espacios de nombres",
  "auto_loader_4": "Registrar auto cargador",
  "autoloader": "Cargador automático",
  "autoloader_description": "Proporciona el mecanismo de carga automática de clases PHP siguiendo el estándar de recomendaciones PSR-4.",
  "basic_features": "Características Básicas",
  "blog": "Blog",
  "built_with_phalcon": "Construido con Phalcon",
  "cache": "Caché",
  "cache_1": "El componente de caché permite un acceso más rápido a los datos utilizados frecuentemente o que ya fueron procesados. Es compatible con muchos backends como Redis, Memcached, Mongo, Archivos, Apc y más",
  "cache_2": "Establecer el servicio de caché de modelos",
  "cache_3": "Por defecto, el cacheo es por un día",
  "cache_4": "Configuración de la conexión de Memcached",
  "cache_description": "Mejore su rendimiento con muchos de los cachés de backend que proporciona Phalcon",
  "community": "Comunidad",
  "consulting": "Asesoramiento",
  "consulting_header": "Nos hemos asociado con LEZGRO, una compañía que se especializa en el desarrollo de aplicaciones web y móviles. La cual es muy hábil en la entrega de aplicaciones potenciadas por Phalcon a su clientela.",
  "consulting_lezgro_1": "¡LEZGRO te felicita por tu elección de hacer que Phalcon sea central en tu stack tecnológico!",
  "consulting_lezgro_2": "Desde el primer día de la conformación de nuestra en 2003, hemos intentado varias tecnologías y enfoques en el desarrollo de software.",
  "consulting_lezgro_3": "Los gerentes de producto, los CTO y los fundadores no técnicos involucran a LEZGRO para construir productos que se destacan, de forma rápida y con una alta calidad.",
  "consulting_lezgro_4": "Ahora que hemos adquirido una experiencia positiva con Phalcon, estamos abiertos a asesorarte para tomar la decisión de desarrollar en Phalcon, y te ayudaremos a llevar tu producto Phalcon al mercado.",
  "consulting_lezgro_5": "Puede contactar a LEZGRO a través de nuestro <a href=':1:'>sitio web</a>, donde también se pueden ver ejemplos y testimonios de nuestro trabajo.",
  "consulting_mctekk_1": "MCTekK está involucrado con Phalcon desde el primer día. Desde su concepción hemos visto las grandes ventajas que ofrecía Phalcon y las que podría ofrecer en el futuro.",
  "consulting_mctekk_2": "Tenemos amplia experiencia con Phalcon y hemos desarrollado una gran variedad de proyectos con Phalcon como principal elemento. Estamos aquí para asesorarte sobre cualquier cosa que necesites acerca de Phalcon así como para ayudarte a mejorar tu disponibilidad, rapidez y calidad.",
  "consulting_mctekk_3": "Puedes contactarnos a través de nuestro <a href=':1:'>sitio web</a>, donde puedes echar un vistazo a los proyectos en que hemos estado involucrados.",
  "consulting_mctekk_header": "MCTekK ya ha entregado varios proyectos en Phalcon de alto desempeño, siendo sus principales fortalezas el desarrollo web y móvil.",
  "contribute": "Contribuir",
  "contributors": "Colaboradores de Phalcon",
  "contributors_description": "Phalcon es mejorado día a día por nuestra increíble comunidad",
  "crypt": "Crypt",
  "crypt_description": "Encriptar o Desencriptar datos importantes para mantenerlos a salvo de terceros no autorizados",
  "data_and_storage": "Datos y almacenamiento",
  "dependency_injection": "Inyección de Dependencias",
  "dependency_injection_1": "Phalcon está construido sobre un potente diseño, llamado Inyección de Dependencias, que es fácil de entender y usar. Inicializa o define servicios una vez y utilízalos prácticamente en cualquier lugar de la aplicación.",
  "dependency_injection_2": "Crear el contenedor de Inyector de Dependencias (DI)",
  "dependency_injection_3": "Registro de clases, funciones, componentes",
  "dependency_injection_4": "Usalo en cualquier otro lugar del código",
  "dependency_injection_description": "La Inyección de Dependencias y la ubicación de servicios es en sí mismo un contenedor para ellos.",
  "discord": "Discord",
  "docs": "Documentación",
  "documentation": "Documentación",
  "donate": "Donaciones",
  "download": "Descargar",
  "download_arch": "Arch Linux",
  "download_arch_1": "Hay un PKGBUILD para ArchLinux, disponible <a href=':1:'>aquí</a>",
  "download_box_1": "Máquina virtual #1",
  "download_box_2": "Máquina virtual #2",
  "download_box_doc_root": "Raíz de la aplicación: :1:",
  "download_box_user_pass": "MySQL Usuario: :1: Contraseña: :2:",
  "download_compilation": "Compilación",
  "download_compilation_1": "En Linux puedes fácilmente compilar e instalar la extensión desde su código fuente.",
  "download_compilation_11": "1. Para crear la extensión desde el código en C siga estos pasos: ",
  "download_compilation_12": "2. Agregue la extensión a su php.ini: ",
  "download_compilation_13": "3. Finalmente, reinicie el servidor web",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Después de varias solicitudes de la comunidad, los desarrolladores de cPanel lanzaron un módulo personalizado que permite la instalación de Phalcon en cPanel en sitios de alojamiento web. Puedes encontrar más información <a href=':1:'>aquí</a>. El módulo se gestiona en <a href=':2:'>GitHub</a>.",
  "download_dependencies": "Dependencias",
  "download_dependencies_1": "Aunque Phalcon no tiene dependencias binarias con otras extensiones, estas son opcionalmente usadas para ofrecer mayor rendimiento. Las extensiones usadas son:",
  "download_dependencies_2": "No es necesario que todas las extensiones anteriores estén presentes en el sistema que tiene instalado Phalcon. Puedes instalar solo las que satisfacen tus necesidades. Por ejemplo, si utilizas una base de datos MySQL, entonces puedes cargar solo PDO y PDO/MySQL ignorando los módulos de Oracle, SQlite, Postgresql y Mongo.",
  "download_developer_tools": "Herramientas de Desarrollo",
  "download_devtools_1": "Estas herramientas son un conjunto de scripts útiles para generar código base. Los componentes base de tu aplicación pueden ser generados con un simple comando, permitiendo desarrollar aplicaciones fácilmente con Phalcon.",
  "download_devtools_composer": "Instalación vía Composer",
  "download_devtools_composer_1": "Instalar composer en una ubicación común o dentro de tu proyecto: ",
  "download_devtools_composer_2": "Crea el archivo composer.json como el siguiente: ",
  "download_devtools_composer_3": "Ejecutar el instalador de composer: ",
  "download_devtools_composer_4": "Debe crear un enlace simbólico al script phalcon.php: ",
  "download_devtools_docs": "Documentación: <a href=':1:'>Herramientas del Desarrollador Phalcon</a>",
  "download_devtools_download": "Puedes descargar o clonar un paquete multi-plataforma que contiene las herramientas del desarrollador desde <a href=\":1:\">GitHub</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Hay muchas formas de usar Phalcon con Docker.",
  "download_docker_2": "Nuestras imágenes oficiales se encuentran <a href=':1:'>aquí</a>. Siempre damos la bienvenida a los pull requests y mejoras. El repositorio de los archivos docker se encuentra aquí:",
  "download_docker_3": "Con Phalcon-compose puede crear un entorno aislado con docker, que le permitirá utilizar Phalcon sin ninguna instalación adicional. Tenga en cuenta que el uso de Phalcon Compose, requiere",
  "download_docker_4": "y",
  "download_docker_5": "Servicios",
  "download_docker_6": "Phalcon Compose ofrece los siguientes servicios por defecto:",
  "download_docker_7": "Phalcon Compose es muy fácil de usar. Suponga que necesita crear una aplicación que se encuentre en:",
  "download_docker_8": "Ahora necesitaremos ejecutar el siguiente comando para que se pueda crear nuestra aplicación contenedor:",
  "download_docker_9": "El comando anterior descargará el esqueleto del entorno de Docker",
  "download_docker_10": "Variables",
  "download_docker_11": "Necesitarás crear un fichero nuevo llamado",
  "download_docker_12": "en",
  "download_docker_13": "Se ha proporcionado un archivo de ejemplo llamado",
  "download_docker_14": "Ajuste las variables en ese archivo para que se adapte a sus necesidades. La variable más importante es la",
  "download_docker_15": "Cambia el nombre por algo que puedas usar. En nuestro caso dejamos el valor predeterminado llamado",
  "download_docker_16": "Abre tu fichero hosts  (<code>/etc/hosts</code>) y añade la siguiente linea:",
  "download_docker_17": "Puedes editar el archivo <code>docker-compose.yml</code> y quitar servicios que no vas a utilizar. Phalcon Compose ofrece una gran cantidad de servicios como se mencionó anteriormente, por lo que tu aplicación puede no necesitar algunos de ellos. Eliminar los servicios correspondientes del archivo <code>docker-compose.yml</code> reducirá el uso de la memoria de tu entorno.",
  "download_docker_18": "Construir",
  "download_docker_19": "Ahora puedes construir el entorno.",
  "download_docker_20": "Los contenedores se descargarán según sea necesario y se configurarán en tu entorno.",
  "download_docker_21": "Iniciar",
  "download_docker_22": "Ahora puedes iniciar el entorno:",
  "download_docker_23": "En tu navegador ve a :1: y tu podrás comprobar que tu entorno está configurado correctamente. Ahora puedes desarrollar tu aplicación en el directorio app.",
  "download_docker_24": "Apagar",
  "download_docker_25": "Para detener el entorno, cuando no se necesite, puedes ejecutar el siguiente comando:",
  "download_docker_26": "Puedes encontrar información adicional en: ",
  "download_examples": "Ejemplos pre-instalados",
  "download_examples_1": "Los siguientes ejemplos están pre-instalados en cada máquina virtual Vagrant:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Un puerto está disponible para FreeBSD. Solo necesitas estos comandos para instalarlo: ",
  "download_ide_stubs": "IDE stubs",
  "download_ide_stubs_1": "El siguiente vídeo describe cómo habilitar los stubs IDE para PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "¿Necesitas ayuda?",
  "download_need_help_1": "Echa un vistazo a la <a href=':1:'>página de soporte</a>. Haremos nuestro mejor esfuerzo para ayudarte.",
  "download_note": "Phalcon es una extensión en C, así que necesitarás descargar un binario para tu plataforma o compilarlo desde el código fuente",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Hay un paquete disponible <a href=':1:'>aquí</a> (gracias a <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Requisitos",
  "download_requirements_1": "Necesitamos algunos paquetes previamente instalados:",
  "download_requirements_2": "Recursos de desarrollo para PHP 5.x",
  "download_requirements_3": "Compilador GCC",
  "download_source_code": "Código fuente: <a href=':1:' target='_download' title='Repositorio GitHub'>GitHub</a>",
  "download_source_code_switch": "Código fuente (por favor selecciona la rama correspondiente): <a href=':1:' target='_download' title='GitHub Repo'>GitHub</a>",
  "download_ubuntu": "Para instalar Phalcon en Ubuntu o Debian, necesitas seguir los siguientes pasos: ",
  "download_ubuntu_1": "Si el apt-add-repository no se encuentra en tu sistema, ejecuta el siguiente comando: ",
  "download_ubuntu_2": "Si deseas instalar la versión obsoleta de Phalcon (1.x) utiliza el siguiente PPA: ",
  "download_ubuntu_or_debian": "Ubuntu o Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> es una excelente herramienta para crear y configurar entornos de desarrollo livianos, reproducibles, y portables.",
  "download_vagrant_2": "Use cualquiera de las siguientes máquinas virtuales para probar o desarrollar con Phalcon en un entorno pre-configurado.",
  "download_vagrant_boxes": "Cajas Vagrant",
  "download_windows": "Windows DLLs",
  "download_windows_download": "Descargar",
  "download_windows_dlls": "Las librerías DLL para Windows pueden descargarse desde <a href=':1:'>nuestra página lanzamientos en Github</a>",
  "download_windows_guides": "Guías Relacionadas",
  "download_windows_guides_wamp": "Instalación en WAMP",
  "download_windows_guides_xampp": "Instalación en XAMPP",
  "download_windows_installation": "Instalación",
  "download_windows_installation_1": "Para usar Phalcon en Windows debes descargar una librería DLL. Edita tu php.ini, agrega al final extension=php_phalcon.dll, y reinicia el servidor web para cargar la extensión <a href=':1:'>Más información</a>.",
  "download_windows_note": "Recomendamos altamente usar la última versión de PHP correspondiente a nuestros DLLs, y así sacar ventaja a todas las características de Phalcon",
  "download_windows_older": "Versiones anteriores",
  "download_windows_stable": "Versiones Estable/Maestra",
  "encryption": "Encriptación",
  "encryption_1": "Phalcon proporciona servicios de cifrado mediante el componente Phalcon\\Crypt. Esta clase ofrece capas simples orientadas a objetos de la biblioteca de cifrado de PHP openssl.",
  "encryption_2": "Esta es una clave secreta (32 bytes).",
  "encryption_3": "Este es el texto que desea cifrar.",
  "events": "Eventos",
  "events_description": "Puedes extender la mayoría de los componentes del framework mediante la creación de 'puntos del anclaje'. Esto permite crear sus propios eventos para hacer su aplicación más flexible y potente",
  "events_management": "Gestión de Eventos",
  "events_management_1": "Un Gestor de Eventos o EventsManager te permite adjuntar oyentes a un tipo particular de evento. El tipo de evento que nos interesa ahora es 'dispatch'. El siguiente código filtra todos los eventos producidos por el Dispatcher:",
  "events_management_2": "Crear un gestor de eventos",
  "events_management_3": "Escuche los eventos producidos en el despachador utilizando el plugin de seguridad",
  "events_management_4": "Maneje excepciones y excepciones no encontrado o \"not found\" utilizando NotFoundPlugin",
  "events_management_5": "Asignar el gestor de eventos al despachador",
  "facebook": "Facebook",
  "flash_messages": "Mensajes Flash",
  "flash_messages_1": "Usa el notificador flash para mostrar mensajes al usuario en una aplicación web:",
  "flash_messages_2": "hubo errores en este formulario",
  "flash_messages_3": "sí!, todo salió muy bien",
  "flash_messages_4": "este es un aviso para los usuarios",
  "flash_messages_5": "esto es solo una advertencia",
  "flash_messages_description": "Mensajes flash se utilizan para notificar al usuario sobre el estado de las acciones.",
  "forms_builder": "Constructor de Formularios",
  "forms_builder_1": "Cada elemento del formulario puede ser procesado como es requerido por el desarrollador. Internamente, se utiliza Phalcon\\Tag para producir el código HTML correcto de cada elemento y puede pasar atributos adicionales como segundo parámetro del método render():",
  "forms_builder_2": "Inicio",
  "forms_builder_3": "Teléfono móvil",
  "forms_builder_description": "Crear fácilmente formularios HTML",
  "forum": "Foros",
  "gab": "Gab.ai",
  "get_phalcon": "Obtener Phalcon :1:",
  "github": "GitHub",
  "header_slogan": "¡Su innovadora arquitectura hace de Phalcon el framework PHP más rápido jamás construido!",
  "header_tagline": "Un framework full-stack de PHP entregado como una extensión de C",
  "high_performance_php_framework": "Framework PHP de alto rendimiento",
  "hosting": "Alojamiento web",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud proporciona capacidad de cálculo escalable, de pago por uso en la nube.",
  "hosting_amazon_ec2_2": "Escoge un Amazon Machine Image (AMI) pre-configurado para empezar a trabajar inmediatamente. También puedes crear un AMI que contenga tus aplicaciones, librerías, datos y configuración asociada. <a href=':1:'>Ver más</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix proporciona cPanel Linux superior y servicios de alojamiento de web en Windows. Nuestros clientes han calificado nuestro servicio como excepcional. Ofrecemos planes económicos para compartir Windows y alojamiento web Linux con cPanel, servidores privados virtuales y servidores dedicados! <a href=':1:'>ver más</a>",
  "hosting_aspnix_2": "Phalcon es compatible con todos los paquetes y planes de alojamiento web compartido de cPanel de Windows y Linux, no es necesaria ninguna configuración ni instalación. ASPnix ofrece una variedad de versiones de PHP desde 5.2 hasta 7.2 además de muchas <a href=':1:' target=\"_blank\">extensiones adicionales</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "El <a href=':1:'>servicio en la nube de Windows Azure</a> le provee hosting en Windows altamente escalable y administrable para sus aplicaciones web. Use Phalcon para reducir el costo de sus instancias.",
  "hosting_azure_2": "Para instalar Phalcon, siga el paso a paso en <a href=':1:'>este artículo de SitePoint</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon puede ser instalado en cualquier maquina donde el proveedor de hosting ofrezca accesso SSH con root (o sudo). A continuación una lista de compañias que ofrecen estos servicios.",
  "hosting_digital_ocean_1": "Tecnología en la nube súper rápida. Creada para desarrolladores. Lanza un servidor en la nube con SSD en tan solo 55 segundos. <a href=':1:'>Ver más</a>",
  "hosting_digital_ocean_2": "Sigue este <a href=':1'>tutorial</a> para empezar",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host ofrece múltiples planes de hosting de calidad y accesibles.",
  "hosting_dcthost_2": "Por defecto, tienen Phalcon instalado en todos sus paquetes de hosting compartidos.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit ofrece varios planes (hay uno para desarrolladores que es gratis - con algunas limitaciones) satisfaciendo las necesidades de la mayoría de desarrolladores que deseen usar Phalcon o desplegar sus aplicaciones allí.",
  "hosting_fortrabbit_2": "Ellos ofrecen la posibilidad de usar un variado conjunto de <a href=':1:'>extensiones</a> hasta para el proyecto más exigente.",
  "hosting_fortrabbit_3": "Versiones estables de Phalcon están pre-instaladas, puedes activarlas desde el panel de control de administración.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Instalar Phalcon usando las instrucciones estándar de instalación.",
  "hosting_kinghost_1": "Desde 2006, KingHost es uno de los mayores sitios de hosting de Brasil y ya tiene más de 300.000 sitios alojados con aproximadamente 60.000 clientes. Con sede en Porto Alegre (RS), con centros de datos en Brasil, la empresa ofrece el servicio de alojamiento de servidores compartidos, planes específicos para los desarrolladores y proyectos en el área de soluciones para empresas, incluyendo servidores dedicados y clouds. También ofrece soluciones de marketing digitales como email marketing y de seguridad.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "La próxima generación, PaaS de tamaño automático para aplicaciones Java, PHP, Ruby, Python y Node.js. Totalmente aisladas por escalamiento basado en contenedores para cada cliente, incluyendo la opción de Apache o Nginx y unrango completo de servidores SQL y NoSQL. Pagar por el uso de recursos y no por el tamaño de la instancia de servidor. SSD-powered. Alojado en el Reino Unido.",
  "hosting_layershift_2": "Sigue este <a href=':1'>tutorial</a> para empezar",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Despliega y administra Linux Virtual Servers en Linode Cloud. Obtén un servidor corriendo en segundos con la distribución Linux, recursos y nodo de ubicación que quieras. <a href=':1:'>Más información</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "Servidores dedicados de alto rendimiento con protección contra amenazas como ser Ataques de Denegación de Servicio Distribuida (DDoS). Nuestra red de protección DDoS de gran capacidad, puede proteger automáticamente su servidor dedicado de ataques DDoS hasta 4.2 Tbps. <a href=':1:'>Ver más</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Los servidores Cloud son maquinas virtuales corriendo Linux o Windows&reg; Server en la nube de Rackspace. Puedes escalar aumentando o disminuyendo recursos como CPU, memoria, y almacenamiento, dependiendo de tus necesidades. Lo mejor de todo, pagas por lo que consumes. <a href=':1:'>Ver más</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting para desarrolladores. Acceso completo desde consola a servidores rápidos con todas tus herramientas favoritas pre-instaladas y mantenidas por el usuario.",
  "hosting_webfaction_2": "Para instalar Phalcon en WebFaction, sigue las instrucciones disponibles <a href=':1:'>aquí</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "El componente Phalcon\\Translate ayuda en la creación de aplicaciones multilingües. Las aplicaciones que utilizan este componente muestran el contenido en diferentes idiomas, basados en el idioma elegido por el usuario, de los idiomas soportados por la aplicación.",
  "i18n_2": "Pregunta al navegador cuál es el mejor lenguaje",
  "i18n_3": "Comprueba si tenemos un archivo de traducción para ese idioma",
  "i18n_4": "Regresa algún valor predeterminado",
  "i18n_5": "Devuelve un objeto de traducción",
  "i18n_description": "Traduce tus aplicaciones a muchos idiomas fácilmente",
  "installing_phalcon_php": "Instalando Phalcon PHP",
  "issue_tracker": "Gestor de Incidencias",
  "join_our_community": "¡Únete a nuestra vibrante comunidad de desarrolladores!",
  "join_our_community_description": "Conozca las contribuciones de la comunidad: extensiones, complementos, adaptadores, VM, ejemplos, código fuente... y más",
  "language_text": "Inglés",
  "learn": "Aprender",
  "license_new_bsd": "Phalcon es un framework de código abierto PHP<br />construido como una extensión de C. Está disponible bajo la<br/><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>Nueva licencia BSD</a>.",
  "low_overhead": "Baja sobrecarga",
  "low_overhead_1": "Las extensiones en Zephir/C son cargadas con PHP una sola vez cuando inicia el servidor web",
  "low_overhead_2": "Las clases y funciones proporcionadas por la extensión están listas para usarse en cualquier aplicación",
  "low_overhead_3": "El código es compilado y no es interpretado porque ya está compilado previamente para una plataforma y procesador específico",
  "low_overhead_4": "Gracias a las optimizaciones y arquitectura de bajo nivel, <strong>Phalcon tiene una de las sobre cargas mas bajas para aplicaciones basadas en MVC</strong>",
  "low_overhead_description": "Bajo consumo de memoria y CPU en comparación con los frameworks tradicionales",
  "low_overhead_title": "Extensión PHP en C (Phalcon)",
  "more": "MÁS...",
  "mvc": "MVC",
  "mvc_1": "Construir aplicaciones individuales y aplicaciones de varios módulos es algo de suma facilidad y placer. Utilizando la estructura de archivos, esquema y patrones que ya conoces.",
  "mvc_hmvc": "MVC y HMVC",
  "mvc_hmvc_description": "Módulos, componentes, modelos, vistas y controladores",
  "odm_for_mongo": "ODM para Mongo",
  "odm_for_mongo_1": "Además de su capacidad para asignar tablas en bases de datos relacionales, Phalcon puede asignar documentos a una base de datos MongoDB. El ODM ofrece una funcionalidad CRUD, eventos, validaciones entre otros servicios.",
  "odm_for_mongo_2": "¿Cuántos robots hay ahí?",
  "odm_for_mongo_3": "¿Cuántos robots mecánicos hay ahí?",
  "odm_for_mongo_4": "Hay :1: robots",
  "odm_for_mongo_description": "Mapeo de Objetos de Documentos para MongoDB",
  "oops": "Houston tenemos un problema!",
  "or": "o",
  "orm": "ORM",
  "orm_1": "Un potente ORM (Object-Relational Mapping) proporcioando por Phalcon permite manipular registros de base de datos como clases y objetos. Los motores de base de datos MySQL, PostgreSQL y SQLite están soportados desde el primer momento.",
  "orm_description": "Mapeo Relacional de Objetos",
  "phalcon_team": "Equipo Phalcon",
  "phalcon_team_1": "Muchas más personas",
  "phalcon_team_2": "Phalcon es y siempre ha sido un esfuerzo de muchos voluntarios: ",
  "phql": "PHQL",
  "phql_1": "PHQL es un dialecto SQL orientado a objetos de alto nivel, que permite para escribir consultas utilizando un lenguaje estándar SQL. PHQL se implementa como un analizador (escrito en C) que traduce la sintaxis que corresponde al RDBMS utilizado. Para lograr el mayor rendimiento posible, Phalcon proporciona un analizador que utiliza la misma tecnología que SQLite. Esta tecnología proporciona un pequeño analizador que reside en memoria con un uso de recursos muy bajo y que también usa sub procesos seguros.",
  "phql_2": "Nombre",
  "phql_description": "El potente y seguro lenguaje de consultas de Phalcon, PHQL",
  "polling_app": "Una aplicación de encuestas desde cero en menos de 15 minutos",
  "queueing": "Colas - proceso en segundo plano",
  "queueing_1": "Las actividades como el procesamiento de vídeos, redimensionamiento de imágenes o enviar correos electrónicos no son adecuados para ser ejecutados en línea o en tiempo real porque puede disminuir el tiempo de carga de páginas y afectan seriamente la experiencia de usuario. Aquí la mejor solución es implementar trabajos en segundo plano. La aplicación web pone trabajos en una cola, los cuales se procesarán de forma separada.",
  "queueing_2": "Conectar a la cola",
  "queueing_3": "Insertar el trabajo en la cola",
  "queueing_description": "Utilizar el sistema de colas incorporada en Phalcon para programar trabajos y reducir la carga de su servidor web",
  "resources": "Recursos",
  "rest": "Rest",
  "rest_description": "En este caso, puedes utilizar una micro aplicación o una aplicación full stack para cumplir tu objetivo. Además, un potente conjunto de ayudantes HTTP.",
  "restful_services": "Servicios RESTful",
  "restful_services_1": "Escribir servidores y aplicaciones REST (Representational State Transfer) nunca ha sito tan fácil. Sin complicaciones. Los servicios simples caben en un solo archivo.",
  "restful_services_2": "Devolver datos en JSON",
  "roadmap": "Hoja de ruta",
  "router": "Router",
  "router_1": "El enrutamiento como se supone debe ser. Ni más ni menos.",
  "router_2": "Crear el router",
  "router_3": "Definir una ruta",
  "router_description": "Phalcon\\Mvc\\Router proporciona capacidades avanzadas de enrutamiento.",
  "sample_applications": "Aplicaciones de Ejemplo",
  "see_for_yourself": "Compruébalo tu mismo...",
  "sharding": "Fragmentando Bases de Datos",
  "sharding_1": "Adjunte modelos a diferentes bases de datos",
  "sharding_2": "Este servicio devuelve una base de datos MySQL",
  "sharding_3": "Este servicio devuelve una base de datos PostgreSQL",
  "sharding_description": "Conecta, almacena y recupera datos de muchos sistemas de bases de datos al mismo tiempo",
  "slack": "Slack",
  "something_went_wrong": "Algo salió mal :(",
  "sponsored_by": "Patrocinado por",
  "sponsors": "Patrocinadores",
  "sponsors_and_supporters": "Patrocinadores y Personas que apoyan el Proyecto",
  "sponsors_and_supporters_upper": "PATROCINADORES Y PERSONAS QUE APOYAN EL PROYECTO",
  "sponsors_become_patron": "¡Sé un fundador!",
  "sponsors_description_1": "Para aquellos que quieran patrocinar nuestro trabajo y el desarrollo de Phalcon en el futuro, ofrecemos varias opciones de patrocinio que se ajustan a cualquier presupuesto. Patrocinar nuestro trabajo nos permite dedicar más tiempo al proyecto, ofrecer respuestas más rápidas a errores y nuevas características, además de asegurar la estabilidad de los proyectos.",
  "sponsors_our_great_sponsors": "¡Estos son nuestros patrocinadores! ¡¡Gracias!!",
  "stack_overflow": "Stack Overflow",
  "store": "Tienda",
  "support": "Soporte",
  "support_discord": "Únete a Phalcon en <a href=':1:'>Discord</a>",
  "support_documentation_1": "Por favor usa la :1: antes que todo. Puedes también usar la opción de buscar documentos para encontrar lo que estás buscando. Si tu pregunta sigue sin respuesta hay más opciones a continuación.",
  "support_download_page": "página de descargas",
  "support_note_1": "Sin embargo, ¡nuestra gran comunidad y colaboradores están encantados de ayudarle! Utiliza estos recursos de la comunidad para obtener ayuda.",
  "support_note_2": "Algunos errores pueden aparecer debido a que no estas usando la última versión. Por favor visita :1:, descarga la última versión (o compílala) y confirma que el problema que estás experimentando no es en realidad un error ya corregido.",
  "support_phalcon_forum": "Las preguntas deben ir a los <a href=':1:'>Foros oficiales</a>",
  "support_please_note": "Ten en cuenta:",
  "support_please_note_1": "Stack Overflow no está dedicado a soportar Phalcon",
  "support_please_note_2": "Por favor no informes sobre bugs allí. Usa el <a href=':1:'>issue tracker</a> en Github para ello",
  "support_please_note_3": "Por favor no solicites nuevas características allí. Usa el <a href=':1:'>issue tracker</a> en Github para ello",
  "support_please_note_4": "Recuerda incluir la etiqueta 'phalcon' en tu pregunta",
  "support_please_note_5": "Recuerda mencionar 'Phalcon' en la pregunta",
  "support_reporting_a_bug": "Reportar un bug",
  "support_reporting_a_bug_0": "Si aún crees que lo que encontrado es un error, por favor <a href=':1:'>abre un problema</a>",
  "support_reporting_a_bug_1": "Por favor, reporta errores cuando hayas agotado todas las opciones anteriores, usando el <a href=':1:'>issue tracker</a> de Github.",
  "support_slack": "Hay una comunidad menos activa pero aún funcional en <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Otra forma es hacer una pregunta en <a href=':1:' target='_blank'>Stackoverflow</a> y etiquetar con <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Nuestras cuentas de redes sociales son: <a href=':1:'>Gab.ai</a>, <a href=':2:'>Twitter</a> y <a href=':3:'>Facebook</a>",
  "support_us": "Apóyanos",
  "team": "Equipo",
  "team_andres_1": "Andrés no es ajeno a los proyectos de software abierto, en los últimos nueve años, ha estado diseñando y liberando frameworks y librerías para PHP además de estar envuelto activamente en desarrollo web - su mayor pasión.",
  "team_andres_2": "Como ganador del premio TR35, su mayor guía es escoger y usar la herramienta correcta para cada tarea, casi siempre enfocándose en rendimiento e innovación. En 2011 una nueva idea empezó a concebirse, crear un nuevo tipo de framework para desarrolladores PHP que se enfoque en usabilidad, características y principalmente rendimiento.",
  "team_andres_3": "A través de esta nueva iniciativa nació Phalcon. Un framework escrito en C que pueda ofrecer un gran número de características a desarrolladores mientras maximiza el rendimiento y mantiene el consumo de recursos bajo.",
  "team_andres_4": "Andrés es uno de los desarrolladores y creadores de Phalcon y su inspiración.",
  "team_eduar_1": "Eduar es un Desarrollador C/PHP con varios años de experiencia en desarrollo de aplicaciones. Es uno de los fundadores y desarrolladores líderes del proyecto Phalcon que comenzó en 2011.",
  "team_eduar_2": "Él ha participado en todas las áreas, desde el diseño del framework hasta las funciones del núcleo interno, incluyendo herramientas de documentación y del desarrollador. Está impulsado por una fascinación por los frameworks, los lenguajes y las nuevas tecnologías.",
  "team_eduar_3": "A Eduar le gusta de ver películas de ciencia ficción y a veces juega al fútbol.",
  "team_nikolay_1": "Nikolay ha estado desarrollando aplicaciones web por más de 10 años. Ha estado involucrado en temas de alto rendimiento, así como diseños y sitios web complejos.",
  "team_nikolay_2": "Nikolay ha trabajado en proyectos de software abierto por largo tiempo, utilizándolos según los requerimientos lo permitan. Él empezó usando su tiempo personal para darle soporte a la comunidad, ofreciendo cambios en la arquitectura y sugerencias en rendimiento. También ha dedicado tiempo a la creación y mejora de CMSs de código abierto recibiendo criticas positivas de la comunidad.",
  "team_nikolay_3": "Su participación continua en proyectos de código abierto le ha ayudado a avanzar en sus conocimientos técnicos al mismo tiempo manteniendo la mentalidad de devolver a la comunidad.",
  "team_nikolay_4": "Nikolay es un ferviente impulsor de maximizar rendimiento en aplicaciones web. Después de conocer Phalcon, decidió convertirse en un evangelista de él. Está liderando los esfuerzos en la comunidad rusa, ofreciendo recursos y ayuda a los ruso-hablantes.",
  "team_nikolay_5": "Sus contribuciones incluyen: una réplica del sitio principal en Ruso (<a href=':1:'>http://www.phalcon.ru</a>), una réplica de la documentación en Ruso (<a href=':2:'>http://docs.phalconphp.ru</a>), cambios frecuentes y mejoras a la documentación en inglés, un grupo en la red social Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos ha estado en la industria de IT por al menos 20 años. Inició en el mundo de PHP en el 2000 y ha estado en él trabajando en sus proyectos personales y los de sus empleadores.",
  "team_nikos_2": "Le encanta descubrir nuevas tecnologías y buscar formas de integrarlos con aplicaciones existentes sacando provecho de ellas.",
  "team_nikos_3": "Él es un entusiasta del Desarrollo Orientado por Pruebas (TDD) y siempre trata de conseguir total cobertura en su código.",
  "team_nikos_4": "El continuo interés de Nikos en nuevas e innovadoras de tecnologías, que salgan del molde, lo introdujo a Phalcon. Se unió al core team y sus principales tareas están relacionadas con NFRs y corrección de errores, ayudando con pruebas, documentación y la incubadora. Nikos es responsable de mantener las DLLs de Windows y ofrecer soporte siempre que sea posible.",
  "team_paul_1": "Paul se considera muy afortunado de haber pasado la última década de su vida escribiendo software fácil de usar con la ayuda de frameworks de código abierto y herramientas como Phalcon. Como resultado, pasa sus horas de trabajo tratando de mejorar las herramientas de software libre y las vidas de otros desarrolladores como a sí mismo. Tiene una fuerte necesidad de código simple y evidente UX, con Phalcon se centra en la documentación, la nueva experiencia de usuario, contribuyente de relaciones y alcance comunitario.",
  "team_paul_2": "Paul comenzó recientemente su propia compañía para seguir su pasión de la construcción de software intuitivo con tecnologías emergentes como, ReactJS, Webpack, Ruby y Elixir(Erlang). Ahora con orgullo añade Zephir y Phalcon a esa lista cada vez mayor y está dispuesto a asumir el papel de animador, abogando por sus características innovadoras.",
  "team_paul_3": "Sobre la posibilidad que el no este codificando, Paul esta siguiendo los pasos de su esposa y desarrollando su interés en la producción de vídeo y grabación. Él funciona un canal educativo de YouTube actualmente enfocados en el Phalcon y en caso contrario como un profesor de Ciencias de la computación.",
  "team_serghei_1": "Serghei ha trabajando como desarrollador de Ruby/PHP por más de 8 años y se ha especializado en desarrollo de aplicaciones web. Como defensor y promotor de desarrollo impulsado por comportamiento (Behavior Driven Development, BDD) es también un miembro del equipo de <a href=':1:'>Codeception</a>.",
  "team_serghei_2": "Por lo general Serghei esta sumamente involucrado con tecnologías innovadoras, esto lo llevó a involucrarse en Phalcon. Es responsable de la coordinación de corrección de errores, pruebas, herramientas de desarrollo e incubadora además de apoyar otros proyectos relacionados con Phalcon.",
  "team_serghei_3": "Cuando no está trabajando, Serghei goza de ver documentales, películas de ciencia ficción y a veces juega Mahjong o al Go.",
  "team_volodymyr_1": "Volodymyr ha desarrollado aplicaciones de servidores y web por más de 20 años. Ha participado en el diseño y escritura de aplicaciones de software muy complejas y de alto rendimiento. La pasión de Volodymyr para escribir software robusto, rápido y optimizado le llevó a involucrarse con Phalcon y se unió al equipo de desarrollo.",
  "team_volodymyr_2": "En su tiempo libre Volodymyr disfruta la compañía de su amada esposa, contribuye con proyectos open source y estudia idiomas extranjeros.",
  "template_engine_volt": "Motor de plantillas (Volt)",
  "template_engine_volt_1": "Volt es un lenguaje de plantillas para PHP ultra rápido y amigable para el diseñador, está escrito en Zephir/C. Te proporciona un conjunto de ayudantes para escribir vistas de una manera fácil. Volt están altamente integrada con otros componentes de Phalcon, y puede ser utilizado como componente independiente en tus aplicaciones.",
  "template_engine_volt_description": "Un motor de plantillas inspirado en Jinja pero construido en C para PHP",
  "template_engines": "Motores de Plantillas",
  "template_engines_1": "Las vistas representas la interfaz de usuario de tu aplicación. Las vistas son a menudo archivos HTML con código PHP incrustado que realizan tareas relacionadas únicamente a la presentación de datos. Las vistas se encargan de proporcionar datos al navegador web o a alguna otra herramienta que realice solicitudes de datos a tu aplicación.",
  "template_engines_description": "Las vistas representan la interfaz de usuario de tu aplicación",
  "testimonials": "Testimonios",
  "testimonials_1": "Saludos, equipo Phalcon! Tengo un proyecto, construido con el framework Phalcon. Es una Guitarama (<a href=':1:'>:2:</a>) - tablaturas de guitarra y catálogo de acordes. El sitio está destinado para audiencia Rusa y usa el lenguaje Ruso, pero espero que no haya ningún problema en entender la mayoría de las páginas. El sitio fue re-lanzado en una nueva plataforma a principios de Enero de 2013, y desde entonces ha mostrado un crecimiento constante. Visitas diarias actuales: ~1500 visitantes únicos, ~5000 páginas vistas. El sitio corre sobre un viejo servidor físico 1xP4-3Ghz, 4GB RAM. De nuevo, gracias por su grandioso framework y por todo lo que hacen :) Michael.",
  "testimonials_2": "Hola, equipo Phalcon. Queremos compartir nuestro caso de éxito usando Phalcon en los proyectos <a href=':1:'>:2:</a> y <a href=':3:'>:4:</a>, los sitios más visitados y con más carga de Kazakhstan, clasificados en el TOP-10 de sitios en el CIS. Ambos sitios trabajan con una API similar a RESTful escrita en Phalcon\\Mvc\\Micro. En cargas altas, la API, procesa alrededor de 400 peticiones/segundo y este no es el límite. Al cambiarnos a Phalcon hemos reducido el tiempo de procesamiento y el consumo de CPU y memoria así como el tiempo de desarrollo. Continuaremos usando Phalcon en nuevos proyectos. Gracias por el gran trabajo que están haciendo! Saludos, Nikita Vershinin, Lead Developer, Kolesa.kz y krisha.kz",
  "testimonials_3": "Equipo de Phalcon, el framework que han creado es increíble, nunca había usado un framework que combinara, velocidad, eficiencia, brevedad y naturalidad todo en un solo paquete. Trataré de contribuir de vuelva al proyecto en todo lo que pueda. Recientemente empecé a hacer un proyecto de unas ~800 horas y estoy feliz de decir que usaré Phalcon Framework. Bravo. Brian Seymour",
  "testimonials_4": "Hola chicos, Acabo de encontrar Phalcon y es increíble!, Solamente quiero decirles lo increíbles que son!, Gracias por el framework y sigan con el buen trabajo! Ivan Penchev",
  "testimonials_5": "Hola Chicos, escribí un servicio de acortador de urls con Phalcon. ¡Fue increíble! enserio. <a href=':1:'>:2:</a>. Este es el demo <a href=':3:'>:4:</a> :) Murat Küçükosman",
  "testimonials_6": "Hola equipo Phalcon, cree un pequeño proyecto diseñado para usuarios Polacos usando su framework. Tengo que admitir que el rendimiento es asombroso, felicitaciones por su buen trabajo. Sirve para validar el contenido de páginas web en el lenguaje Polaco <a href=':1:'>:2:</a>",
  "testimonials_7": "Hola chicos! Solo quiero compartir con ustedes la última versión de nuestro viejo proyecto - <a href=':1:'>:2:</a>. Cambiarnos a Phalcon nos permitió reducir a la mitad la carga del servidor comparado con anteriores frameworks, ¡lo cual es grandioso!",
  "testimonials_description": "A continuación hay un conjunto de testimonios y casos de éxito, de personas como tú, desarrolladores y usuarios de Phalcon. Si tienes casos de éxito, no dudes en compartirlos con nosotros, escríbenos a <a href='mailto::1:'>:2:</a>.",
  "toggle_navigation": "Cambiar el modo de navegación",
  "transactions": "Transacciones",
  "transactions_1": "Cuando un proceso realiza múltiples operaciones de base de datos, sería importante que cada paso que se ha completado con éxito para que pueda mantenerse la integridad de los datos. Las transacciones ofrecen la capacidad para garantizar que todas las operaciones de base de datos sean ejecutadas con éxito antes de que los datos sean enviados a la base de datos.",
  "transactions_2": "Crear un gestor de transacciones",
  "transactions_3": "Solicitar una transacción",
  "transactions_4": "Haz que los robots sean eliminados",
  "transactions_5": "Algo ha ido mal, se debe deshacer la transacción",
  "transactions_6": "Todo ha ido muy bien, vamos a confirmar la transacción",
  "transactions_7": "¡Los robots se eliminaron con éxito!",
  "transactions_8": "Fallido, razón: ",
  "transactions_description": "Las transacciones en Phalcon permiten mantener segura la integridad de los datos.",
  "try_phalcon": "Prueba Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Vistas y frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Mira el video de demostración",
  "zephir": "Zephir",
  "telegram": "Telegram",
  "mewe": "MeWe",
  "parler": "Parler",
  "stack_overflow": "Stack Overflow"
}