{
  "about": "Sobre",
  "about_blog": "BLOG",
  "about_blog_1": "Si te gusta escribir, recuerda que <a href=':1:'>nuestro blog</a> está abierto a tutoriales creados por ti. Si tienes un blog y has escrito algo sobre Phalcon, podemos publicarlo en nuestra redes sociales dandole mayor visibilidad. Si tus posts está en un idioma diferente a inglés, nos gustaría compartirlo y potencialmente intentar traducirlo. Si conoces blogs de PHP que esten interesados en presentar Phalcon a sus audiencias por favor háznoslo saber.",
  "about_description_1": "Proyectos increíbles necesitan manos increíbles, tal vez no nos conozcamos aún pero pensamos que puedes ser una gran ayuda para construir una mejor web. Juntos, estamos listos para cambiar el mundo!, Con Phalcon, estamos creando una nueva generación de frameworks para PHP, queremos darte un increíble rendimiento mientras te ayudamos a desarrollar de manera sencilla y divertida.",
  "about_description_2": "Esperamos que disfutes con Phalcon tanto como nosotros. ¡Siempre agradecemos tu colaboración y ayuda!<strong>¡No necesitas ser un desarrollador de C para ayudar a Phalcon!</strong>Hay otras muchas areas en las que puedes contribuir:",
  "about_documentation": "DOCUMENTACIÓN",
  "about_documentation_1": "The repository of this website is available on <a href=':1:'>github</a>. We are using <a href=':2:'>readthedocs</a> to manage our documentation.<br /><br />We always appreciate corrections, additions and enhancements in our documentation, so all you have to do is clone the repository and issue a pull request!<br /><br />If you can help non English speaking developers by translating some of the content to another language, that would be great!",
  "about_donations_sponsoring": "DONACIONES / PATROCINIO",
  "about_evangelism": "EVANGELIZACIÓN",
  "about_evangelism_1": "Hay muchos desarrolladores que aún no saben que Phalcon existe o realmente funciona. Estamos seguros que muchos desarrolladores se beneficiarán al conocer sobre Phalcon y todo lo que ofrece. Si sabes de algún evento ó reunión de PHP donde puedas darlo a conocer, tienes todo nuestro apoyo. ¿Quién no quiere saber sobre la herramienta que cambiará la forma de ver el desarrollo en PHP?",
  "about_facebook_page": "Facebook Page",
  "about_flying_with_phalcon": "Thanks for flying with Phalcon! &lt;3",
  "about_follow_on_gab": "Follow us on Gab",
  "about_follow_on_twitter": "Follow us on Twitter",
  "about_google_plus_page": "Google+ Page",
  "about_official_blog": "Official Blog",
  "about_sample_applications": "APLICACIONES DE EJEMPLO",
  "about_sample_apps_1": "Ejemplos completos ayudan a otros a entender como cosas grandes pueden hacerse en Phalcon. Siéntete libre de compartir repositorios con aplicaciones de ejemplo que ayuden a otros a empezar con Phalcon adicionalmente dándote la oportunidad de recibir comentarios sobre tu trabajo también!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "Nos encantan los screencasts, si tienes tiempo extra y quieres apoyar la comunidad con algunos buenos videos explicando como el framework funciona y alguna de sus características, serán muy bienvenidos. Revisa nuestro canal en <a href=':1:'>Vimeo</a> como guía.",
  "about_share_experiences_1": "No seas timido, comparte sus experiencias y las formas en las Phalcon fue útil con la comunidad. Si Phalcon es un caso de éxito para ti, permítenos compartirlo con la comunidad. Discutir sobre los componentes que necesitan más trabajo, que podría ser más fácil y los beneficios que obtuviste al usar Phalcon. A pesar que no todo puede ser implementado de manera inmediata, tus comentarios en nuevas características nos ayuda a moldear de mejor manera el proyecto. Tus comentarios ayudan a todos.",
  "about_share_your_experiences": "COMPARTE TU EXPERIENCIA",
  "about_social_networks": "REDES SOCIALES",
  "about_social_networks_1": "Phalcon está evolucionando cada día, a través del deseo de hacerlo mejor. Las redes sociales son parte de nuestras vidas, interactuamos con otros a través de ellas. Compartir tu experiencia con tus círculos sociales nos ayuda a aumentar la visibilidad del proyecto. Más y más gente se unirá a nuestra comunidad, haciéndola más poderosa. Dando \"me gusta\" o \"+1\", compartiendo los posts, permite que otros conozcan lo que estamos haciendo. Las personas que conozcan Phalcon gracias a ti te lo agradecerán!.",
  "about_social_networks_2": "Tenemos presencia en la mayor parte de redes sociales, al seguirnos, nos ayudas a tener mayor visibilidad.",
  "about_sponsoring_1": "Son un equipo pequeño pero efectivo de desarrolladores trabajando muchísimo. Intentamos dedicar todo el tiempo posible al proyecto. Nuestra pasión por este proyecto nos hace querer que sea mejor cada día. Phalcon es un proyecto de software abierto y esfuerzos voluntarios son necesarios para su constante evolución. Puedes ayudarnos a mantener el desarrollo activo donando o patrocinando su desarrollo. Más tiempo y recursos dedicados significan mayor actividad, mejora, mejor soporte, más características, etc.",
  "about_star_on_github": "Star the project on Github",
  "about_tests": "TESTS",
  "about_tests_1": "No hay software que esté libre de bugs. Si encuentras uno, por favor no dudes en contarnos. Nuestra suite de test unitarios contiene más de <a href=':1:'>16.000</a> tests. Sin embargo, los test unitarios nunca sobran. Ayúdanos a mejorar la suite de tests agregando más o mejorando los existentes. Cada test hace que el framework sea más estable.",
  "about_thank_you": "GRACIAS!",
  "about_thank_you_1": "Queremos dar gracias a todos los colaboradores y miembros de la comunidad por darlos su confianza para crear el mejor framework de su clase. Tus amables palabras y confianza es lo que nos motiva a ser mejores. Esperamos llenar las expectativas que pones en Phalcon.",
  "about_translations": "TRADUCCIONES",
  "about_translations_1": "Estamos tratando de llegar a tantos desarrolladores como sea posible, rompiendo las barreras del idioma. Estamos usando <a href=':1:'>:2:</a>, para administrar todas las palabras o frases que deben ser traducidas en este sitio. El repositorio del proyecto está ubicado <a href=':3:'>aqui</a> y a continuación puedes ver el estado actual de los esfuerzos de traducción:",
  "acl": "ACL",
  "acl_1": "This is how you can built the access control list (ACL):",
  "acl_2": "Create the ACL",
  "acl_3": "The default action is DENY access",
  "acl_4": "Register two roles, Users is registered users",
  "acl_5": "and guests are users without a defined identity",
  "acl_description": "Access Control List allows users to access the modules they're authorized to",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Register namespaces, prefixes, directories or classes. Take advantage of the autoloader events and maintain full control over what files are loaded and from where.",
  "auto_loader_2": "Creates the autoloader",
  "auto_loader_3": "Register some namespaces",
  "auto_loader_4": "Register autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.",
  "basic_features": "Basic Features",
  "blog": "Blog",
  "built_with_phalcon": "Built with Phalcon",
  "cache": "Cache",
  "cache_1": "The cache component allows faster access to frequently used or already processed data. It supports many backends such as Redis, Memcached, Mongo, Files, Apc and more",
  "cache_2": "Set the models cache service",
  "cache_3": "Cache data for one day by default",
  "cache_4": "Memcached connection settings",
  "cache_description": "Improve your performance with many of the backend caches that Phalcon provides",
  "community": "Community",
  "consulting": "Consultoria",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO<\/a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO<\/a> congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO<\/a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Contact LEZGRO through our <a href=':1:'>website</a>, where you can also see samples and testimonials of our work.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Contact us through our <a href=':1:'>website</a>, where you can take a look at the projects we have been involved in.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Contribute",
  "contributors": "Phalcon contributors",
  "contributors_description": "Phalcon is improved everyday by our amazing community",
  "crypt": "Crypt",
  "crypt_description": "Cifrar / descifrar datos importantes para mantenerlos a salvo de terceros no autorizados",
  "data_and_storage": "Data & storage",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon is built upon a powerful yet easy to understand and use pattern called Dependency Injection. Initialize or define services once - and use them virtually anywhere throughout the application.",
  "dependency_injection_2": "Create the Dependency Injector Container",
  "dependency_injection_3": "Register classes, functions, components",
  "dependency_injection_4": "Use anywhere else in code",
  "dependency_injection_description": "Dependency Injection and Location of services and it's itself a container for them.",
  "discord": "Discord",
  "docs": "Documentación",
  "documentation": "Documentación",
  "donate": "Donaciones",
  "download": "Descargar",
  "download_arch": "Arch Linux",
  "download_arch_1": "Hay un PKGBUILD para ArchLinux, disponible <a href=':1:'>aquí</a>",
  "download_box_1": "Máquina virtual #1",
  "download_box_2": "Máquina virtual #2",
  "download_box_doc_root": "Raíz de la aplicación: :1:",
  "download_box_user_pass": "MySQL Usuario: :1: Contraseña: :2:",
  "download_compilation": "Compilación",
  "download_compilation_1": "En Linux puedes facilmente compilar e instalar la extensión desde su código fuente.",
  "download_compilation_11": "1. Para crear la extensión desde el código en C sigue estos pasos:",
  "download_compilation_12": "2. Agrega la extensión al php.ini:",
  "download_compilation_13": "3. Finalmente, reinicia el servidor web",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "After requests from the community, the cPanel developers released a custom module that allows for installation of Phalcon in cPanel hosted sites. Information can be found <a href=':1:'>here</a>. The module is maintained in <a href=':2:'>Github</a>.",
  "download_dependencies": "Dependencias",
  "download_dependencies_1": "Aunque Phalcon no tiene dependencias binarias con otras extensiones, estas son opcionalmente usadas para ofrecer mayor rendimiento. Las extensiones usadas son:",
  "download_dependencies_2": "It is not necessary for all the above extensions to be present in the system that has Phalcon installed. You can only install the ones that meet your needs. For instance if you use a MySQL database, then you can only load PDO and PDO/MySQL ignoring the Oracle, SQlite, Postgresql and Mongo.",
  "download_developer_tools": "Herramientas de Desarrollo",
  "download_devtools_1": "Estas herramientas son un conjunto de scripts útiles para generar código base. Componentes base de tu aplicación pueden ser generados con un simple comando, permitiendo facilmente desarrollar aplicaciones usando Phalcon.\n",
  "download_devtools_composer": "Instalar via Composer",
  "download_devtools_composer_1": "Instalar composer en una ubicación conocida o dentro de tu proyecto:",
  "download_devtools_composer_2": "Crea el archivo composer.json como a continuación:",
  "download_devtools_composer_3": "Correr el instalador composer:",
  "download_devtools_composer_4": "Script para crear un enlace simbólico a phalcon.php:",
  "download_devtools_docs": "Documentación: <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "Puedes descargar o clonar un paquete multi-plataforma que contiene developer tools desde <a href=\":1:\">Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Hay muchos caminos para poder usar Phalcon con Docker.",
  "download_docker_2": "Nuestras imágenes oficiales se encuentran <a href=':1:'>aquí</a>. Siempre damos la bienvenida a los pull requests y mejoras. El repositorio de los archivos docker se encuentra aquí:",
  "download_docker_3": "Con Phalcon-compose puede crear un entorno aislado con docker, que le permitirá utilizar Phalcon sin ninguna instalación adicional. Tenga en cuenta que el uso de Phalcon Compose, requiere",
  "download_docker_4": "y",
  "download_docker_5": "Servicios",
  "download_docker_6": "Phalcon Compose ofrece los siguientes servicios por defecto:",
  "download_docker_7": "Phalcon Compose es muy fácil de usar. Suponga que necesita crear una aplicación que se encuentre en:",
  "download_docker_8": "Ahora necesitaremos ejecutar el siguiente comando para que nuestra aplicación de contenedor pueda ser creada:",
  "download_docker_9": "El comando anterior descargará el esqueleto del entorno de Docker",
  "download_docker_10": "Variables",
  "download_docker_11": "Tu necesitarás crear un fichero nuevo llamado",
  "download_docker_12": "en",
  "download_docker_13": "Se ha proporcionado un archivo de ejemplo llamado",
  "download_docker_14": "Ajuste las variables en ese archivo para adaptarse a sus necesidades. La variable más importante es la",
  "download_docker_15": "Cambia el nombre por algo que puedas usar. En nuestro caso dejamos el valor predeterminado llamado",
  "download_docker_16": "Abre tu fichero hosts  (<code>/etc/hosts</code>) y añade la siguiente linea:",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Construir",
  "download_docker_19": "Tu ahora puedes construir el entorno.",
  "download_docker_20": "Los contenedores se descargarán según sea necesario y se configurarán en su entorno.",
  "download_docker_21": "Iniciar",
  "download_docker_22": "Tu ahora puedes iniciar el entorno:",
  "download_docker_23": "Go to :1: en tu navegador y tu podrás comprobar que tu entorno está configurado. Tu ahora puedes desarrollar tu aplicacion en el directorio app.",
  "download_docker_24": "Apagar",
  "download_docker_25": "Para detener el entorno cuando no se necesite tu puedes ejecutar el siguiente comando:",
  "download_docker_26": "Información adicional se puede encontrar en:",
  "download_examples": "Ejemplos pre-instalados",
  "download_examples_1": "Los siguientes ejemplos están pre-instalados en cada máquina virtual Vagrant:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Un port está disponible para FreeBSD. Solo necesitas estos comandos para instalarlo:",
  "download_ide_stubs": "IDE stubs",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Necesitas Ayuda?",
  "download_need_help_1": "Echa un vistazo a la <a href=':1:'>página de soporte</a>. Harémos lo mejor por ayudarte.",
  "download_note": "Phalcon es una extensión en C, así que necesitarás descargar un binario para tu plataforma o compilarlo desde el código fuente",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Hay un paquete disponible aquí <a href=':1:'>here</a> (gracias a <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Requerimentos",
  "download_requirements_1": "Necesitamos algunos paquetes previamente instalados:",
  "download_requirements_2": "Recursos de desarrollo para PHP 5.x",
  "download_requirements_3": "Compilador GCC",
  "download_source_code": "Código fuente: <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Código fuente (por favor revisa la rama correspondiente): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps:",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command:",
  "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
  "download_ubuntu_or_debian": "Ubuntu or Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> es una excelente herramienta para crear y configurar entornos de desarrollo livianos, reproducibles, y portables.",
  "download_vagrant_2": "Use cualquiera de las siguientes máquinas virtuales para probar o desarrollar con Phalcon en un entorno pre-configurado.",
  "download_vagrant_boxes": "Máquinas virtuales Vagrant",
  "download_windows": "Windows DLLs",
  "download_windows_download": "Descargar",
  "download_windows_dlls": "Windows DLLs can be downloaded from our Github release page <a href=':1:'>here</a>",
  "download_windows_guides": "Guías Relacionadas",
  "download_windows_guides_wamp": "Instalación en WAMP",
  "download_windows_guides_xampp": "Instalación en XAMPP",
  "download_windows_installation": "Instalación",
  "download_windows_installation_1": "Para usar Phalcon en Windows debes descargar una DLL. Edita tu php.ini, agrega al final extension=php_phalcon.dll, y reinicia el servidor web para cargar la extensión <a href=':1:'>More</a>.",
  "download_windows_note": "Recomendamos altamente usar la última versión de PHP correspondiente a nuestros DLLs, y así sacar ventaja a todas las características de Phalcon",
  "download_windows_older": "Versiones anteriores",
  "download_windows_stable": "Versión Estable",
  "encryption": "Encripción",
  "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
  "encryption_2": "This is a secret key (32 bytes).",
  "encryption_3": "This is the text that you want to encrypt.",
  "events": "Eventos",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Events Management",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Create an events manager",
  "events_management_3": "Listen for events produced in the dispatcher using the Security plugin",
  "events_management_4": "Handle exceptions and not-found exceptions using NotFoundPlugin",
  "events_management_5": "Assign the events manager to the dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Flash Messages",
  "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
  "flash_messages_2": "there were errors in this form",
  "flash_messages_3": "yes!, everything went very smoothly",
  "flash_messages_4": "this is a notice for users",
  "flash_messages_5": "this is just a warning",
  "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
  "forms_builder": "Constructor de Formularios",
  "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
  "forms_builder_2": "Home",
  "forms_builder_3": "Cellphone",
  "forms_builder_description": "Easily create HTML forms",
  "forum": "Foros",
  "gab": "Gab.ai",
  "get_phalcon": "Get Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "Its innovative architecture makes Phalcon the fastest PHP framework ever built!",
  "header_tagline": "A full-stack PHP framework delivered as a C-extension",
  "high_performance_php_framework": "Framework PHP de alto rendimiento",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud ofrece escalable, paga-por-lo-que-usas capacidad en la nube.",
  "hosting_amazon_ec2_2": "Escoge un Amazon Machine Image (AMI) pre-configurado para empezar a trabajar inmediatamente. También puedes crear un AMI que contenga tus aplicaciones, librerías, datos y configuración asociada. <a href=':1:'>Ver más</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows shared web hosting packages and plans, no configuration or installation required! They offer a variety of PHP versions from 5.2 - 7.0 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "El <a href=':1:'>servicio en la nube de Windows Azure</a> le provee hosting en Windows altamente escalable y administrable para sus aplicaciones web. Use Phalcon para reducir el costo de sus instancias.",
  "hosting_azure_2": "Para instalar Phalcon, siga el paso a paso en <a href=':1:'>este artículo de SitePoint</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon puede ser instalado en cualquier maquina donde el proveedor de hosting ofrezca accesso SSH con root (o sudo). A continuación una lista de compañias que ofrecen estos servicios.",
  "hosting_digital_ocean_1": "Tecnología en la nube súper rápida. Creada para desarrolladores. Lanza un servidor en la nube con SSD en tan solo 55 segundos. <a href=':1:'>Ver más</a>",
  "hosting_digital_ocean_2": "Sigue este <a href=':1'>tutorial</a> para empezar",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_fortrabbit_1": "Fortrabbit ofrece varios planes (hay uno para desarrolladores que es gratis - con algunas limitantes) satisfaciendo las necesidades de la mayoría de desarrolladores que deseen usar Phalcon o desplegar sus aplicaciones allí.",
  "hosting_fortrabbit_2": "Ellos ofrecen la posibilidad de usar un variado conjunto de <a href=':1:'>extensiones</a> que satisfacerá hasta el proyecto más exigente.",
  "hosting_fortrabbit_3": "Versiones estables de Phalcon están pre-instaladas, puedes activarlas desde el dashboard de administración.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Instalar Phalcon usando las instrucciones estándar de instalación.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Sigue este <a href=':1'>tutorial</a> para empezar",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Desplega y administra Linux Virtual Servers en Linode Cloud. Obtén un servidor corriendo en segundos con la distribución Linux, recursos y nodo de ubicación que quieras. <a href=':1:'>Ver más</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Servers son maquinas virtuales corriendo Linux o Windows&reg; Server en la nube Rackspace. Puedes escalar aumentando o disminuyendo recursos como CPU, memoria, y almacenamiento, dependiendo de tus necesidades. Lo mejor de todo, pagas según consumas. <a href=':1:'>Ver más</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting para desarrolladores. Acceso completo desde consola a servidores rápidos con todas tus herramientas favoritas pre-instaladas y mantenidas por el usuario.",
  "hosting_webfaction_2": "Para instalar Phalcon en WebFaction, sigue las instrucciones disponibles <a href=':1:'>aquí</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Ask browser what is the best language",
  "i18n_3": "Check if we have a translation file for that lang",
  "i18n_4": "Fallback to some default",
  "i18n_5": "Return a translation object",
  "i18n_description": "Translate your applications to many languages easily",
  "installing_phalcon_php": "Installing Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Come join our vibrant developer community!",
  "join_our_community_description": "Contribuciones de la comunidad en extensiones, complementos, adaptadores, VM, ejemplos, código fuente ... y más",
  "language_text": "Inglés",
  "learn": "Learn",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http: //opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Las extensiones en Zephir/C son cargadas con PHP una sola vez cuando el proceso del servidor web arranca",
  "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Gracias a sus optimizaciones y arquitectura bajo nivel, <strong>Phalcon tiene una de las sobre cargas mas baja para aplicaciones basadas en MVC</strong>",
  "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "MORE...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM para Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "There are :1: robots",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Houston we have a problem!",
  "or": "o",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Equipo Phalcon",
  "phalcon_team_1": "Many more people",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Name",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Resources",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Restful Services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Returning data in JSON",
  "roadmap": "Roadmap",
  "router": "Router",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Create the router",
  "router_3": "Define a route",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Aplicaciones de Ejemplo",
  "see_for_yourself": "See for yourself...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Algo salió mal :(",
  "sponsored_by": "Patrocinado por",
  "sponsors": "Patrocinadores",
  "sponsors_and_supporters": "Patrocinadores y Personas que apoyan el Proyecto",
  "sponsors_and_supporters_upper": "PATROCINADORES Y PERSONAS QUE APOYAN EL PROYECTO",
  "sponsors_become_patron": "Se un Patrón!",
  "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "¡Estos con nuestros patrocinadores! ¡¡Gracias!!",
  "stack_overflow": "Stack Overflow",
  "store": "Tienda",
  "support": "Soporte",
  "support_documentation_1": "Por favor usa la :1: antes que todo. Puedes también usar la opción de buscar documentos para encontrar lo que estás buscando. Si tu pregunta sigue sin respuesta hay más opciones a continuación.",
  "support_download_page": "página de descargas",
  "support_forum_1": "Puedes preguntar en nuestro <a href=':1:'>Foro de discusión</a>",
  "support_note": "Algunos errores pueden aparecer debido a que no estas usando la última versión. Por favor visita :1:, descarga la última versión (o compilala) y confirma que el problema que estás experimentando es en realidad un error.",
  "support_phalcon_forum": "Foro Phalcon",
  "support_please_note": "Ten en cuenta:",
  "support_please_note_1": "Stack Overflow no está dedicado a soportar Phalcon",
  "support_please_note_2": "Por favor no informes sobre bugs allí. Usa el <a href=':1:'>issue tracker</a> en Github para ello",
  "support_please_note_3": "Por favor no solicites nuevas características allí. Usa el <a href=':1:'>issue tracker</a> en Github para ello",
  "support_please_note_4": "Recuerda incluir la etiqueta 'phalcon' en tu pregunta",
  "support_please_note_5": "Recuerda mencionar 'Phalcon' en la pregunta",
  "support_reporting_a_bug": "Reportar un bug",
  "support_reporting_a_bug_1": "Por favor reporta bugs cuando hayas agotado todas las opciones anteriores, usando el <a href=':1:'>issue tracker</a> en Github.",
  "support_slack": "Slack",
  "support_slack_1": "Puedes encontrarnos en el canal de slack <a href=':1:'>PhalconChats</a>.",
  "support_stack_overflow_1": "Si estás familiarizado o prefieres Stack Overflow, hay una etiqueta <a href=':1:'>phalcon</a> que puedes usar para consultar otras preguntas o etiquetar tu pregunta.",
  "support_us": "Support Us",
  "team": "Equipo",
  "team_andres_1": "Andrés no es ajeno a los proyectos de software abierto, en los últimos nueve años, ha estado diseñando y liberando frameworks y librerías para PHP además de estar envuelto activamente en desarrollo web - su mayor pasión.",
  "team_andres_2": "Como ganador del premio TR35, su mayor guía es escoger y usar la herramienta correcta para cada tarea, casi siempre enfocándose en rendimiento e innovación. En 2011 una nueva idea empezó a concebirse, crear un nuevo tipo de framework para desarrolladores PHP que se enfoque en usabilidad, características y principalmente rendimiento.",
  "team_andres_3": "A través de esta nueva iniciativa Phalcon ha nacido. Un framework escrito en C que pueda ofrecer un gran número de características a desarrolladores mientras maximiza el rendimiento y mantiene el consumo de recursos bajo.",
  "team_andres_4": "Andrés es uno de los desarrolladores y creadores de Phalcon y su inspiración.",
  "team_eduar_1": "Eduar is a C/PHP developer with several years of experience in application development. He is one of the founders and lead developers of the Phalcon project which began in 2011.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar likes science fiction movies and sometimes plays football.",
  "team_nikolay_1": "Nikolay has been developing web applications for over 10 years. He has been involved in high performance as well as complex websites and designs.",
  "team_nikolay_2": "Nikolay ha trabajado en proyectos de software abierto por largo tiempo, utilizándolos según los requerimientos lo permitan. Él empezó usando su tiempo personal para darle soporte a la comunidad, ofreciendo cambios en la arquitectura y sugerencias en rendimiento. También ha dedicado tiempo a la creación y mejora de CMSs de código abierto recibiendo criticas positivas de la comunidad.",
  "team_nikolay_3": "Su participación continua en proyectos de código abierto le ha ayudado a avanzar en sus conocimientos técnicos al mismo tiempo manteniendo la mentalidad de devolver a la comunidad.",
  "team_nikolay_4": "Nikolay es un impulsor de alcanzar el máximo rendimiento en aplicaciones web. Después de conocer Phalcon, decidió convertirse en un evangelista de él. Está liderando los esfuerzos en la comunidad de rusa ofreciendo recursos y ayuda a los ruso-hablantes.",
  "team_nikolay_5": "Sus contribuciones incluyen: una réplica del sitio principal en Ruso (<a href=':1:'>http://www.phalcon.ru</a>), una réplica de la documentación en Ruso (<a href=':2:'>http://docs.phalconphp.ru</a>), cambios frecuentes y mejoras a la documentación en inglés, un grupo en la red social Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos ha estado en la industria de IT por al menos 20 años. Inició en el mundo de PHP en el 2000 y ha estado en él trabajando en sus proyectos personales y los de sus empleadores.",
  "team_nikos_2": "Le encanta descubrir nuevas tecnologías y buscar formas de integrarlos con aplicaciones existentes sacando proyecho de ellas.",
  "team_nikos_3": "Él es un entusiasta del Desarrollo Orientado a Pruebas (TDD) y siempre trata de conseguir total cobertura en su código.",
  "team_nikos_4": "El continuo interés de Nikos en nuevas e innovadoras de tecnologias que salgan del molde lo introdujo a Phalcon. Se unió al core team y sus principales tareas están relacionadas con NFRs y corrección de bugs, ayudando con tests, documentación y la incubadora. Nikos es responsable de mantener las DLLs de Windows y ofrecer soporte siempre que sea posible.",
  "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Motor de plantillas (Volt)",
  "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
  "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
  "template_engines": "Motores de Plantillas",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Las Vistas representas la interfaz de usuario de tu aplicación.",
  "testimonials": "Testimonios",
  "testimonials_1": "Saludos, equipo Phalcon! Tengo un proyecto, construido en el framework Phalcon. Es una Guitarama (<a href=':1:'>:2:</a>) - tablaturas de guitarra y catálogo de acordes. El sitio está destinado para audiencia Rusa y usa el lenguaje Ruso, pero espero que no haya ningún problema en entender la mayoría de las páginas. El sitio fue re-lanzado en una nueva plataforma a principios de Enero de 2013, y desde entonces ha mostrado un crecimiento constante. Visitas diarias actuales: ~1500 visitantes únicos, ~5000 páginas vistas. El sitio corre sobre un viejo servidor físico 1xP4-3Ghz, 4GB RAM. De nuevo, gracias por su grandioso framework y por todo lo que hacen :) Michael.",
  "testimonials_2": "Hola, equipo Phalcon. Queremos compartir nuestro caso de éxito usando Phalcon en los proyectos <a href=':1:'>:2:</a> y <a href=':3:'>:4:</a>, los sitios más visitados y con más carga de Kazakhstan, clasificados en el TOP-10 de sitios en el CIS. Ambos sitios trabajan con una API similar a RESTful escrita en Phalcon\\Mvc\\Micro. En cargas altas la API procesa alrededor de 400 peticiones/segundo y este no es el límite. Al cambiarnos a Phalcon hemos reducido el tiempo de procesamiento y el consumo de CPU y memoria así como el tiempo de desarrollo. Continuaremos usando Phalcon en nuevos proyectos. Gracias por el gran trabajo que están haciendo! Saludos, Nikita Vershinin, Lead Developer, Kolesa.kz y krisha.kz",
  "testimonials_3": "Equipo Phalcon, el framework que han creado es increíble, nunca había usado un framework que combinara, velocidad, eficiencia, brevedad y naturalidad todo en un solo paquete. Trataré de contribuir de vuelva al proyecto en todo lo que pueda. Recientemente empecé a hacer un proyecto de unas ~800 horas y estoy feliz de decir que usaré Phalcon Framework. Bravo.",
  "testimonials_4": "Hola chicos, Acabo de encontrar Phalcon y es increíble!, Solamente quiero decirles lo increíbles que son!, Gracias por el framework y sigan con el buen trabajo! Ivan Penchev",
  "testimonials_5": "Hola Chicos, escribí un servicio de acortador de urls con Phalcon. ¡Fue increíble! enserio. <a href=':1:'>:2:</a>. Este es el demo <a href=':3:'>:4:</a> :) Murat Küçükosman",
  "testimonials_6": "Hola equipo Phalcon, cree un pequeño proyecto diseñado para usuarios Polacos usando su framework. Tengo que admitir que el rendimiento es asombroso, felicitaciones por su buen trabajo. Sirve para validar el contenido de páginas web en el lenguaje Polaco <a href=':1:'></a>:2:</a>",
  "testimonials_7": "Hola chicos! Solo quiero compartir con ustedes la última versión de nuestro viejo proyecto - <a href=':1:'>:2:</a>. Cambiarnos a Phalcon nos permitió reducir a la mitad la carga del servidor comparado con anteriores frameworks, ¡lo cual es grandioso!",
  "testimonials_description": "A continuación hay un conjunto de testimonios y casos de éxito, de personas como tú, desarrolladores y usuarios de Phalcon. Si tienes casos de éxito, no dudes en compartirlos con nosotros, escríbenos a <a href='mailto::1:'>:2:</a>.",
  "toggle_navigation": "Alternar navegación",
  "transactions": "Transacciones",
  "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
  "transactions_2": "Create a transaction manager",
  "transactions_3": "Request a transaction",
  "transactions_4": "Get the robots to be deleted",
  "transactions_5": "Something's gone wrong, we should rollback the transaction",
  "transactions_6": "Everything's gone fine, let's commit the transaction",
  "transactions_7": "Robots were deleted successfully!",
  "transactions_8": "Failed, reason: ",
  "transactions_description": "Transactions in Phalcon allows to keep the data integrity safe.",
  "try_phalcon": "Prueba Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Ve el video de demostración",
  "zephir": "Zephir"
}
