{
  "about": "À propos",
  "about_blog": "BLOG",
  "about_blog_1": "Si vous aimez écrire, n'oubliez pas que <a href=':1:'>notre blog</a> vous permet de publier vos propres tutos. Si vous avez votre propre blog et avez rédigé quelque chose sur Phalcon, nous pouvons aussi le publier sur nos réseaux sociaux pour améliorer sa visibilité. Si votre article n'est pas en anglais, nous pouvons le partager et essayer de le traduire. Si vous connaissez des blogs PHP intéressés par une présentation de Phalcon, faîtes le nous savoir ! ",
  "about_description_1": "Les projets incroyables ont besoin de talents incroyables. Vous ne le savez pas encore, mais nous pensons que vous pouvez construire un web meilleur. Ensemble nous somme prêts à changer le monde! Au sein de Phalcon, nous créons une nouvelle génération de framework pour PHP. Nous voulons vous donner d'incroyables performances,  tout en vous aidant à développer simplement, en restant fun.",
  "about_description_2": "Nous espérons que vous appréciez Phalcon autant que nous. Nous accueillons toujours avec plaisir toute nouvelle collaboration ou précieuse aide ! <strong>Vous n'avez pas besoin d'être un développeur en langage C pour aider Phalcon !</strong> Il existe un très grand nombre d'autres domaines auxquels vous pouvez apporter votre contribution.",
  "about_documentation": "DOCUMENTATION",
  "about_documentation_1": "Le dépôt du site-web est disponible sur <a href=':1:'>github</a>. Nous utilisons ce dépôt comme une source de documentation uniquement en anglais ! <br /><br />Nous apprécions toujours les corrections, ajouts et améliorations de la documentation, donc tout ce que vous avez à faire est de cloner le dépôt et réaliser une requête pull!<br /><br />Si vous pouvez les non anglophones à traduire le contenu, cela serait super! Nous utilisons<a href=':2:'>:3:</a> pour traduire, et vous pouvez trouver notre projet <a href=':4:'>ici</a>",
  "about_donations_sponsoring": "DONS / SPONSORS",
  "about_evangelism": "ÉVANGÉLISME",
  "about_evangelism_1": "Beaucoup de monde ignore l'existence de Phalcon ou qu'il fonctionne vraiment. Nous sommes certains que de nombreux développeurs gagneraient à entendre parler de Phalcon et de ce qu'il peut leur apporter. Si vous avez connaissance de réunions ou d'évènements PHP et souhaitez  parler du projet Phalcon, vous avez tout notre soutien. Qui ne voudrait pas en apprendre plus sur l'outil qui révolutionne le développement PHP ?",
  "about_facebook_page": "Page Facebook",
  "about_flying_with_phalcon": "Merci de voler avec Phalcon ! &lt;3",
  "about_follow_on_gab": "Suivez-nous sur Gab",
  "about_follow_on_twitter": "Suivez-nous sur Twitter",
  "about_google_plus_page": "Page Google+",
  "about_official_blog": "Blog officiel",
  "about_sample_applications": "EXEMPLES",
  "about_sample_apps_1": "De grands exemples aident les autres à mieux comprendre comment de grandes choses peuvent être faites avec Phalcon. Vous êtes libre de partager vos projets et ainsi d'aider les autres qui à leur tour vous donneront leurs avis sur vos travaux !",
  "about_screencasts": "Captures d'écrans",
  "about_screencasts_1": "Nous aimons tous les screencasts. Si vous avez le temps et que vous voulez aider la communauté avec des vidéos d'apprentissage sur les différentes fonctionnalités du framework vous êtes le bienvenu. Allez voir notre <a href=':1:'>Chaîne Vimeo</a> comme guide.",
  "about_share_experiences_1": "Ne soyez pas timides, n'hésitez pas à partager avec la communauté en quoi Phalcon vous a été utile. Si Phalcon vous a aidé, faites-le savoir à la communauté. Discutez aussi des composants nécessaires, de ce qui pourrait être simplifié, des bénéfices apportés par Phalcon. Bien que tout ne puisse pas être implémenté dans l'immédiat, vos requêtes peuvent réellement nous aider à construire l'avenir du projet. Vos retours nous sont d'une grande utilité.",
  "about_share_your_experiences": "PARTAGEZ VOS EXPÉRIENCES",
  "about_social_networks": "RÉSEAUX SOCIAUX",
  "about_social_networks_1": "Phalcon is evolving on a daily basis, through our desire to make it better. Social networks are part of our lives now, and we all interact with others through them. Sharing your Phalcon experience with your social circles will greatly increase the visibility of the project. More and more people will engage in our community, thus making it more powerful, even more feature rich and popular. Like, '+1', share posts that we constantly post on every social network, engage in discussions regarding those posts. People who discover Phalcon through your interactions will thank you!",
  "about_social_networks_2": "Nous sommes présents sur la plupart des réseaux sociaux. En nous suivant vous nous aiderez à accroître la visibilité du projet :",
  "about_sponsoring_1": "We’re a tiny but effective core team of developers working our tails off. We try to spend as much time as possible on the project. All our passion for this project makes us want to be better every day. Phalcon is open-sourced software and volunteer efforts are needed for its constant evolution. You can help us keep the development active by donating to the project or sponsoring the development. More time and resources dedicated to the project means more activity, more improvement, better support, more amazing features, etc.",
  "about_star_on_github": "Star du projet sur Github",
  "about_tests": "TESTS",
  "about_tests_1": "Aucun logiciel n'est exempt de bogues. Si vous en trouvez, n'hésitez pas à nous le dire. Nous avons une suite contient <a href=':1:'>16 000 tests</a>. Malheureusement, les tests unitaires ne suffisent pas. Aidez-nous à améliorer notre suite de tests, en ajoutant ou en améliorant ceux déjà en place. Chaque test ajouté rend le framework plus stable. ",
  "about_thank_you": "MERCI !",
  "about_thank_you_1": "Nous souhaiterions remercier tous nos contributeurs ainsi que les membres de la communauté pour nous avoir poussés à faire de Phalcon le meilleur framework de sa catégorie. Vos encouragements ont été une grande motivation pour nous. Nous espérons réussir à satisfaire et même à dépasser la confiance que vous accordez à Phalcon.",
  "about_translations": "TRADUCTIONS",
  "about_translations_1": "We are trying to reach as many developers as possible, breaking down the language barriers. We are using <a href=':1:'>:2:</a>, to handle all the words or sentences that need to be translated for this site. The project repository is located <a href=':3:'>here</a>.",
  "acl": "ACL",
  "acl_1": "Voici comment créer l'Access Control List (ACL)",
  "acl_2": "Créer l'ACL",
  "acl_3": "L'action par défaut est d'interdire l'accès (DENY)",
  "acl_4": "Inscription de deux rôles. Users : utilisateurs inscrits",
  "acl_5": "et Guests : utilisateurs non identifiés",
  "acl_description": "Access Control List permet de limiter l'accès aux modules autorisés",
  "api": "API",
  "auto_loader": "Chargeur automatique de classe",
  "auto_loader_1": "Enregistrez vos espaces de nom, préfixes, dossiers ou classes. Utilisez les événements du chargeur automatique et gardez un contrôle total sûr quels fichiers sont chargés et d'où.",
  "auto_loader_2": "Créé le chargeur automatique",
  "auto_loader_3": "Enregistrement de quelques espaces de nom",
  "auto_loader_4": "Enregistrement du chargeur automatique",
  "autoloader": "Chargeur automatique de classe",
  "autoloader_description": "Fournit le mécanisme de chargement automatique de classe PHP suivant la recommandation PSR-4.",
  "basic_features": "Fonctionnalités de Base",
  "blog": "Blog",
  "built_with_phalcon": "Construit avec Phalcon",
  "cache": "Cache",
  "cache_1": "Le composant de cache permet un accès plus rapide aux données fréquemment utilisées ou déjà traitées. Il supporte beaucoup de \"backends\" tel que Redis, Memcached, Mongo, Fichiers, Apc et autre.",
  "cache_2": "Définition du modèle du service de cache",
  "cache_3": "Mettre les données en cache durant un jour par défaut",
  "cache_4": "Paramètres de la connexion à Memcached",
  "cache_description": "Améliorez les performances avec un des nombreux \"backends\" de cache que Phalcon fourni",
  "community": "Communauté",
  "consulting": "Consultation",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO</a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO</a> vous félicite d'avoir choisit de faire de Phalcon un élément central de votre écosystème technologique !",
  "consulting_lezgro_2": "Depuis la naissance de notre entreprise en 2003, nous avons testé différentes technologies et approches du développement logiciel.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO</a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Maintenant que nous avons acquis une expérience positive avec Phalcon, nous pouvons vous aider à de développer avec Phalcon et vous aider à commercialiser votre produit basé sur Phalcon.",
  "consulting_lezgro_5": "Contactez LEZGRO via leur <a href=':1:'>site web</a>, où vous pourrez aussi voir des exemples et des témoignages de leur travail.",
  "consulting_mctekk_1": "MCTekK a sauté sur le wagon Phalcon depuis le premier jour. Depuis sa conception, nous avons vu les grands avantages que Phalcon offrait et pourrait offrir à l’avenir.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Contactez nous via notre  <a href=':1:'>site web</a>, où vous pourrez voir les projets dans lesquels nous sommes impliqués.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Contribuer",
  "contributors": "Contributeurs",
  "contributors_description": "Phalcon s'améliore de jour en jour grâce a notre communauté",
  "crypt": "Crypto",
  "crypt_description": "Cryptez/décryptez les données sensibles pour les protéger des tiers non autorisés",
  "data_and_storage": "Données et stockage",
  "dependency_injection": "Injection de dépendances",
  "dependency_injection_1": "Phalcon est construit sûr un modèle de programmation puissant mais néanmoins facile à comprendre appelé l'Injection de dépendances. Initialisez ou définissez vos services une seule fois - et utilisez les potentiellement n'importe où dans votre application.",
  "dependency_injection_2": "Créez le Conteneur de l'Injecteur de Dépendances",
  "dependency_injection_3": "Enregistrez des classes, fonctions, composants",
  "dependency_injection_4": "Utilisez les partout ailleurs dans votre code",
  "dependency_injection_description": "l'Injection de Dépendances et la Localisation de Service sont eux-même un conteneur.",
  "discord": "Discorde",
  "docs": "Docs",
  "documentation": "Documentation",
  "donate": "Faire un don",
  "download": "Télécharger",
  "download_arch": "Arch Linux",
  "download_arch_1": "Un PKGBUILD pour ArchLinux est disponible <a href=':1:'>ici</a>",
  "download_box_1": "Box #1",
  "download_box_2": "Box #2",
  "download_box_doc_root": "Document Root: :1:",
  "download_box_user_pass": "Utilisateur MySQL: :1: Mot de passe: :2:",
  "download_compilation": "Compilation",
  "download_compilation_1": "Sur Linux, il est aisé de compiler et d'installer l'extension depuis le code source.",
  "download_compilation_11": "1. Suivre les étapes suivantes pour créer l'extension depuis les sources en code C :",
  "download_compilation_12": "2. Ajoutez l'extension dans votre php.ini",
  "download_compilation_13": "3. Enfin, redémarrez le serveur web",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Après des demandes de la communauté, les développeurs de cPanel ont développé un module personnalisé permettant l'installation de Phalcon sur les sites hébergés par cPanel. Vous pouvez vous renseigner <a href=':1:'>ici</a>. Le module est maintenu sur <a href=':2:'>Github</a>.",
  "download_dependencies": "Dépendances",
  "download_dependencies_1": "Bien que Phalcon ne soit pas lié à d'autres extensions il en utilise certaines d'entre elles :",
  "download_dependencies_2": "Toutes les extensions ici présentes ne sont pas nécessaire au bon fonctionnement de Phalcon. Vous avez juste besoin d'installer celles dont vous avez besoin. Par exemple si vous utilisez une base de données MySQL, vous aurez juste besoin d'installer  PDO et PDO/MySQL et ignorer Oracle, SQLite, PostgreSQL et Mongo.",
  "download_developer_tools": "Outils de développement (Developer Tools)",
  "download_devtools_1": "Ces outils sont formés d'un ensemble de scripts pour générer des squelette de codes. La cœur de votre application peut être généré en une seule commande, vous permettant ainsi de démarrer rapidement un nouveau projet avec Phalcon.",
  "download_devtools_composer": "Installer via Composer",
  "download_devtools_composer_1": "Installer composer dans un répertoire commun ou directement dans votre projet :",
  "download_devtools_composer_2": "Créer un fichier composer.json avec le contenu suivant : ",
  "download_devtools_composer_3": "Lancer l'installation via composer :",
  "download_devtools_composer_4": "Créer un lien symbolique pointant vers le script phalcon.php :",
  "download_devtools_docs": "Documentation : <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "Vous pouvez télécharger ou cloner un paquet compatible incluant les outils pour développeurs depuis  <a href=\":1:\">Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Vous pouvez utiliser Phalcon avec Docker de plusieurs façons.",
  "download_docker_2": "Nos images officielles sont disponibles <a href=':1:'>ici</a>.\nVos pull requests et vos améliorations sont les bienvenues.\nLe repository des fichiers Docker est disponible ici:",
  "download_docker_3": "Avec Phalcon-compose, créez un environnement isolé Docker qui vous permet d'utiliser Phalcon sans installations supplémentaires. Veuillez noter que pour utiliser Phalcon Compose vous avez besoin de",
  "download_docker_4": "et",
  "download_docker_5": "Services",
  "download_docker_6": "Phalcon Compose propose les services suivants par défaut:",
  "download_docker_7": "Phalcon Compose est très facile à utiliser. Supposons que vous vouliez créer une application qui résidera à l'adresse:",
  "download_docker_8": "Nous devons maintenant exécuter la commande suivante pour créer le conteneur d'application:",
  "download_docker_9": "La commande ci-dessus téléchargera le squelette de l'environnement Docker.",
  "download_docker_10": "Variables",
  "download_docker_11": "Vous devez créer un nouveau fichier nommé",
  "download_docker_12": "dans",
  "download_docker_13": "Un fichier d'exemple est fourni qui est nommé",
  "download_docker_14": "Adaptez les variables dans ce fichier en fonction de vos besoins. La variable la plus importante est ",
  "download_docker_15": "Changez le nom en quelque chose que vous puissiez utiliser. Pour cet exemple nous avons avons simplement conservé le défaut appelé",
  "download_docker_16": "Ouvrir votre fichier hosts (<code>/etc/hosts</code>) et insérez une nouvelle ligne comme ceci :",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Compiler",
  "download_docker_19": "Vous pouvez maintenant compiler l'environnement.",
  "download_docker_20": "Les conteneurs seront chargés en fonction des besoins et configurés dans votre environnement.",
  "download_docker_21": "Démarrer",
  "download_docker_22": "Vous pouvez maintenant démarrer l'environnement:",
  "download_docker_23": "Allez à :1: dans votre navigateur, votre environnement est installé. Vous pouvez maintenant développer votre application dans le folder app.",
  "download_docker_24": "Arrêter",
  "download_docker_25": "Pour éteindre l'environnement qui n'est plus nécessaire, exécutez la commande suivante:",
  "download_docker_26": "Vous trouverez davantage d'informations ici:",
  "download_examples": "Exemples pré-installés",
  "download_examples_1": "Les exemples suivants sont pré-installés sur chaque Vagrant box.",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Un port est disponible pour FreeBSD. Instructions pour l'installer :",
  "download_ide_stubs": "IDE stubs",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Besoin d'aide ?",
  "download_need_help_1": "Jetez un oeil à notre <a href=':1:'>page de support</a> pour obtenir de l'aide. Nous ferons de notre mieux pour vous répondre.",
  "download_note": "Phalcon est une extension C, par conséquent vous devrez télécharger le fichier pour votre platform ou le compiler depuis les sources",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Un paquet est disponible <a href=':1:'>ici</a> (merci à <a href=':2:'>Mariusz \\u0141\\u0105czak</a>)",
  "download_requirements": "Éxigences",
  "download_requirements_1": "Nous aurons besoin de paquets préinstallés :",
  "download_requirements_2": "PHP 5.x (ressources de développements)",
  "download_requirements_3": "Compilateur GCC",
  "download_source_code": "Code source : <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Code source (pensez à passer sur la bonne branche) : <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "Afin d'installer Phalcon sous Ubuntu, merci de suivre ces différentes étapes :",
  "download_ubuntu_1": "Si l'instruction apt-add-repository n'est pas disponible, veuillez utiliser la commande suivante :",
  "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
  "download_ubuntu_or_debian": "Ubuntu ou Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> est un excellent outil afin de créer et configurer un environnement de développement portable, reproductible et léger.",
  "download_vagrant_2": "Utilisez une des box suivantes pour tester ou développer avec Phalcon sur un environnement pré-configuré.",
  "download_vagrant_boxes": "Boxes Vagrant",
  "download_windows": "DLLs Windows ",
  "download_windows_download": "Télécharger",
  "download_windows_dlls": "Les DLLs Windows peuvent être téléchargées depuis notre <a href=':1:'>page Github</a>",
  "download_windows_guides": "Guides Connexes",
  "download_windows_guides_wamp": "Installer sur WAMP",
  "download_windows_guides_xampp": "Installer sur XAMPP",
  "download_windows_installation": "l'installation",
  "download_windows_installation_1": "Pour utiliser Phalcon sur windows, vous pouvez télécharger une librairie DDL. Editez votre php.ini, ajoutez l'extension à la fin et enfin redémarrez le serveur web pour charger l'extension. <a href=':1:'>Plus</a>.",
  "download_windows_note": "Nous recommandons vivement d'utiliser la dernière version de PHP qui correspond à nos DLLs, et ainsi tirer parti de toutes les fonctionnalités de Phalcon. ",
  "download_windows_older": "Anciennes versions",
  "download_windows_stable": "Versions Stable/Master",
  "encryption": "Chiffrement",
  "encryption_1": "Phalcon fourni des aides au chiffrement via le composant Phalcon\\Crypt. Cette classe offre une surcouche simple et orienté objet de la bibliothèque de chiffrement openssl de PHP.",
  "encryption_2": "Ceci est une clé secrète (de 32 bytes).",
  "encryption_3": "Ceci est le texte que vous voulez chiffrer.",
  "events": "Événements",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Gestion d'événements",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Création d'un gestionnaire d'évènements",
  "events_management_3": "Ecoute des événements produits par le dispatcheur en utilisant le plugin Security",
  "events_management_4": "Traite les exceptions et les exceptions \"non-trouvé\" en utilisant NotFoundPlugin",
  "events_management_5": "Assigne l'EventsManager au Dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Messages Flash",
  "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
  "flash_messages_2": "Il y a eu des erreurs dans le formulaire",
  "flash_messages_3": "Oui ! Tout s'est très bien passé",
  "flash_messages_4": "Ceci est une note pour l'utilisateur",
  "flash_messages_5": "Ceci est juste un avertissement",
  "flash_messages_description": "Les messages flash sont utilisés pour informer l'utilisateur de l'état des actions.",
  "forms_builder": "Construction de formulaires",
  "forms_builder_1": "Chaque élément du formulaire peut être rendu comme le développeur le désire. Phalcon\\Tag est utilisé en interne pour produire le code HTML correct de chaque élément , de plus vous pouvez passer des attributs HTML supplémentaire en seconde paramètre de render():",
  "forms_builder_2": "Accueil",
  "forms_builder_3": "Téléphone portable",
  "forms_builder_description": "Créez facilement des formulaires HTML",
  "forum": "Forum",
  "gab": "Gab.ai",
  "get_phalcon": "Télécharger Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "L'architecture innovante de Phalcon en fait le framework PHP le plus rapide jamais conçu !",
  "header_tagline": "Un framework PHP complet sous la forme d'une extension en C",
  "high_performance_php_framework": "Un framework PHP ultra-performant",
  "hosting": "Hébergement",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud propose une capacité de calcul évolutive dans le cloud que vous payez en fonction de l'utilisation.",
  "hosting_amazon_ec2_2": "Selectionnez une template préconfigurée Amazon Machine Image (AMI) pour un départ immédiat. Vous pouvez également créer une AMI contenant vos application, vos librairies vos données et les configurations associées. <a href=':1:'>En savoir plus</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix fournit un très bon service d'hébergement web sur Windows. Nos client ont décrit nos services comme étant exceptionnel. Nous avons des offres pour les hébergements web mutualisées sur Linux ou Windows, pour les serveurs virtuels privés (VPS) ou pour les serveurs dédiés! <a href=':1:'>En savoir plus</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows and Linux cPanel shared web hosting packages and plans, no configuration or installation required! ASPnix offers a variety of PHP versions from 5.2 - 7.2 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "<a href=':1:'>Windows Azure</a> est une plateforme Cloud ouverte et flexible qui vous permet de générer, déployer et gérer rapidement des applications à travers un réseau global de centres de données gérés par Microsoft.       \n  ",
  "hosting_azure_2": "Installer Phalcon en utilisant les <a href=':1:'>instructions d'installation</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon peut être installé sur n'importe quelle machine auquel vous avez un accès au compte root en SSH (ou sudo). Ci-dessous est présentée une liste de sociétés renommées offrant ce service :",
  "hosting_digital_ocean_1": "Technologie de cloud ultra rapide. Construite pour les développeurs. Déployez un serveur en cloud sur SSD en 55 secondes. <a href=':1:'>En savoir plus</a>",
  "hosting_digital_ocean_2": "Suivez ce <a href=':1:'>tutoriel</a> pour commencer",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host offers multiple affordable and high quality hosting plans.",
  "hosting_dcthost_2": "By default, they have Phalcon installed on all their shared hosting packages.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit offre plusieurs plans d'hébergement (il y en a un pour les développeur qui est gratuit mais limité) qui satisferons la plupart des besoins des développeurs souhaitant essayer Phlacon ou déployer une application utilisant Phalcon. ",
  "hosting_fortrabbit_2": "Ils proposent diverses  <a href=':1:'>extensions</a> qui sastiferaient même les projets les plus exigeants.",
  "hosting_fortrabbit_3": "Les versions stables de Phalcon sont préinstallées, vous pouvez les activer depuis le panel admin.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Installer Phalcon en utilisant les instructions standards d'installation.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Suivez ce <a href=':1:'>tutoriel</a> pour commencer",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Déployez et gérez des serveurs virtuels Linux dans le Cloud de Linode. Démarrez un serveur en quelques secondes. Vous choisissez la distribution, les ressources et le position du nœud. <a href=':1:'>En savoir plus.</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Les serveurs Cloud sont des machines virtuelles tournant sous Linux ou Windows&reg;Server dans le Cloud.\nIl est possible d'augmenter ou de diminuer les ressources comme la CPU, la mémoire, l'espace disque, en fonction des besoins. De plus, le paiement se fait à la consommation.\n<a href=':1:'>En savoir plus</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hebergement pour développeurs. Accès complet au shell avec tous vos outils favoris préinstallés et maintenus pour les utilisateurs.",
  "hosting_webfaction_2": "Pour utiliser PhalconPHP avec  WebFaction, suivez les instructions fournies <a href=':1:'>ici</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "Le composant Phalcon\\Translate facilite la création d'application multilingues. Les applications qui exploitent ce composant affichent le contenu dans différentes langues selon la langue choisie par l'utilisateur et supportée par l'application.",
  "i18n_2": "Demande au navigateur quelle est la meilleur langue",
  "i18n_3": "Vérification de la disponibilité d'un fichier de traduction pour cette langue",
  "i18n_4": "Utilisation d'une valeur par défaut",
  "i18n_5": "Retourne un objet de traduction",
  "i18n_description": "Traduisez votre application en de multiples langues facilement",
  "installing_phalcon_php": "Installer Phalcon PHP",
  "issue_tracker": "Suivi des problèmes",
  "join_our_community": "Rejoignez notre communauté de développeur !",
  "join_our_community_description": "Contributions de la Communauté dans les Extensions, Plugins, adaptateurs, VM, exemples, code source... et plus",
  "language_text": "Anglais",
  "learn": "Apprendre",
  "license_new_bsd": "Phalcon est un framework PHP open-source <br /> fourni sous la forme d'une extension C. Il est distribué sous la <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>nouvelle licence BSD</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
  "low_overhead_2": "Les classes et fonctions fournies par l'extension sont prêtes à être utilisées par n'importe quelle application",
  "low_overhead_3": "Le code est compilé et n'est pas interprété puisqu'il est déjà compilé pour une plateforme et un processeur spécifique",
  "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
  "low_overhead_description": "Faible consommation mémoire et CPU comparé aux frameworks traditionnels ",
  "low_overhead_title": "Extension-C PHP (Phalcon)",
  "more": "PLUS...",
  "mvc": "MVC",
  "mvc_1": "Construisez des applications mono et multi-module facilement en utilisant la structure de fichier, les pratiques et les patrons de conception que vous connaissez déjà",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, composants, modèles, vues et contrôleurs",
  "odm_for_mongo": "ODM pour Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "Combien de robots y a-t-il ?",
  "odm_for_mongo_3": "Combien de robots mécaniques ?",
  "odm_for_mongo_4": "Il y a :1: robots",
  "odm_for_mongo_description": "Object Document Mapping pour MongoDB",
  "oops": "Houston, nous avons un problème !",
  "or": "ou",
  "orm": "ORM",
  "orm_1": "Un puissant ORM est fourni avec Phalcon vous permettant de manipuler les données de votre base de donnée sous forme de classes et objets. MySQL, PostgreSQL et SQLite sont supportés de base.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "L'équipe de Phalcon",
  "phalcon_team_1": "Plein d'autres personnes",
  "phalcon_team_2": "Phalcon est et a toujours été une réussite de beaucoup de bénévoles :",
  "phql": "PHQL",
  "phql_1": "PHQL est un dialecte SQL de haut-niveau orienté objet vous permettant d'écrire des requêtes en utilisant un langage standard SQL. PHQL est implémenté comme un \"parser\" (écrit en C) qui traduit la syntaxe en celle du gestionnaire de base de donnée cible. Afin d'obtenir les meilleures performances possible, Phalcon fourni un \"parser\" utilisant la même technologie que SQLite. Cette technologie permet d'avoir un \"parser\" peu gourmand en mémoire et aussi \"thread-safe\"",
  "phql_2": "Nom",
  "phql_description": "Le puissant et sécurisé Phalcon Query Language, PHQL",
  "polling_app": "Une application de vote en partant de rien en moins de 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Resources",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Services RESTful",
  "restful_services_1": "Applications et serveurs reste écrit n’a jamais été aussi facile. Aucun passe-partout. Services simples présent dans un seul fichier.",
  "restful_services_2": "Retour des données en JSON",
  "roadmap": "Feuille de route",
  "router": "Routeur",
  "router_1": "Routing comme il doit l'être. Rien de plus, rien de moins.",
  "router_2": "Créer le routeur",
  "router_3": "Définir une route",
  "router_description": "Phalcon\\Mvc\\Router offre des capacités de routing avancées.",
  "sample_applications": "Exemples d'applications",
  "see_for_yourself": "Voyez par vous-même...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "Ce service retourne une base de données MySQL",
  "sharding_3": "Ce service retourne une base de données PostgreSQL",
  "sharding_description": "Connecter, stocker et récupérer les données de plusieurs base de données en même temps",
  "slack": "Slack",
  "something_went_wrong": "Quelque chose n'a pas fonctionné",
  "sponsored_by": "Sponsorisé par",
  "sponsors": "Sponsors",
  "sponsors_and_supporters": "Partenaires et sponsors",
  "sponsors_and_supporters_upper": "SPONSORS ET SOUTIENS",
  "sponsors_become_patron": "Soutenez-nous !",
  "sponsors_description_1": "Pour ceux qui souhaitent parrainer notre travail et poursuivre le développement de Phalcon, nous offrons diverses options de parrainage qui conviendront à tous les budgets. Le parrainage de notre travail nous permet de consacrer plus de temps au projet, d'offrir des réponses plus rapides aux bugs et fonctionnalités et d'assurer la stabilité des projets.",
  "sponsors_our_great_sponsors": "Ce sont nos sponsors! Merci beaucoup!!",
  "stack_overflow": "Stack Overflow",
  "store": "Magasin",
  "support": "Support",
  "support_discord": "Venez rejoindre the Phalcon sur <a href=':1:'>Discord</a>",
  "support_documentation_1": "Merci d'utiliser :1: avant tout. Vous pouvez aussi utiliser la fonction recherche de documents afin de répondre à vos besoins. Si votre question reste sans réponse, voici les autres possibilités.",
  "support_download_page": "Page de téléchargement",
  "support_note_1": "Notre grande communauté et nos contributeurs sont heureux de vous aider ! Veuillez utiliser ces ressources communautaires pour obtenir de l'aide.",
  "support_note_2": "Beaucoup de bugs sont levés car les utilisateurs ne font pas fonctionner la dernière version. Allez sur :1:, téléchargez la dernière version disponible (ou compilez-là) et vérifiez que le problème que vous avez rencontré est bien un bug.",
  "support_phalcon_forum": "Les questions doivent être posées sur le <a href=':1:'>forum officiel</a>",
  "support_please_note": "Veuillez noter :",
  "support_please_note_1": "Stack Overflow n'est pas un support dédié à Phalcon",
  "support_please_note_2": " ",
  "support_please_note_3": "Please do not ask for feature requests there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_4": "Soyez sûr d'attacher le tag \"phalcon\" à votre question",
  "support_please_note_5": "Pensez à mentionner \"Phalcon\" dans la question",
  "support_reporting_a_bug": "Signaler un bug",
  "support_reporting_a_bug_0": "Si vous pensez que vous avez trouvé un bug, s'il vous plaît <a href=':1:'>ouvrez une issue</a>",
  "support_reporting_a_bug_1": "Please report bugs when you've exhausted all of the above options, using the <a href=':1:'>issue tracker</a> in Github.",
  "support_slack": "There is a less active but still functioning community on <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Another way is to ask a question on <a href=':1:' target='_blank'>Stack Overflow</a> and tag it with <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Our social network accounts are: <a href=':1:'>Gab.ai</a> , <a href=':2:'>Twitter</a>, <a href=':3:'>Facebook</a> and <a href=':4:'>Google+</a>",
  "support_us": "Nous supporter",
  "team": "L'équipe",
  "team_andres_1": "Andres n'est pas étrangé à l'univers de l'open souce. Durant les neuf dernières années il a participé à l'élaboration de frameworks pour PHP. Il était également très impliqué dans le développement web qui est sa principale passion.",
  "team_andres_2": "A TR35 winner, Andres' main drive is to always choose and implement or use the right tool for the job, mostly focused on performance. Therefore in 2011 a new idea was in the works; to create a new kind of framework for PHP developers, one that focuses on usability, features and mostly performance.",
  "team_andres_3": "C'est à travers cette approche innovante que Phalcon à vue le jour. Un framework PHP écrit en C qui offre aux développeur des outils puissants, performant et nécessitant peu de ressources.",
  "team_andres_4": "Andres est au cœur de Phalcon, il est aussi sa source d'inspiration.",
  "team_eduar_1": "Eduar is a C/PHP developer with several years of experience in application development. He is one of the founders and lead developers of the Phalcon project which began in 2011.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar likes science fiction movies and sometimes plays football.",
  "team_nikolay_1": "Nikolay a développé des applications web depuis plus de 10 ans. Il a été impliqué dans des projets nécessitant de hautes performances ainsi que dans des sites web complexes.",
  "team_nikolay_2": "Nikolay travail depuis longtemps sur des projets open sources et les utilise quand ils sont nécessaires. Il a commencé en donnant à des projets sur son temps libre, en offrant des modifications d'architecture ou des suggestions de performances. Il a eu un rôle determinant dans lamélioration de CMS open sources et en échange il a eu des retours positifs.",
  "team_nikolay_3": "Sa participation continue sur des projets open source lui a permis de faire progresser ses compétences techniques tout en enrichissant et en respectant la mentalité de la communauté.",
  "team_nikolay_4": "Nikolay est plus que tout attaché aux performances des applications webs. Après avoir découvert Phalcon il a décidé de poursuivre et d'utiliser le framework. Il en est devenu un Evangeliste. Il concentre ses efforts pour la communauté russe et propose Phalcon pour les dévelopeur parlant Russe.",
  "team_nikolay_5": "Sa participation inclut : Un clone du site officiel pour la Russie  (<a href=':1:'>http://www.phalcon.ru</a>), un clone de la documentation pour la Russie (<a href=':2:'>http://docs.phalconphp.ru</a>), des changements et des corrections sur la documentation Anglaise ainsi que la création d'un groupe sur le réseau social Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos a travaillé pendant 20 ans dans l'industrie informatique. Il a découvert PHP en l'an 2000 et depuis il n'a pas cessé de l'utiliser dans des projets personnels ainsi que dans des projets professionnels.",
  "team_nikos_2": "Il aime découvrir de nouvelles technologies et essayer de les intégrer à des applications déjà existantes et ainsi bénéficier de ce qu'elles offrent.",
  "team_nikos_3": "C'est un fervent partisan du développement dirigé par les tests (TDD) et il essaye au maximum de couvrir son code par des tests.",
  "team_nikos_4": "Nikos' continuing interest in new and innovative technologies breaking out of the norm introduced him to Phalcon. He joined the core team and his tasks mainly involve coordination of NFRs and bug fixes, help with tests, documentation and the incubator. Nikos is also responsible for maintaining the Windows DLLs for the project and offers support whenever possible.",
  "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
  "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
  "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
  "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Moteur de rendu (Volt)",
  "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
  "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
  "template_engines": "Moteur de templates",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Views represent the user interface of your application",
  "testimonials": "Témoignages",
  "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits: ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1\\u0445P4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing :)  Michael.",
  "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing! Best regards, Nikita Vershinin, Lead Developer, Kolesa.kz and krisha.kz",
  "testimonials_3": "Phalcon, le framework que vous avez créé et exceptionnel ! Je n'avais jamais utilisé un framework qui combine vitesse, efficacité, finesse tout en restant aussi naturel. J'ai l'intention de vous vous donner ma contribution en retour. J'ai récemment travaillé sur un projet d'environ 800 heures et c'est avec fierté que je peux dire que nous utilise Phalcon. Bravo. Biran Seymour",
  "testimonials_4": "Salut les gars, je viens de tomber sur Phalcon et c'est juste énorme ! Je voulais vous dire à quel point vous êtes énormes ! Bref, merci pour ce framework et continuez à faire du bon boulot ! Ivan Penchev",
  "testimonials_5": "Hi Guys, i wrote simple url-shortener service with phalcon. That was amazing! really. <a href=':1:'>:2:</a>. Demo is here: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Hello Phalcon Team, I created a small project designed for Polish users using your framework. I have to admit that the performance is amazing, congratulations good job. Service to validate the content of the web pages in Polish language <a href=':1:'>:2:</a>",
  "testimonials_7": "Hi guys! Just wanted to share with you the latest release of our old project - <a href=':1:'>:2: </a>. Switching to phalcon allowed us to halve the server load compared to the previous framework, which is great!",
  "testimonials_description": "Below is a collection of testimonials and success stories, from you, the developers and users of Phalcon PHP. We always welcome emails with success stories and will be posting those in our blog. If you wish to send us your success story or get in touch with us, feel free to mail us at <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Toggle navigation",
  "transactions": "Transactions",
  "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
  "transactions_2": "Create a transaction manager",
  "transactions_3": "Request a transaction",
  "transactions_4": "Get the robots to be deleted",
  "transactions_5": "Something's gone wrong, we should rollback the transaction",
  "transactions_6": "Everything's gone fine, let's commit the transaction",
  "transactions_7": "Robots were deleted successfully!",
  "transactions_8": "Failed, reason: ",
  "transactions_description": "Transactions in Phalcon allows to keep the data integrity safe.",
  "try_phalcon": "Essayer Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Regardez la vidéo demo",
  "zephir": "Zephir"
}