{
  "about": "Tentang",
  "about_blog": "BLOG",
  "about_blog_1": "Jika kamu suka menulis, ingat bahwa <a href=':1:'>blog kami</a> terbuka untuk memposting tutorial yang kamu buat. Jika kamu punya sebuah blog milik kamu sendiri dan punya sebuah tulisan mengenai phalcon, kami juga dapat terbitkan dalam halaman jaringan sosial kami sehingga mencapai visibilitas maksimum. Jika posting blog kamu dalam bahasa lain selain bahasa Inggris, kami bakal membagikannya dan mungkin bakal di terjemahkan jika memungkinkan. Jika kamu tahu tentang blog yang terkait dengan PHP lalu tertarik dalam menyajikan konten untuk pembaca silakan beritahu kami.",
  "about_description_1": "Projek luar biasa butuh tangan yang luar biasa. Kami mungkin tidak tahu kamu atau mungkin belum, tapi kami pikir bahwa kamu sangat cocok untuk membangun web yang lebih baik. Bersama-sama, kami siap untuk mengubah dunia! Disinilah phalcon, kami membangun sebuah framework PHP generasi baru; Kami ingin memberikan performa yang luar biasa sambil membantu kamu mengembangkan dengan cara yang mudah dan menyenangkan.",
  "about_description_2": "Kami berharap kamu menikmati phalcon sama seperti kami. Kami selalu menanti untuk bekerjasama dan dan membantu! <strong>Kamu tidak perlu menjadi pengembang C untuk membantu phalcon!</strong> Ada banyak tempat lain untuk kamu bisa berkontribusi:",
  "about_documentation": "DOKUMENTASI",
  "about_documentation_1": "Repositori dari situs ini tersedia di <a href=':1:'>github</a>. Kami menggunakan repositori itu sebagai sumber dokumentasi kami untuk bahasa Inggris saja!.<br /><br />Kami selalu menghargai koreksi, penambahan dan penyempurnaan dalam dokumentasi kami, jadi yang harus Anda lakukan adalah mengkloning repositori dan penerbitan permintaan tarik! <br/><br/> Jika Anda dapat membantu pengembang yang tidak berbahasa Inggris dengan menerjemahkan beberapa konten ke bahasa lain, itu akan menjadi hebat! Kami menggunakan <a href=':2:'>:3:</a> untuk terjemahan kami, dan Anda dapat menemukan proyek kami <a href=':4:'>here</a>",
  "about_donations_sponsoring": "DONATUR / SPONSOR",
  "about_evangelism": "PENGINJILAN",
  "about_evangelism_1": "Banyak orang mash belum tahu keberadaan phalcon, atau apakah phalcon benar-benar dalat bekerja. Kami yakin banyak pengembang akan medapatkan keuntungan setelah mengetahui apa itu phalcon dan bagaimana phalcon itu dalat membantu mereka. Jika anda mengetahui salah satu event/meeting dan anda ingin membutuhkan pembicara tentans proyek, anda akan mendapatkan dukungan penuh dari kami. Siapa yang tidak ingin tahu tentang alat yang merevolusi pengembangan PHP?",
  "about_facebook_page": "Halaman Facebook",
  "about_flying_with_phalcon": "Terima kasih untuk phalcon! &lt;3",
  "about_follow_on_gab": "Ikuti kami di Gab",
  "about_follow_on_twitter": "Ikuti kami di Twitter",
  "about_google_plus_page": "Halaman Google+",
  "about_official_blog": "Blog Resmi",
  "about_sample_applications": "APLIKASI SEDERHANA",
  "about_sample_apps_1": "Contoh yang besar membantu orang lain untuk lebih memahami bagaimana hal-hal besar dapat dibuat dengan Phalcon. Jangan ragu untuk berbagi repositori untuk memberi contoh aplikasi yang membantu orang lain dengal pekerjaan mereka dan mengijinkan mereka untuk memberikan umpan balik tentang pekerjaan anda juga.",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "Kami semua menyukai screencast. Jika anda memiliki beberapa waktu ekstra dan ingin mendukung komunitas dyngan beberapa video mengajar yang bagus dari setiap fitur framework ini. itu sangat diterima. Lihat <a href=':1:'> Saluran Vimeo </a> sebagai panduan.",
  "about_share_experiences_1": "Don’t be shy, feel free to share the ways through which Phalcon was useful to you with the community. If Phalcon is a success case for you, let us share that with the community. Also, discuss what components needed extra work, what you could do easier, what benefits you got by using Phalcon. Although not everything can be implemented immediately, your input on new feature requests can greatly help us shape the future of the project. Your feedback helps us all.",
  "about_share_your_experiences": "BERBAGI PENGALAMAN KAMU",
  "about_social_networks": "JEJARING SOSIAL",
  "about_social_networks_1": "Phalcon berkembang setiap hari, melalui keinginan kita untuk membuatnya lebih baik. Jaringan sosial adalah bagian dari kehidupan kita sekarang, dan kita semua berinteraksi dengan orang lain melalui mereka. Berbagi pengalaman Phalcon dengan lingkaran sosial Anda akan sangat meningkatkan visibilitas proyek. Semakin banyak orang akan terlibat dalam komunitas kita, sehingga membuatnya lebih bertenaga, bahkan lebih kaya fitur dan populer. Seperti, '+1', bagikan pos yang selalu kami poskan di setiap jejaring sosial, terlibat dalam diskusi mengenai pos tersebut. Orang-orang yang menemukan Phalcon melalui interaksi Anda akan berterima kasih!",
  "about_social_networks_2": "Kami hadir di sebagian besar jaringan sosial populer. Dengan mengikuti kami, Anda membantu kami meningkatkan visibilitas proyek kami:",
  "about_sponsoring_1": "We’re a tiny but effective core team of developers working our tails off. We try to spend as much time as possible on the project. All our passion for this project makes us want to be better every day. Phalcon is open-sourced software and volunteer efforts are needed for its constant evolution. You can help us keep the development active by donating to the project or sponsoring the development. More time and resources dedicated to the project means more activity, more improvement, better support, more amazing features, etc.",
  "about_star_on_github": "Beri bintang pada proyek di github",
  "about_tests": "TES",
  "about_tests_1": "Tidak ada perangkat lunak bebas dari bug. Jika Anda menemukan apapun, jangan ragu untuk memberitahu kami. Kami memiliki suite tes lebih dari <a href=':1:'> 16.000 </a> tes. Namun, unit-tes tidak pernah cukup. Membantu kami meningkatkan test suite kami dengan menambahkan lebih banyak tes atau meningkatkannya. Setiap tes yang diambahkan membuat Framework lebih stabil.",
  "about_thank_you": "TERIMA KASIH!",
  "about_thank_you_1": "Kami ingin mengucapkan terima kasih kepada semua kontributor dan anggota masyarakat kami karena telah mendorong kami menjadikan Phalcon sebagai kerangka terbaik dari jenisnya. Kata-kata dan pertalian baik yang mendorong kita untuk berbuat lebih baik. Kami berharap bisa memenuhi dan melampaui kepercayaan yang Anda berikan pada Phalcon.",
  "about_translations": "TERJEMAHAN",
  "about_translations_1": "Kami mencoba mencapai sebanyak mungkin pengembang, memecah hambatan bahasa. Kami menggunakan <a href=':1:'>:2:</a>, untuk menangani semua kata atau kalimat yang perlu diterjemahkan untuk situs ini. Repositori proyek terletak <a href=':3:'>here</a>.",
  "acl": "ACL",
  "acl_1": "Ini adalah bagaimana kamu membangun  \"Access Control List\" (ACL):",
  "acl_2": "Buat ACL",
  "acl_3": "Aksi bawaan adalah \"Akses Ditolak\"",
  "acl_4": "Mendaftar dua aturan, Pengguna adalah pengguna terdaftar",
  "acl_5": "dan tamu adalah pengguna tanpa identitas",
  "acl_description": "Access Control List memungkinkan pengguna mengakses modul mereka untuk",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Daftarkan ruang nama, awalan, direktori atau kelas. Manfaatkan peristiwa autoloader dan pertahankan kontrol penuh atas file apa yang dimuat dan dari mana.",
  "auto_loader_2": "Buat autoloader",
  "auto_loader_3": "Mendaftar beberapa namespaces",
  "auto_loader_4": "Mendaftarkan autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Menyediakan mekanisme autoloading kelas PHP mengikuti PSR-4.",
  "basic_features": "Fitur-fitur Dasar",
  "blog": "Blog",
  "built_with_phalcon": "Membangun dengan Phalcon",
  "cache": "Cache",
  "cache_1": "Komponen cache memungkinkan akses lebih cepat ke data yang sering digunakan atau sudah diproses. Ini mendukung banyak backends seperti Redis, Memcached, Mongo, Files, Apc dan lainnya",
  "cache_2": "Atur layanan cache model",
  "cache_3": "Data cache untuk satu hari secara default",
  "cache_4": "Pengaturnan koneksi memcached",
  "cache_description": "Tingkatkan performa dengan banyak backend cache yang phalcon sediakan",
  "community": "Komunitas",
  "consulting": "Konsultasi",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO</a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO</a> congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Karena perusahaan kami pertama kali melihat cahaya pada tahun 2003, kami telah mencoba berbagai teknologi dan pendekatan dalam pengembangan perangkat lunak.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO</a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Sekarang setelah mendapatkan pengalaman positif dengan Phalcon, kami terbuka untuk memberi saran agar Anda membuat keputusan untuk mengembangkan Phalcon, dan membantu Anda membawa produk berbasis Phalcon ke pasar.",
  "consulting_lezgro_5": "Hubungi LEZGRO melalui <a href=':1:'>website kami</a>, dimana kamu bisa juga melihat contoh dan testimoni dari pekerja kami.",
  "consulting_mctekk_1": "MCTekK melompat ke kereta Phalcon sejak hari pertama. Dari konsepsinya, kami melihat keuntungan besar yang ditawarkan Phalcon dan dapat ditawarkan di masa depan.",
  "consulting_mctekk_2": "Kami memiliki pengalaman yang luas dengan Phalcon dan telah mengembangkan segudang proyek dengan itu sebagai intinya. Kami hadir untuk memberi tahu Anda tentang apa pun yang Anda perlukan tentang Phalcon untuk membantu Anda meningkatkan kesiapan, kecepatan, dan kualitas Anda.",
  "consulting_mctekk_3": "Hubungi kami melalui website kami <a href=':1:'> </a>, dimana anda data melihat proyek yang kami telah turut terlibat didalamnya",
  "consulting_mctekk_header": "MCTekK telah menyampaikan berbagai proyek Phalcon high end, dengan kekuatan utama mereka adalah pengembangan web dan mobile.",
  "contribute": "Kontribusi",
  "contributors": "Kontributor Phalcon",
  "contributors_description": "Phalcon kembangkan setiap hari oleh komunitas kita yang menakjubkan",
  "crypt": "Crypt",
  "crypt_description": "Mengenkripsi / mendekripsi data penting untuk menjaga mereka aman dari pihak lain",
  "data_and_storage": "Data & penyimpanan",
  "dependency_injection": "Depndensi injeksi",
  "dependency_injection_1": "Phalcon dibangun di atas yang kuat namun mudah dipahami dan menggunakan pola yang disebut Dependency Injection. Menginisialisasi atau menentukan layanan sekali - dan menggunakannya hampir di mana saja selama aplikasi berlangsung.",
  "dependency_injection_2": "Membuat kontainer Dependency Injector ",
  "dependency_injection_3": "Daftar kelas, fungsi, komponen",
  "dependency_injection_4": "Gunakan kode lain di tempat lain",
  "dependency_injection_description": "Ketergantungan Injeksi dan Lokasi layanan dan itu sendiri wadah untuk mereka.",
  "discord": "Discord",
  "docs": "Dokumen",
  "documentation": "Dokumentasi",
  "donate": "Donasi",
  "download": "Unduh",
  "download_arch": "Arch Linux",
  "download_arch_1": "Berikut ini PKGBUILD untuk ArchLinux, tersedia <a href=':1:'> sini </a>",
  "download_box_1": "Kotak #1",
  "download_box_2": "Kotak #2",
  "download_box_doc_root": "Document Root: :1:",
  "download_box_user_pass": "MySQL User: :1: Password: :2:",
  "download_compilation": "Kompilasi",
  "download_compilation_1": "Di Linux kamu bisa dengan mudah mengkompilasi dan menginstall extensi dari kode sumber.",
  "download_compilation_11": "1. Untuk membuat extensi dari kode sumber C, ikuti langkah-langkah berikut ini:",
  "download_compilation_12": "2. Tambahkan extensi ke php.ini:",
  "download_compilation_13": "3. Terakhir, restart webserver",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Setelah permintaan dari komunitas, para pengembang cPanel merilis modul khusus yang memungkinkan untuk pemasangan Phalcon di host situs cPanel. Informasi dapat ditemukan <a href=':1:'> sini </a>. Modul ini kelola dalam <a href=':2:'> Github </a>.",
  "download_dependencies": "Ketergantungan",
  "download_dependencies_1": "Although Phalcon does not binary link to other extensions it does use some of them to offer functionality. The extensions used are:",
  "download_dependencies_2": "Tidak semua ekstensi diatas perlu hadir dalam sistem yang telah terinstall phalcon. Anda dapat menginstall salah satu yang anda butuhkan. Misalnya jika Anda menggunakan database MySQL, maka Anda hanya perlu menjalankan PDO da PDO/MySQL abaikan Oracle, SQlite, Postgresql dan Mongo.",
  "download_developer_tools": "Alat Pengembang",
  "download_devtools_1": "Alat ini adalah kumpulan skrip yang berguna untuk menghasilkan kode kerangka. Komponen inti aplikasi Anda dapat dihasilkan dengan perintah sederhana, memungkinkan Anda mengembangkan aplikasi dengan mudah menggunakan Phalcon.",
  "download_devtools_composer": "Instalasi melalui Composer",
  "download_devtools_composer_1": "Menginstal composer di lokasi umum atau dalam proyek Anda:",
  "download_devtools_composer_2": "Buat file composer.json seperti ini:",
  "download_devtools_composer_3": "Jalankan instalasi composer:",
  "download_devtools_composer_4": "Membuat symbolic link ke script phalcon.php:",
  "download_devtools_docs": "Dokumentasi: <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "Anda dapat men-download atau mengkloning paket lintas platform yang berisi alat pengembang dari <a href=':1:'> Github </a>.",
  "download_docker": "Buruh pelabuhan",
  "download_docker_1": "di sini banyak cara yang dapat Anda gunakan untuk menjalankan Phalcon dengan Docker.",
  "download_docker_2": "Gambar resmi kami berada <a href=':1:'> sini </a>. Kami selalu menyambut pull requests dan perbaikan. Repositori untuk file docker terletak di sini:",
  "download_docker_3": "Dengan Phalcon-compose kamu bisa membuat isolated environment dengan docker, yang memungkinkan kamu untuk menggunakan Phalcon tanpa instalasi tambahan. Perhatikan bahwa menggunakan Phalcon Compose, membutuhkan",
  "download_docker_4": "dan",
  "download_docker_5": "layanan",
  "download_docker_6": "Secara default phalcon Compose menawarkan layanan-layanan berikut:",
  "download_docker_7": "Phalcon Compose sangat mudah digunakan. Asumsikan bahwa kamu perlu membuat sebuah aplikasi yang akan berlokasi di:",
  "download_docker_8": "Kita sekarang akan perlu menjalankan perintah berikut untuk aplikasi kontainer yang dibuat:",
  "download_docker_9": "Perintah di atas akan mengunduh skeleton environment docker",
  "download_docker_10": "Variabel",
  "download_docker_11": "Kamu perlu membuat file baru yang disebut",
  "download_docker_12": "di",
  "download_docker_13": "Sebuah contoh file telah tersedia disebut",
  "download_docker_14": "Menyesuaikan variabel dalam file yang sesuai dengan kebutuhan kamu. Variabel yang paling penting adalah",
  "download_docker_15": "Mengubah nama untuk sesuatu yang kamu dapat gunakan. Dalam kasus kami, kami hanya meninggalkan default disebut",
  "download_docker_16": "Buka file host kamu (<code>/etc/hosts</ code>) dan masukkan baris baru seperti ini:",
  "download_docker_17": "Anda mungkin ingin mengedit file<code> docker-compose.yml </ code> dan menghapus layanan yang tidak akan anda menggunakan. Phalcon Compose menawarkan banyak layanan seperti yang disebutkan di atas, sehingga aplikasi Anda mungkin tidak perlu beberapa dari layanan tersebut. Menghapus layanan yang relevan dari <code> docker-compose.yml </ code> File akan mengurangi penggunaan memori dari lingkungan leria Anda.",
  "download_docker_18": "Membangun",
  "download_docker_19": "Sekarang kamu bisa membangun environment.",
  "download_docker_20": "Kontainer akan mendownload file yang diperlukan dan mengaturnya di lingkungan kerja Anda.",
  "download_docker_21": "Jalankan",
  "download_docker_22": "Sekarang kamu bisa meluncurkan environment:",
  "download_docker_23": "Pergi ke: 1: di browser Anda dan Anda akan melihat lingkungan kern Anda sudah diatur. Anda sekarang dapat mengembangkan aplikasi Anda dalam folder aplikasi.",
  "download_docker_24": "Matikan",
  "download_docker_25": "Untuk mematikan lingkungan kerja ketika sudah tidak lagi diperlukan Anda dapat menjalankan perintah berikut:",
  "download_docker_26": "Informasi tambahan dapat ditemukan di:",
  "download_examples": "Contoh pra-install",
  "download_examples_1": "Contoh dibawah ini adalah pra-install dari setiap vagrant box",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Sebuah port tersedia untuk FreeBSD. Anda hanya perlu menjalankan beberapa perintah ini untuk menginstalnya:",
  "download_ide_stubs": "Rintisan bertopik IDE",
  "download_ide_stubs_1": "video di bawah ini menjelaskan cara mengintegrasikan IDE untuk PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Butuh bantuan?",
  "download_need_help_1": "Silahkan lihat pada halaman <a href=':1:'>dukungan kami </a> untuk mendapatkan dukungan. Kami akan melakukan yang terbaik untuk membantu Anda.",
  "download_note": "Phalcon adalah ekstensi C, sehingga Anda perlu men-download file biner untuk platform os anda atau kompilasi dari source code.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "terdapat paket yang tersedia <a href=':1:'>here</a> (terima kasha untuk <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Persyaratan",
  "download_requirements_1": "Kita butuh paket yang sebelumnya diinstall:",
  "download_requirements_2": "PHP 5.x sumber daya pembangunan",
  "download_requirements_3": "GCC penyusun",
  "download_source_code": "Kode number: <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Kode sumber (silakan pilih branch yang relevan): <a href=':1:' target='_download' title='GitHub Repo'> github </a>",
  "download_ubuntu": "Untuk menginstal Phalcon pada Ubuntu atau Debian Anda harus mengikuti langkah-langkah:",
  "download_ubuntu_1": "jika anda tidal memiliki apt-add-repository jalankan perintah berikut:",
  "download_ubuntu_2": "jika anda ingin install versi sebelumnya Phalcon (1.x) gunakan PPA berikut:: ",
  "download_ubuntu_or_debian": "Ubuntu atau Debian",
  "download_vagrant": "Gelandangan",
  "download_vagrant_1": "<a href=':1:'> Vagrant </a> adalah alat yang sangat baik untuk membuat dan mengkonfigurasi lingkungan pengembangan ringan, mudah direproduksi, dan portabel.",
  "download_vagrant_2": "Gunakan salah satu vagran box berikut untuk menguji atau mengembangkan aplikasi dengan Phalcon di lingkungan kerja pra-dikonfigurasi.",
  "download_vagrant_boxes": "Kotak Gelandangan",
  "download_windows": "Windows DLL",
  "download_windows_download": "Unduh",
  "download_windows_dlls": "Windows DLL dapat didownload dari halaman rilis Github kami\n<a href=':1:'>here</a>",
  "download_windows_guides": "Panduan terkait",
  "download_windows_guides_wamp": "Instalasi di WAMP",
  "download_windows_guides_xampp": "Instalasi di XAMPP",
  "download_windows_installation": "Instalasi",
  "download_windows_installation_1": "Untuk menggunakan phalcon di Windows, kamu bisa mengunduh pustaka DLL. Ubah php.ini, dan tambahkan di baris terakhir, dan restart webserver untuk memuat extensi tersebut. <a href=':1:'>Selengkapnya</a>.",
  "download_windows_note": "Kami sangat menyarankan Anda menggunakan versi PHP terbaru sesuai dengan DLL kami, sehingga dapat mengunakan semua fitur lengkap dari Phalcon.",
  "download_windows_older": "Versi sebelumnya",
  "download_windows_stable": "Versi Stabil/Master",
  "encryption": "Enkripsi",
  "encryption_1": "Phalcon menyediakan fasilitas enkripsi melalui komponen Phalcon\\Crypt. Kelas ini menawarkan warapper OOP sederhana untuk perpustakaan enkripsi openssl PHP.",
  "encryption_2": "Ini adalah kunci rahasia (32 bytes).",
  "encryption_3": "Ini adalah teks yang ingin Anda mengenkripsi.",
  "events": "Acara",
  "events_description": "Perluas sebagian besar komponen kerangka kerja dengan menetapkan 'titik kait'. Buat acara Anda sendiri dan buat aplikasi Anda lebih fleksibel dan bertenaga",
  "events_management": "Manajemen Acara",
  "events_management_1": "Manajer Acara memungkinkan kami untuk melampirkan pendengar ke jenis peristiwa tertentu. Tipe yang menarik minat kita sekarang adalah 'pengiriman'. Kode berikut memfilter semua acara yang dihasilkan oleh Dispatcher:",
  "events_management_2": "Membuat sebuah events manager",
  "events_management_3": "Dengarkan acara yang diproduksi di petugas operator menggunakan plugin Keamanan",
  "events_management_4": "Menangani exceptions dan not-found exceptions menggunakan NotFoundPlugin",
  "events_management_5": "Menampatkan events manager dalam dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Flash Messages",
  "flash_messages_1": "Gunakan flash notifier menampilkan pemberitahuan kepada pengguna dalam aplikasi web:",
  "flash_messages_2": "ada kesalahan dalam form ini",
  "flash_messages_3": "ya !, semuanya berjalan dengan sangat lancar",
  "flash_messages_4": "ini adalah pemberitahuan untuk pengguna",
  "flash_messages_5": "ini hanya peringatan",
  "flash_messages_description": "Flash messages digunakan untuk memberitahu pengguna tentang keadaan sebuah tindakan.",
  "forms_builder": "Formulir Pembangun",
  "forms_builder_1": "Setiap elemen dalam bentuk dapat diberikan seperti yang diminta oleh pengembang. Secara internal, Phalcon\\Tag digunakan untuk menghasilkan HTML yang benar untuk setiap elemen dan Anda dapat menambahkan atribut HTML tambahan sebagai parameter kedua render():",
  "forms_builder_2": "Beranda",
  "forms_builder_3": "Telephone seluler",
  "forms_builder_description": "Mudah untuk membuat form HTML ",
  "forum": "Forum",
  "gab": "Gab.ai",
  "get_phalcon": "Dapatkan Phalcon :1:",
  "github": "Github",
  "google_plus": "Google Plus",
  "header_slogan": "arsitektur yang inovatif membuat Phalcon menjadi framework PHP tercepat yang pernah dibangun!",
  "header_tagline": "Sebuah full-stack PHP framework dibuat sebagai ektensi-C",
  "high_performance_php_framework": "PHP Framework berkinerja tinggi",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastis Menghitung Awan memberikan scalable, bayar-sesuai-yang anda-pakai menghitung kapasitas di awan.",
  "hosting_amazon_ec2_2": "Pilih pra-dikonfigurasi, templated Amazon Machine Image (AMI) untuk membangun dan menjalan dengan segera. Atau membuat sebuah AMI yang berisi aplikasi, perpustakaan, data, dan pengaturan konfigurasi terkait. <a href=':1:'> lebih lanjut</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix memberikan layanan web hosting Windows yang superior. pelanggan kami telah mendapatkan layanan kami dengan luar biasa. Kami menawarkan paket ekonomis untuk  cPanel web hosting Windows dan Linux , Virtual private server dan dedicated server! <a href=':1:'> Lihat lebih </a>",
  "hosting_aspnix_2": "Phalcon didukung di semua paket shared web hosting Windows, tidak ada konfigurasi atau instalasi yang diperlukan! Mereka menawarkan berbagai versi PHP 5,2-7,0 serta banyak <a href=':1:' ekstensi tambahan target=\"_blank\"> </a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "<a Href=':1:'> cloud Windows Azure </a> membantu Anda dengan scalable yang sangat tinggi dan  hosting Windows yang mudah dikelola untuk aplikasi web Anda. Gunakan Phalcon untuk mengurangi biaya Anda.",
  "hosting_azure_2": "Untuk menginstal Phalcon, ikuti langkah-langkah prosedur di <a href=':1:'> artikel SitePoint ini </a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services:",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Dibangun untuk pengembang. Dibangun pada SSD cloud server dalam 55 detik<a href=':1:'> Lihat lebih </a>",
  "hosting_digital_ocean_2": "Ikuti <a ini href=':1:'> tutorial</a> ini untuk memulai",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host menawarkan beberapa paket hosting terjangkau dan berkualitas tinggi.",
  "hosting_dcthost_2": "Secara default, mereka telah menginstal Phalcon pada semua paket shared hosting mereka.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit menawarkan banyak rencana hosting (ada satu untuk pengembang dan gratis - dengan beberapa keterbatasan) yang akan memuaskan kebutuhan sebagian besar pengembang yang ingin mencoba Phalcon atau menerapkan aplikasinya.",
  "hosting_fortrabbit_2": "Mereka menawarkan berbagai ekstensi <a href=':1:'> </a> yang akan memuaskan bahkan untuk proyek yang menuntut banyak persyaratan.",
  "hosting_fortrabbit_3": "Versi stabil dari palcos telah terinstall. Anda dapat mengaktifkannya dari dashboard administrasi",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Instal Phalcon menggunakan petunjuk standar instalasi.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Ikuti <a ini href=':1:'> tutorial</a> ini untuk memulai",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Membangun dan Mengelola Linux Virtual Server di Linode Cloud. Jalankan server dal am hitungan detik dengan pilihan distro Linux anda, dan titik lokasi, <a href=':1:'> Lihat lebih lanjut</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Server adalah mesin virtual yang menjalankan Linux atau Windows & reg; Server di Rackspace Cloud. Anda dapat mengatur sumber daya seperti CPU, memori, dan memperbesar atau memperkecil penyimpanan, tergantung pada kebutuhan Anda. Bagus dari semua, Anda dapat membayar saat Anda pergi. <a href=':1:'> lebih lanjut</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting for developers. Full shell access to fast servers with all your favorite tools pre-installed and maintained for the user.",
  "hosting_webfaction_2": "Untuk menginstal Phalcon di WebFaction, ikuti petunjuk yang diuraikan di<a href=':1:'>sini </a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Tanyakan pada browser Apa Bahasa terbaik",
  "i18n_3": "Memeriksa apakah kita memiliki file terjemahan untuk bahasa tersebut",
  "i18n_4": "kembali ke beberapa pengaturan standar",
  "i18n_5": "Kembali objek terjemahan",
  "i18n_description": "Menerjemahkan aplikasi Anda ke banyak bahasa dengan mudah",
  "installing_phalcon_php": "Instalasi Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Come join our vibrant developer community!",
  "join_our_community_description": "kontribusi komunitas dalam Extensions, Plugins, Adapter, VM, contoh, kode sumber ... dan lainnya",
  "language_text": "Bahasa Inggris",
  "learn": "Learn",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Ekstensi Zephir/C dijalankan bersama dengan PHP pada saat proses awal daemon web server",
  "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Berkat arsitektur tingkat rendahnya dan optimasi <strong> Phalcon memberikan overhead terendah untuk aplikasi berbasis MVC </ strong>",
  "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "MORE...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM untuk Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "There are :1: robots",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Houston we have a problem!",
  "or": "atau",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Tim Phalcon",
  "phalcon_team_1": "Many more people",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Name",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Resources",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Layanan Tenang",
  "restful_services_1": "Menulis server dan aplikasi REST tidak pernah semudah ini. Tidak ada boilerplate Layanan sederhana akan masuk dalam satu file.",
  "restful_services_2": "Returning data in JSON",
  "roadmap": "Roadmap",
  "router": "Router",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Create the router",
  "router_3": "Define a route",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Contoh Aplikasi",
  "see_for_yourself": "Lihat sendiri...",
  "sharding": "Sharding",
  "sharding_1": "Kaitkan model ke databae berbeda",
  "sharding_2": "Service ini mengembalikan database MySQL",
  "sharding_3": "Service ini mengembalikan database PostgreSQL",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Ada yang salah :(",
  "sponsored_by": "Disponsori oleh",
  "sponsors": "Sponsors",
  "sponsors_and_supporters": "Sponsors and Supporters",
  "sponsors_and_supporters_upper": "SPONSOR DAN PENDUKUNG",
  "sponsors_become_patron": "menjadi seorang Patron!",
  "sponsors_description_1": "Bagi mereka yang ingin mensponsori pekerjaan kami dan mengembangkan Phalcon lebih lanjut, kami menawarkan berbagai pilihan sponsor yang sesuai dengan anggaran. Mensponsori pekerjaan kami memungkinkan kami mencurahkan lebih banyak waktu untuk proyek ini, menawarkan tanggapan lebih cepat terhadap bug dan fitur dan memastikan stabilitas proyek.",
  "sponsors_our_great_sponsors": "Ini adalah sponsor kami! Terima kasih!!",
  "stack_overflow": "Stack Overflow",
  "store": "Toko",
  "support": "Dukungan",
  "support_discord": "Come join the Phalcon <a href=':1:'>Discord</a>",
  "support_documentation_1": "Sebelumnya, silakan gunakan :1:. Anda juga dapat menggunakan fitur pencarian untuk menemukan apa yang Anda cari. Jika pertanyaan Anda masih belum terjawab, ada lebih banyak pilihan di bawah ini.",
  "support_download_page": "halaman download",
  "support_note_1": "Our great community and contributors are happy to help you though! Please use these community resources for obtaining help.",
  "support_note_2": "Many bugs are raised because users are not running the latest version. Please visit the :1:, download the latest available version (or compile it) and confirm if the issue you are experiencing is indeed a bug.",
  "support_phalcon_forum": "Questions should go to <a href=':1:'>Official Forums</a>",
  "support_please_note": "Catatan:",
  "support_please_note_1": "Stack Overflow tidak didedikasikan untuk mendukung Phalcon",
  "support_please_note_2": "Jangan menyampaikan bug baru di sini. Gunakan <a href=':1:'> pelacak isu </a> di Github untuk itu",
  "support_please_note_3": "Jangan mengajukan permintaan fitur disini. Gunakan <a href=':1:'> pelacak isu </a> di Github untuk pengajuan fitur",
  "support_please_note_4": "Pastikan Anda menyertakan tag 'Phalcon' dengan pertanyaan Anda",
  "support_please_note_5": "Pastikan kamu menyebutkan 'Phalcon' di pertanyaan",
  "support_reporting_a_bug": "Laporkan bug",
  "support_reporting_a_bug_0": "If you still believe that what you found is a bug, please <a href=':1:'>open an issue</a>",
  "support_reporting_a_bug_1": "Silakan laporkan bug ketika Anda sudah todas menemukan semua opsi di atas, menggunakan <a href=':1:'> pelacak isu </a> di Github.",
  "support_slack": "There is a less active but still functioning community on <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Another way is to ask a question on <a href=':1:' target='_blank'>Stack Overflow</a> and tag it with <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Our social network accounts are: <a href=':1:'>Gab.ai</a> , <a href=':2:'>Twitter</a>, <a href=':3:'>Facebook</a> and <a href=':4:'>Google+</a>",
  "support_us": "Dukung Kami",
  "team": "Tim",
  "team_andres_1": "Andres is no stranger to open source projects. In the last nine years, he has designed and released frameworks for PHP and has been involved in web development - his main passion.",
  "team_andres_2": "Pemenang TR35, drive utama Andre's adalah selalu memilih dan menerapkan atau menggunakan alat yang tepat untuk pekerjaan itu, kebanyakan berfokus pada kinerja. Oleh karena itu pada tahun 2011 sebuah gagasan baru sedang berjalan; untuk menciptakan kerangka kerja baru bagi pengembang PHP, yang berfokus pada kegunaan, fitur dan sebagian besar kinerja.",
  "team_andres_3": "Melalui pendekatan inovatif baru ini, Phalcon lahir. Kerangka PHP ditulis dalam bahasa C yang dapat menawarkan banyak fitur kepada pengembang sambil memaksimalkan kinerja dan menjaga pemanfaatan sumber daya tetap rendah.",
  "team_andres_4": "Andres adalah salah satu dari pengembang inti dari Phalcon dan inspirasinya.",
  "team_eduar_1": "Eduar adalah pengembang C/PHP dengan beberapa tahun pengalaman dalam pengembangan aplikasi. Dia adalah salah satu pendiri dan pengembang utama dari proyek Phalcon yang dimulai pada tahun 2011.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar suka film fiksi ilmiah dan kadang-kadang bermain sepak bola.",
  "team_nikolay_1": "Nikolay sudah membangun aplikasi web lebih dari 10 tahun. Dia terlibat di pembuatan situs dan desain yang berkinerja tinggi dan rumit. ",
  "team_nikolay_2": "Nikolay has been working with Open Source projects for a long time, utilizing them whenever requirements allow. He thus started using his personal time to give back to the community, by forking projects, offering architectural changes and suggestions, as well as performance ones. He has been instrumental in improving Open Source CMS projects receiving positive feedback from the community.",
  "team_nikolay_3": "His continuous involvement with open source projects has helped him advance his technical knowledge while abiding by the give back to the community mentality.",
  "team_nikolay_4": "Nikolay is an avid supporter of maximizing performance in web applications. After his introduction to Phalcon, he decided to pursue and use the project and become an Evangelist for it. He is leading the effort toward the Russian community and offers resources for Russian speaking developers.",
  "team_nikolay_5": "Kontribusinya meliputi: Sebuah mirror dari situs utama di Rusia (<a href=':1:'> http://www.phalcon.ru </a>), mirror dari repositori dokumentasi di Rusia (<a href = ': 2:'> http://docs.phalconphp.ru </a>), perubahan yang sedang berlangsung dan koreksi dokumentasi dalam bahasa Inggris, sebuah group dalam jaringan sosial Vkontakte (<a href=':3:'> https://vk.com/phalconphp </a>).",
  "team_nikos_1": "Nikos telah berada di industri IT selama lebih dari 20 tahun. Dia diperkenalkan ke dunia PHP pada tahun 2000 dan telah menggunakannya sejak saat itu untuk proyek pribadi dan juga proyek untuk pemberi kerja.",
  "team_nikos_2": "He loves discovering new technologies and ways to integrate them with existing applications and thus reap the benefits they offer.",
  "team_nikos_3": "He is an avid supporter of Test Driven Development (TDD) and always tries to get full coverage in his code.",
  "team_nikos_4": "Nikos' continuing interest in new and innovative technologies breaking out of the norm introduced him to Phalcon. He joined the core team and his tasks mainly involve coordination of NFRs and bug fixes, help with tests, documentation and the incubator. Nikos is also responsible for maintaining the Windows DLLs for the project and offers support whenever possible.",
  "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
  "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
  "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
  "team_serghei_1": "Serghei telah bekerja sebagai pengembang  Ruby/PHP selama lebih dari 8 tahun dan telah mengkhususkan diri dalam pengembangan aplikasi web. Sebagai pendukung dan penganjur Perilaku Driven Development (BDD) juga merupakan anggota dari tim<a href=':1:'> Codeception </a>.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Template Engine (Volt)",
  "template_engine_volt_1": "Volt adalah bahasa template ultra-cepat dan ramah untuk desainer yang ditulis dalam Zephir /C untuk PHP. Ini memberikan Anda satu set bantuan untuk membuat tampilan dengan cara yang mudah. Volt sangat terintegrasi dengan komponen lain dari Phalcon, dan Anda dapat menggunakannya sebagai komponen yang berdiri sendiri dalam aplikasi Anda.",
  "template_engine_volt_description": "Sebuah template engine terinspirasi oleh Jinja tapi dibangun dari C untuk PHP",
  "template_engines": "Template Engines",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Views represent the user interface of your application",
  "testimonials": "Testimonials",
  "testimonials_1": "Salam, Tim Phalcon! Aku punya sebuah proyek, dibangun di atas kerangka Phalcon. Ini adalah Guitarama (<a href=':1:'>: 2: </a>) - gitar tab dan katalog chords. Situs ini ditujukan untuk penonton Rusia, dan menggunakan bahasa Rusia, tapi saya berharap, tidak akan ada masalah untuk memahami sebagian besar halaman. Situs ini diluncurkan ulang dengan platform baru sejak awal Januari 2013 dan telah menunjukan pertumbuman yang stabil. Kunjungan harian: ~ 1500 pengunjung unik, ~ 5000 halaman. Situs ini berjalan pada server lama 1хP4-3Ghz , 4GB RAM. Sekali lagi, terima kasih untuk Framework besar dan semua yang telah anda lakukan:) Michael.",
  "testimonials_2": "Halo, tim Phalcon. Saya ingin berbagi dengan Anda kisah sukses kami menggunakan Phalcon di proyek <a href=':1:'>: 2: </a> dan <a href=':3:'>: 4:</a> , situs yang paling banyak dikunjungi dan highloaded di Kazakhstan, peringkat TOP-10 dalam situs CIS. Kedua situs bekerja pada satu RESTfull API yang dibangun dengan Phalcon\\Mvc\\Micro. Pada beban puncak API memproses sesuatu seperti 400 req / detik dan ini bukan batasan. Pindah ke Phalcon memungkinkan kami untuk mengurangi waktu respon dan konsumsi CPU dan RAM, serta untuk mengurangi waktu proses pembuatan. Kami akan terus menggunakan Phalcon dalam proyek-proyek baru. Terima kasih untuk pekerjaan besar yang Anda lakukan! Salam, Nikita Vershinin, Timbal Developer, Kolesa.kz dan krisha.kz",
  "testimonials_3": "Phalcon Team, The framework you guys have created is amazing. I've never used a framework that has combined speed, efficiency, brevity, and naturality all in one package. I intend on championing and contributing back to the project in any way that I can. I embarked recently on an ~800 hour project and am happy to say that we are using Phalcon Framework. Bravo. Brian Seymour",
  "testimonials_4": "Hi guys, aku hanya menggunakan Phalcon dan itu sangat menarik! Aku hanya ingin mengatakan kepada Anda bahwa phalcon itu sannat menarik! Jadi, terima kasih untuk Framework ini dan terus bekerja dengan baik! Ivan Penchev",
  "testimonials_5": "Hi Guys, saya menulis url-shortener service dental phalcon. Yang sangat mengagumkan <a href=':1:'>: 2: </a>. Demo di sini: <a href=':3:'>: 4: </a>) Murat Küçükosman",
  "testimonials_6": "Hello Phalcon Team, saya membuat sebuah proyek kecil yang dirancang untuk pengguna Polandia menggunakan Framework Anda. Saya harus mengakui bahwa kinerja yang luar biasa, selamat pekerjaan yang baik. Layanan untuk memvalidasi isi dari halaman web dalam bahasa Polandia <a href=':1:'>: 2: </a>",
  "testimonials_7": "Hai kawan! Hanya ingin berbagi dengan Anda rilis terbaru dari proyek lama kami - <a href=':1:'>: 2: </a>. Beralih ke Phalcon memungkinkan kita untuk membagi beban server dibandingkan dengan kerangka framework, yang sangat hebat!",
  "testimonials_description": "Di bawah ini adalah kumpulan testimonial dan kisah sukses, dari Anda, para pengembang dan pengguna Phalcon PHP. Kami selalu menyambut email anda dengan kisah sukses dan posting mereka di blog kita. Jika Anda ingin mengirimkan kisah sukses Anda atau berhubungan dengan kami, jangan ragu untuk mengirim mail kapad kami di <a href='mailto: :1:'>: 2: </a>.",
  "toggle_navigation": "Navigasi beralih",
  "transactions": "Transaksi",
  "transactions_1": "Ketika proses melakukan operasi banyak  database, ini mungkin sangat penting ketika setiap langkah telah berhasil diselesaikan sehingga integritas data dapat dipertahankan. Transaksi menawarkan kemampuan untuk memastikan bahwa semua operasi database telah berhasil dieksekusi sebelum data disimpan dalam database.",
  "transactions_2": "membuat transaction manager",
  "transactions_3": "Meminta sebuah transaksi",
  "transactions_4": "Cari robot yang akan dihapus",
  "transactions_5": "Sesuatu yang tidak beres, kita harus rollback transaksi",
  "transactions_6": "Semuanya sudah baik-baik saja, mari kita melakukan transaksi",
  "transactions_7": "Robot berhasil dihapus!",
  "transactions_8": "Gagal, alasan:",
  "transactions_description": "Transaksi di Phalcon memungkinkan untuk menjaga integritas data tetap aman.",
  "try_phalcon": "Coba Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Menonton video demo",
  "zephir": "Zephir"
}