{
  "about": "About",
  "about_blog": "BLOG",
  "about_blog_1": "Jika kamu suka menulis, ingat bahwa <a href=':1:'>blog kami</a> terbuka untuk memposting tutorial yang kamu buat. Jika kamu punya sebuah blog milik kamu sendiri dan punya sebuah tulisan mengenai phalcon, kami juga dapat terbitkan dalam halaman jaringan sosial kami sehingga mencapai visibilitas maksimum. Jika posting blog kamu dalam bahasa lain selain bahasa Inggris, kami bakal membagikannya dan mungkin bakal di terjemahkan jika memungkinkan. Jika kamu tahu tentang blog yang terkait dengan PHP lalu tertarik dalam menyajikan konten untuk pembaca silakan beritahu kami.",
  "about_description_1": "Projek luar biasa butuh tangan yang luar biasa. Kami mungkin tidak tahu kamu atau mungkin belum, tapi kami pikir bahwa kamu sangat cocok untuk membangun web yang lebih baik. Bersama-sama, kami siap untuk mengubah dunia! Disinilah phalcon, kami membangun sebuah framework PHP generasi baru; Kami ingin memberikan performa yang luar biasa sambil membantu kamu mengembangkan dengan cara yang mudah dan menyenangkan.",
  "about_description_2": "Kami berharap kamu menikmati phalcon sama seperti kami. Kami selalu menanti untuk bekerjasama dan dan membantu! <strong>Kamu tidak perlu menjadi pengembang C untuk membantu phalcon!</strong> Ada banyak tempat lain untuk kamu bisa berkontribusi:",
  "about_documentation": "DOKUMENTASI",
  "about_documentation_1": "Repositori dari situs ini tersedia di <a href=':1:'>github</a><br />. Kami menggunakan repositori itu sebagai sumber dokumentasi kami untuk bahasa Inggris saja!.<br /><br />Kami selalu menghargai koreksi, penambahan dan penyempurnaan dalam dokumentasi kami, jadi yang harus Anda lakukan adalah mengkloning repositori dan penerbitan permintaan tarik!<br /><br />Jika Anda dapat membantu pengembang yang tidak berbahasa Inggris dengan menerjemahkan beberapa konten ke bahasa lain, itu akan menjadi hebat! Kami menggunakan <a href=':2:'>:3:</a> untuk terjemahan kami, dan Anda dapat menemukan proyek kami <a href=':4:'>disini</a>",
  "about_donations_sponsoring": "DONATUR / SPONSOR",
  "about_evangelism": "PENGINJILAN",
  "about_evangelism_1": "Banyak orang mash belum tahu keberadaan phalcon, atau apakah phalcon benar-benar dalat bekerja. Kami yakin banyak pengembang akan medapatkan keuntungan setelah mengetahui apa itu phalcon dan bagaimana phalcon itu dalat membantu mereka. Jika anda mengetahui salah satu event/meeting dan anda ingin membutuhkan pembicara tentans proyek, anda akan mendapatkan dukungan penuh dari kami. Siapa yang tidak ingin tahu tentang alat yang merevolusi pengembangan PHP?",
  "about_facebook_page": "Halaman Facebook",
  "about_flying_with_phalcon": "Terima kasih untuk phalcon! &lt;3",
  "about_follow_on_gab": "Ikuti kami di Gab",
  "about_follow_on_twitter": "Ikuti kami di Twitter",
  "about_official_blog": "Blog resmi",
  "about_sample_applications": "APLIKASI SEDERHANA",
  "about_sample_apps_1": "Contoh yang besar membantu orang lain untuk lebih memahami bagaimana hal-hal besar dapat dibuat dengan Phalcon. Jangan ragu untuk berbagi repositori untuk memberi contoh aplikasi yang membantu orang lain dengal pekerjaan mereka dan mengijinkan mereka untuk memberikan umpan balik tentang pekerjaan anda juga.",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "We all love screencasts. If you have some extra time and want to support the community with some nice videos teaching any of the framework's features, it's very welcome. Check out our <a href=':1:'>Vimeo Channel</a> as a guide.",
  "about_share_experiences_1": "Don't be shy, feel free to share the ways through which Phalcon was useful to you with the community. If Phalcon is a success case for you, let us share that with the community. Also, discuss what components needed extra work, what you could do easier, what benefits you got by using Phalcon. Although not everything can be implemented immediately, your input on new feature requests can greatly help us shape the future of the project. Your feedback helps us all.",
  "about_share_your_experiences": "SHARE YOUR EXPERIENCES",
  "about_social_networks": "SOCIAL NETWORKS",
  "about_social_networks_1": "Phalcon is evolving on a daily basis, through our desire to make it better. Social networks are part of our lives now, and we all interact with others through them. Sharing your Phalcon experience with your social circles will greatly increase the visibility of the project. More and more people will engage in our community, thus making it more powerful, even more feature rich and popular. Like, '+1', share posts that we constantly post on every social network, engage in discussions regarding those posts. People who discover Phalcon through your interactions will thank you!",
  "about_social_networks_2": "We have a presence in most of the popular social networks. By following us, you are helping us increase the project's visibility: ",
  "about_sponsoring_1": "We're a tiny but effective core team of developers working our tails off. We try to spend as much time as possible on the project. All our passion for this project makes us want to be better every day. Phalcon is open-sourced software and volunteer efforts are needed for its constant evolution. You can help us keep the development active by donating to the project or sponsoring the development. More time and resources dedicated to the project means more activity, more improvement, better support, more amazing features, etc.",
  "about_star_on_github": "Star the project on Github",
  "about_tests": "TESTS",
  "about_tests_1": "No software is free of bugs. If you find any, please do not hesitate to tell us. We have a test suite with more than <a href=':1:'>16,000</a> tests. However, unit-tests are never enough. Help us improve our test suite by adding more tests or improve the current ones. Every added test makes the framework more stable.",
  "about_thank_you": "THANK YOU!",
  "about_thank_you_1": "We would like to thank all of our contributors and members of the community for pushing us to make Phalcon the best framework of its kind. Your kind words and engagement is what drives us to do better. We hope to meet and exceed the trust you put in Phalcon.",
  "about_translations": "TRANSLATIONS",
  "about_translations_1": "We are trying to reach as many developers as possible, breaking down the language barriers. We are using <a href=':1:'>:2:</a>, to handle all the words or sentences that need to be translated for this site. The project repository is located <a href=':3:'>here</a>.",
  "acl": "ACL",
  "acl_1": "This is how you can built the access control list (ACL):",
  "acl_2": "Create the ACL",
  "acl_3": "The default action is DENY access",
  "acl_4": "Register two roles, Users is registered users",
  "acl_5": "and guests are users without a defined identity",
  "acl_description": "Access Control List allows users to access the modules they're authorized to",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Register namespaces, prefixes, directories or classes. Take advantage of the autoloader events and maintain full control over what files are loaded and from where.",
  "auto_loader_2": "Creates the autoloader",
  "auto_loader_3": "Register some namespaces",
  "auto_loader_4": "Register autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.",
  "basic_features": "Basic Features",
  "blog": "Blog",
  "built_with_phalcon": "Built with Phalcon",
  "cache": "Cache",
  "cache_1": "The cache component allows faster access to frequently used or already processed data. It supports many backends such as Redis, Memcached, Mongo, Files, Apc and more",
  "cache_2": "Set the models cache service",
  "cache_3": "Cache data for one day by default",
  "cache_4": "Memcached connection settings",
  "cache_description": "Improve your performance with many of the backend caches that Phalcon provides",
  "community": "Community",
  "consulting": "Consulting",
  "consulting_header": "We have partnered with LEZGRO, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "LEZGRO congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve LEZGRO to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Contact LEZGRO through our <a href=':1:'>website</a>, where you can also see samples and testimonials of our work.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Contact us through our <a href=':1:'>website</a>, where you can take a look at the projects we have been involved in.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Contribute",
  "contributors": "Phalcon contributors",
  "contributors_description": "Phalcon is improved everyday by our amazing community",
  "crypt": "Crypt",
  "crypt_description": "Encrypt/Decrypt important data to keep them safe from unauthorized third-parties",
  "data_and_storage": "Data & storage",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon is built upon a powerful yet easy to understand and use pattern called Dependency Injection. Initialize or define services once - and use them virtually anywhere throughout the application.",
  "dependency_injection_2": "Create the Dependency Injector Container",
  "dependency_injection_3": "Register classes, functions, components",
  "dependency_injection_4": "Use anywhere else in code",
  "dependency_injection_description": "Dependency Injection and Location of services and it's itself a container for them.",
  "discord": "Discord",
  "docs": "Docs",
  "documentation": "Documentation",
  "donate": "Donate",
  "download": "Download",
  "download_arch": "Arch Linux",
  "download_arch_1": "There is a PKGBUILD for ArchLinux, available <a href=':1:'>here</a>",
  "download_box_1": "Box #1",
  "download_box_2": "Box #2",
  "download_box_doc_root": "Document Root: :1: ",
  "download_box_user_pass": "MySQL User: :1:  Password: :2: ",
  "download_compilation": "Compilation",
  "download_compilation_1": "On Linux you can easily compile and install the extension from source code.",
  "download_compilation_11": "1. To create the extension from C source follow these steps: ",
  "download_compilation_12": "2. Add the extension to your php.ini: ",
  "download_compilation_13": "3. Finally, restart the webserver",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "After requests from the community, the cPanel developers released a custom module that allows for installation of Phalcon in cPanel hosted sites. Information can be found <a href=':1:'>here</a>. The module is maintained in <a href=':2:'>Github</a>.",
  "download_dependencies": "Dependencies",
  "download_dependencies_1": "Although Phalcon does not binary link to other extensions it does use some of them to offer functionality. The extensions used are: ",
  "download_dependencies_2": "It is not necessary for all the above extensions to be present in the system that has Phalcon installed. You can only install the ones that meet your needs. For instance if you use a MySQL database, then you can only load PDO and PDO/MySQL ignoring the Oracle, SQlite, Postgresql and Mongo.",
  "download_developer_tools": "Developer Tools",
  "download_devtools_1": "These tools are a collection of useful scripts to generate skeleton code. Core components of your application can be generated with a simple command, allowing you to easily develop applications using Phalcon.",
  "download_devtools_composer": "Installing via Composer",
  "download_devtools_composer_1": "Install composer in a common location or in your project: ",
  "download_devtools_composer_2": "Create the composer.json file as follows: ",
  "download_devtools_composer_3": "Run the composer installer: ",
  "download_devtools_composer_4": "Create a symbolic link to the phalcon.php script: ",
  "download_devtools_docs": "Documentation:  <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "You can download or clone a cross platform package containing the developer tools from <a href=':1:'>Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "There are many ways that you can use Phalcon with Docker.",
  "download_docker_2": "Our official images are located <a href=':1:'>here</a>. We always welcome pull requests and improvements. The repository for the docker files is located here:",
  "download_docker_3": "With Phalcon-compose you can create an isolated environment with docker, that will allow you to use Phalcon without any additional installations. Note that using Phalcon Compose, requires ",
  "download_docker_4": "and",
  "download_docker_5": "Services",
  "download_docker_6": "Phalcon Compose offers the following services by default:",
  "download_docker_7": "Phalcon Compose is very easy to use. Assume that you need to create an application that will be located in: ",
  "download_docker_8": "We will now need to run the following command for our container application can be created:",
  "download_docker_9": "The above command will download the skeleton of the docker environment.",
  "download_docker_10": "Variables",
  "download_docker_11": "You will need to create a new file called",
  "download_docker_12": "in",
  "download_docker_13": "A sample file has been provided called",
  "download_docker_14": "Adjust the variables in that file to suit your needs. The most important variable is the",
  "download_docker_15": "Change the name to something you will be able to use. In our case we just leave the default called ",
  "download_docker_16": "Open your hosts file (<code>/etc/hosts</code>) and enter a new line like this:",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Build",
  "download_docker_19": "You can now build the environment.",
  "download_docker_20": "Containers will be downloaded as needed and set up on your environment.",
  "download_docker_21": "Launch",
  "download_docker_22": "You can now launch the environment:",
  "download_docker_23": "Go to :1: in your browser and you will see your environment is set up. You can now develop your application in the app folder.",
  "download_docker_24": "Shutdown",
  "download_docker_25": "To shut down the environment when is no longer needed you can issue the following command:",
  "download_docker_26": "Additional information can be found at: ",
  "download_examples": "Pre-Installed examples",
  "download_examples_1": "The following examples are pre-installed on each vagrant box: ",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "A port is available for FreeBSD. You only need these few commands to install it: ",
  "download_ide_stubs": "IDE stubs",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Need help?",
  "download_need_help_1": "Have a look at our <a href=':1:'>support page</a> for ways to get support. We will do our best to help you.",
  "download_note": "Phalcon is a C extension, so you need to download a binary for your platform or compile it from source code.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "There is a package available <a href=':1:'>here</a> (thanks to <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Requirements",
  "download_requirements_1": "We need some packages previously installed: ",
  "download_requirements_2": "PHP 5.x development resources",
  "download_requirements_3": "GCC compiler",
  "download_source_code": "Source Code:  <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Source Code (please switch to the relevant branch): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps: ",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command: ",
  "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
  "download_ubuntu_or_debian": "Ubuntu or Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> is an excellent tool to create and configure lightweight, reproducible, and portable development environments.",
  "download_vagrant_2": "Use any of the following boxes to test or develop with Phalcon on a pre-configured environment.",
  "download_vagrant_boxes": "Vagrant Boxes",
  "download_windows": "Windows DLLs",
  "download_windows_download": "Download",
  "download_windows_dlls": "Windows DLLs can be downloaded from our Github release page <a href=':1:'>here</a>",
  "download_windows_guides": "Related Guides",
  "download_windows_guides_wamp": "Installation on WAMP",
  "download_windows_guides_xampp": "Installation on XAMPP",
  "download_windows_installation": "Installation",
  "download_windows_installation_1": "To use phalcon on Windows you can download a DLL library. Edit your php.ini, append at the end, and restart your webserver to load the extension. <a href=':1:'>More</a>.",
  "download_windows_note": "We highly recommend you use the latest version of PHP corresponding to our DLLs, so as to take advantage of the full feature set of Phalcon.",
  "download_windows_older": "Older versions",
  "download_windows_stable": "Stable/Master versions",
  "encryption": "Encryption",
  "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
  "encryption_2": "This is a secret key (32 bytes).",
  "encryption_3": "This is the text that you want to encrypt.",
  "events": "Events",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Events Management",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Create an events manager",
  "events_management_3": "Listen for events produced in the dispatcher using the Security plugin",
  "events_management_4": "Handle exceptions and not-found exceptions using NotFoundPlugin",
  "events_management_5": "Assign the events manager to the dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Flash messages",
  "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
  "flash_messages_2": "there were errors in this form",
  "flash_messages_3": "yes!, everything went very smoothly",
  "flash_messages_4": "this is a notice for users",
  "flash_messages_5": "this is just a warning",
  "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
  "forms_builder": "Forms Builder",
  "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
  "forms_builder_2": "Home",
  "forms_builder_3": "Cellphone",
  "forms_builder_description": "Easily create HTML forms",
  "forum": "Forum",
  "gab": "Gab.ai",
  "get_phalcon": "Dapatkan Phalcon :1:",
  "github": "Github",
  "header_slogan": "arsitektur yang inovatif membuat Phalcon menjadi framework PHP tercepat yang pernah dibangun!",
  "header_tagline": "Sebuah full-stack PHP framework dibuat sebagai ektensi-C",
  "high_performance_php_framework": "PHP Framework berkinerja tinggi",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud delivers scalable, pay-as-you-go compute capacity in the cloud.",
  "hosting_amazon_ec2_2": "Select a pre-configured, templated Amazon Machine Image (AMI) to get up and running immediately. Or create an AMI containing your applications, libraries, data, and associated configuration settings. <a href=':1:'>See more</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Linux cPanel and Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows and Linux cPanel shared web hosting packages and plans, no configuration or installation required! ASPnix offers a variety of PHP versions from 5.2 - 7.2 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "The <a href=':1:'>Windows Azure cloud</a> provides you with highly scalable and manageable Windows hosting for your web apps. Use Phalcon to reduce your instance costs.",
  "hosting_azure_2": "To install Phalcon, follow the step by step procedure in <a href=':1:'>this SitePoint article</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services: ",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
  "hosting_digital_ocean_2": "Follow this <a href=':1:'>tutorial</a> to get started",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host offers multiple affordable and high quality hosting plans.",
  "hosting_dcthost_2": "By default, they have Phalcon installed on all their shared hosting packages.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit offers many hosting plans (there is one for developers and is free - with some limitations) that would satisfy the needs of most of the developers that wish to either try Phalcon or deploy their applications using it.",
  "hosting_fortrabbit_2": "They offer a variety of <a href=':1:'>extensions</a> that would satisfy even the most demanding project.",
  "hosting_fortrabbit_3": "Stable versions of Phalcon are pre-installed, you can activate them from the administration dashboard.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Install Phalcon using the standard instructions of installation.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "Next generation, auto-sizing PaaS for Java, PHP, Ruby, Python, and Node.js apps. Fully isolated self-scaling role-based containers for each customer, including choice of Apache or Nginx, and full range of SQL and NoSQL servers. Pay for resource usage, not server instance size. SSD-powered. UK hosted.",
  "hosting_layershift_2": "Follow this <a href=':1:'>tutorial</a> to get started",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting for developers. Full shell access to fast servers with all your favorite tools pre-installed and maintained for the user.",
  "hosting_webfaction_2": "To install Phalcon in WebFaction, follow the instructions outlined <a href=':1:'>here</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Ask browser what is the best language",
  "i18n_3": "Check if we have a translation file for that lang",
  "i18n_4": "Fallback to some default",
  "i18n_5": "Return a translation object",
  "i18n_description": "Translate your applications to many languages easily",
  "installing_phalcon_php": "Installing Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Come join our vibrant developer community!",
  "join_our_community_description": "Community contributions in Extensions, Plugins, Adapters, VM, examples, source code... and more",
  "language_text": "English",
  "learn": "Learn",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
  "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
  "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "MORE...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM for MongoDB",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "There are :1: robots",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Houston we have a problem!",
  "or": "or",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Phalcon Team",
  "phalcon_team_1": "Many more people",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Name",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Resources",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Restful Services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Returning data in JSON",
  "roadmap": "Roadmap",
  "router": "Router",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Create the router",
  "router_3": "Define a route",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Sample applications",
  "see_for_yourself": "See for yourself...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Something went wrong :(",
  "sponsored_by": "Sponsored by",
  "sponsors": "Sponsors",
  "sponsors_and_supporters": "Sponsors and Supporters",
  "sponsors_and_supporters_upper": "SPONSORS AND SUPPORTERS",
  "sponsors_become_patron": "Become a Patron!",
  "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
  "stack_overflow": "Stack Overflow",
  "store": "Toko",
  "support": "Dukungan",
  "support_discord": "Bergabunglah dengan Phalcon <a href=':1:'>Discord</a>",
  "support_documentation_1": "Gunakan :1: sebelum hal lain. Anda juga dapat menggunakan fitur pencarian di dokumen kami untuk menemukan apa yang Anda cari. Jika pertanyaan Anda masih tidak menjawab, ada lebih banyak pilihan di bawah ini.",
  "support_download_page": "halaman download",
  "support_note_1": "Komunitas dan kontributor kami yang hebat dengan senang hati membantu Anda! Gunakan sumber daya komunitas ini untuk mendapatkan bantuan.",
  "support_note_2": "Banyak bug dinaikkan karena pengguna tidak menjalankan versi terbaru. Silahkan kunjungi:1:, download versi terbaru yang tersedia (atau kompilasi) dan konfirmasikan apakah masalah yang Anda alami memang bug.",
  "support_phalcon_forum": "Pertanyaan harus pergi ke <a href=':1:'> Forum resmi</a>",
  "support_please_note": "Tolong dicatat: ",
  "support_please_note_1": "Stack Overflow tidak ditujukan untuk mendukung Phalcon",
  "support_please_note_2": "Jangan mengajukan permintaan fitur disini. Gunakan <a href=':1:'> pelacak isu </a> di Github untuk pengajuan fitur",
  "support_please_note_3": "Jangan mengajukan permintaan fitur disini. Gunakan <a href=':1:'> pelacak isu </a> di Github untuk pengajuan fitur",
  "support_please_note_4": "Pastikan Anda menyertakan tag 'Phalcon' dengan pertanyaan Anda",
  "support_please_note_5": "Pastikan kamu menyebutkan 'Phalcon' di pertanyaan",
  "support_reporting_a_bug": "Laporkan bug",
  "support_reporting_a_bug_0": "Jika Anda masih percaya bahwa apa yang Anda temukan adalah bug, silahkan <a href=':1:'> buka masalah</a>",
  "support_reporting_a_bug_1": "Laporkan bug ketika Anda telah kehabisan semua opsi di atas, menggunakan <a href=':1:'> pelacak isu</a> di Github.",
  "support_slack": "Ada komunitas yang kurang aktif tapi masih berfungsi pada <a href=':1:'> kendur</a>",
  "support_stack_overflow": "Cara lain adalah dengan mengajukan pertanyaan pada <a href=':1:' target='_blank'> Stack Overflow</a> dan tag dengan <a href=':2:'> <code>phalcon</code></a>",
  "support_social_network_accounts": "Account jaringan sosial kami: <a href=':1:'> Gab.ai</a>, <a href=':2:'> Twitter</a> dan <a href=':3:'> Facebook</a>",
  "support_us": "Dukung kami",
  "team": "Tim",
  "team_andres_1": "Andres tidak asing dengan proyek open source. Dalam sembilan tahun terakhir, dia telah merancang dan merilis kerangka kerja untuk PHP dan telah terlibat dalam pengembangan web - gairah utamanya.",
  "team_andres_2": "Pemenang TR35, drive utama Andre's adalah selalu memilih dan menerapkan atau menggunakan alat yang tepat untuk pekerjaan itu, kebanyakan berfokus pada kinerja. Oleh karena itu pada tahun 2011 sebuah gagasan baru sedang berjalan; untuk menciptakan kerangka kerja baru bagi pengembang PHP, yang berfokus pada kegunaan, fitur dan sebagian besar kinerja.",
  "team_andres_3": "Melalui pendekatan inovatif baru ini Phalcon lahir. Kerangka PHP ditulis dalam C yang dapat menawarkan banyak fitur untuk pengembang sambil memaksimalkan kinerja dan menjaga pemanfaatan sumber daya rendah.",
  "team_andres_4": "Andres adalah salah satu pengembang inti Phalcon dan inspirasi.",
  "team_eduar_1": "Eduar adalah C/PHP pengembang dengan beberapa tahun pengalaman dalam pengembangan aplikasi. Dia adalah salah satu pendiri dan memimpin pengembang proyek Phalcon yang dimulai pada 2011.",
  "team_eduar_2": "Dia telah mengambil bagian di semua bidang, mulai dari desain kerangka hingga fungsi inti internal, termasuk alat dokumentasi dan pengembang. Dia didorong oleh daya tarik dengan kerangka kerja, bahasa dan teknologi baru.",
  "team_eduar_3": "Eduar suka film fiksi ilmu pengetahuan dan kadang-kadang bermain sepak bola.",
  "team_nikolay_1": "Nikolay sudah membangun aplikasi web lebih dari 10 tahun. Dia terlibat di pembuatan situs dan desain yang berkinerja tinggi dan rumit. ",
  "team_nikolay_2": "Nikolay telah bekerja dengan proyek Open Source untuk waktu yang lama, memanfaatkannya kapan pun persyaratan memungkinkan. Dengan demikian dia mulai menggunakan waktu pribadinya untuk memberikan kembali kepada masyarakat, dengan melakukan proyek forking, menawarkan perubahan dan saran arsitektural, serta kinerja. Dia telah berperan dalam memperbaiki proyek CMS Open Source yang mendapat umpan balik positif dari masyarakat.",
  "team_nikolay_3": "Keterlibatannya yang terus menerus dengan proyek open source telah membantunya memajukan pengetahuan teknisnya sambil tetap memberikan kembali mentalitas masyarakat.",
  "team_nikolay_4": "Nikolay adalah pendukung setia untuk memaksimalkan kinerja aplikasi web. Setelah diperkenalkan ke Phalcon, dia memutuskan untuk mengejar dan menggunakan proyek tersebut dan menjadi seorang penginjil untuk itu. Dia memimpin usaha menuju komunitas rusia dan menawarkan sumber daya untuk pengembang berbahasa rusia.",
  "team_nikolay_5": "Kontribusinya meliputi: Sebuah mirror dari situs utama di Rusia (<a href=':1:'> http://www.phalcon.ru </a>), mirror dari repositori dokumentasi di Rusia (<a href = ': 2:'> http://docs.phalconphp.ru </a>), perubahan yang sedang berlangsung dan koreksi dokumentasi dalam bahasa Inggris, sebuah group dalam jaringan sosial Vkontakte (<a href=':3:'> https://vk.com/phalconphp </a>).",
  "team_nikos_1": "Nikos telah berada di industri IT selama lebih dari 20 tahun. Dia diperkenalkan ke dunia PHP pada tahun 2000 dan telah menggunakannya sejak saat itu untuk proyek pribadi dan juga proyek untuk pemberi kerja.",
  "team_nikos_2": "Dia mencintai menemukan teknologi baru dan cara untuk mengintegrasikan mereka dengan aplikasi yang ada dan dengan demikian menuai manfaat yang mereka tawarkan.",
  "team_nikos_3": "Dia adalah pendukung setia Test Driven Development (TDD) dan selalu berusaha untuk mendapatkan liputan penuh dalam kodenya.",
  "team_nikos_4": "Nikos' terus minat dalam teknologi baru dan inovatif yang melanggar keluar dari norma memperkenalkannya kepada Phalcon. Ia bergabung dengan tim inti dan tugasnya terutama melibatkan koordinasi NFRs dan perbaikan bug, dan membantu dengan pengujian, dokumentasi dan inkubator. Nikos juga bertanggung jawab untuk menjaga dll-nya Windows untuk proyek dan menawarkan dukungan bila memungkinkan.",
  "team_paul_1": "Paulus menganggap dirinya sangat beruntung telah menghabiskan dekade terakhir hidupnya menulis perangkat lunak dengan bantuan kerangka kerja open source dan alat-alat seperti Phalcon. Akibatnya, ia menghabiskan jam off kerja nya berusaha meningkatkan FOSS alat dan kehidupan para pengembang lain seperti dirinya. Ia memiliki yang kuat memerlukan kode sederhana dan jelas UX, dengan Phalcon ia berfokus pada dokumentasi, baru pengalaman pengguna, kontributor hubungan, dan penjangkauan masyarakat.",
  "team_paul_2": "Paul baru baru ini memulai perusahaannya sendiri untuk mengikuti hasratnya membangun perangkat lunak intuitif dengan teknologi baru seperti, ReactJS, Webpack, Ruby, dan Elixir (Erlang). Dia sekarang dengan bangga menambahkan Zephir dan Phalcon ke daftar yang terus berkembang dan dengan senang hati berperan sebagai pemandu sorak, menganjurkan fitur inovatif mereka.",
  "team_paul_3": "Pada kesempatan dia tidak coding, Paulus berikut istrinya jejak dan mengembangkan minatnya dalam videografi dan produksi video. Ia beroperasi pendidikan YouTube saluran saat ini berfokus pada Phalcon dan sesuai kebutuhan sebagai ilmu komputer dosen.",
  "team_serghei_1": "Serghei telah bekerja sebagai pengembang  Ruby/PHP selama lebih dari 8 tahun dan telah mengkhususkan diri dalam pengembangan aplikasi web. Sebagai pendukung dan penganjur Perilaku Driven Development (BDD) juga merupakan anggota dari tim<a href=':1:'> Codeception </a>.",
  "team_serghei_2": "Serghei dapat ditemukan leher mendalam dalam teknologi inovatif yang diperkenalkan dia di phalcon. Dia bertanggung jawab untuk koordinasi perbaikan bug, pengujian, alat pengembang, inkubator dan dukungan lain phalcon proyek terkait.",
  "team_serghei_3": "Ketika dia tidak bekerja, Serghei menikmati menonton film dokumenter, fiksi ilmiah film dan kadang-kadang memainkan mahjong atau pergi.",
  "team_volodymyr_1": "Volodymyr telah mengembangkan server dan aplikasi web selama lebih dari 20 tahun. Ia telah terlibat dalam merancang dan menulis sangat kompleks dan kinerja tinggi aplikasi perangkat lunak. Volodymyr gairah untuk menulis cepat, kuat dan dioptimalkan perangkat lunak diperkenalkan dia untuk phalcon dan ia bergabung dengan tim pengembangan.",
  "team_volodymyr_2": "Di waktu luang Volodymyr menikmati perusahaan dari istri tercinta, memberikan kontribusi untuk proyek open source, dan studi bahasa asing.",
  "template_engine_volt": "template mesin (volt)",
  "template_engine_volt_1": "Volt adalah bahasa template ultra-cepat dan ramah untuk desainer yang ditulis dalam Zephir /C untuk PHP. Ini memberikan Anda satu set bantuan untuk membuat tampilan dengan cara yang mudah. Volt sangat terintegrasi dengan komponen lain dari Phalcon, dan Anda dapat menggunakannya sebagai komponen yang berdiri sendiri dalam aplikasi Anda.",
  "template_engine_volt_description": "Sebuah template engine terinspirasi oleh Jinja tapi dibangun dari C untuk PHP",
  "template_engines": "Mesin Saya Template",
  "template_engines_1": "Pandangan mewakili antarmuka pengguna aplikasi anda. Pandangan sering file HTML dengan tertanam kode PHP yang melakukan tugas terkait semata mata untuk penyajian data. Pandangan menangani pekerjaan menyediakan data dengan menggunakan browser atau alat yang digunakan untuk membuat permintaan dari aplikasi anda.",
  "template_engines_description": "Pandangan mewakili antarmuka pengguna aplikasi anda",
  "testimonials": "Kesaksian",
  "testimonials_1": "Salam, Tim Phalcon! Aku punya sebuah proyek, dibangun di atas kerangka Phalcon. Ini adalah Guitarama (<a href=':1:'>: 2: </a>) - gitar tab dan katalog chords. Situs ini ditujukan untuk penonton Rusia, dan menggunakan bahasa Rusia, tapi saya berharap, tidak akan ada masalah untuk memahami sebagian besar halaman. Situs ini diluncurkan ulang dengan platform baru sejak awal Januari 2013 dan telah menunjukan pertumbuman yang stabil. Kunjungan harian: ~ 1500 pengunjung unik, ~ 5000 halaman. Situs ini berjalan pada server lama 1хP4-3Ghz , 4GB RAM. Sekali lagi, terima kasih untuk Framework besar dan semua yang telah anda lakukan:) Michael.",
  "testimonials_2": "Halo, tim Phalcon. Saya ingin berbagi dengan Anda kisah sukses kami menggunakan Phalcon di proyek <a href=':1:'>: 2: </a> dan <a href=':3:'>: 4:</a> , situs yang paling banyak dikunjungi dan highloaded di Kazakhstan, peringkat TOP-10 dalam situs CIS. Kedua situs bekerja pada satu RESTfull API yang dibangun dengan Phalcon\\Mvc\\Micro. Pada beban puncak API memproses sesuatu seperti 400 req / detik dan ini bukan batasan. Pindah ke Phalcon memungkinkan kami untuk mengurangi waktu respon dan konsumsi CPU dan RAM, serta untuk mengurangi waktu proses pembuatan. Kami akan terus menggunakan Phalcon dalam proyek-proyek baru. Terima kasih untuk pekerjaan besar yang Anda lakukan! Salam, Nikita Vershinin, Timbal Developer, Kolesa.kz dan krisha.kz",
  "testimonials_3": "phalcon tim, kerangka kalian telah menciptakan menakjubkan. aku belum pernah menggunakan kerangka yang menggabungkan kecepatan, efisiensi, singkatnya, dan naturality semua dalam satu paket. saya berniat untuk memperjuangkan dan memberikan kontribusi kembali ke proyek dengan cara apapun yang bisa saya. saya memulai baru-baru ini pada ~800 jam proyek dan saya senang untuk mengatakan bahwa kita menggunakan phalcon kerangka. Bravo. Brian Seymour",
  "testimonials_4": "Hi guys, aku hanya menggunakan Phalcon dan itu sangat menarik! Aku hanya ingin mengatakan kepada Anda bahwa phalcon itu sannat menarik! Jadi, terima kasih untuk Framework ini dan terus bekerja dengan baik! Ivan Penchev",
  "testimonials_5": "Hi Guys, saya menulis url-shortener service dental phalcon. Yang sangat mengagumkan <a href=':1:'>: 2: </a>. Demo di sini: <a href=':3:'>: 4: </a>) Murat Küçükosman",
  "testimonials_6": "Hello Phalcon Team, saya membuat sebuah proyek kecil yang dirancang untuk pengguna Polandia menggunakan Framework Anda. Saya harus mengakui bahwa kinerja yang luar biasa, selamat pekerjaan yang baik. Layanan untuk memvalidasi isi dari halaman web dalam bahasa Polandia <a href=':1:'>: 2: </a>",
  "testimonials_7": "Hai kawan! Hanya ingin berbagi dengan Anda rilis terbaru dari proyek lama kami - <a href=':1:'>: 2: </a>. Beralih ke Phalcon memungkinkan kita untuk membagi beban server dibandingkan dengan kerangka framework, yang sangat hebat!",
  "testimonials_description": "Di bawah ini adalah kumpulan testimonial dan kisah sukses, dari Anda, para pengembang dan pengguna Phalcon PHP. Kami selalu menyambut email anda dengan kisah sukses dan posting mereka di blog kita. Jika Anda ingin mengirimkan kisah sukses Anda atau berhubungan dengan kami, jangan ragu untuk mengirim mail kapad kami di <a href='mailto: :1:'>: 2: </a>.",
  "toggle_navigation": "Navigasi beralih",
  "transactions": "Transaksi",
  "transactions_1": "Ketika proses melakukan operasi banyak  database, ini mungkin sangat penting ketika setiap langkah telah berhasil diselesaikan sehingga integritas data dapat dipertahankan. Transaksi menawarkan kemampuan untuk memastikan bahwa semua operasi database telah berhasil dieksekusi sebelum data disimpan dalam database.",
  "transactions_2": "membuat transaction manager",
  "transactions_3": "Meminta sebuah transaksi",
  "transactions_4": "Cari robot yang akan dihapus",
  "transactions_5": "Sesuatu yang tidak beres, kita harus rollback transaksi",
  "transactions_6": "Semuanya sudah baik-baik saja, mari kita melakukan transaksi",
  "transactions_7": "Robot berhasil dihapus!",
  "transactions_8": "Gagal, alasan:",
  "transactions_description": "Transaksi di Phalcon memungkinkan untuk menjaga integritas data tetap aman.",
  "try_phalcon": "Coba Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Menonton video demo",
  "zephir": "zephir",
  "telegram": "Telegram",
  "mewe": "MeWe",
  "parler": "Parler",
  "stack_overflow": "Stack Overflow"
}
