{
  "about": "Info",
  "about_blog": "BLOG",
  "about_blog_1": "Se ti piace scrivere, ricorda il <a href=':1:'> nostro blog</a> all'inizio dei tuoi tutorials. Se hai un blog di proprietà e hai scritto qualcosa su Phalcon, noi possiamo pubblicarlo nei nostri social network in modo da ottenere la massima visibilità. Se il tuo post sul blog è in una lingua diversa dall'inglese, vorremmo condividerlo e tradurlo se possibile. Facci sapere se conosci dei blog, relativi al PHP, interessati a presentare il progetto al loro pubblico.",
  "about_description_1": "Progetti fantastici richiedono persone fantastiche. Potremmo non conoscerti ancora, ma pensiamo che tu possa essere un tassello importante per la costruzione di un web migliore. Insieme, siamo pronti a cambiare il mondo! Qui in Phalcon, stiamo costruendo un framework PHP di nuova generazione; vogliamo darti delle prestazioni incredibili e aiutarti a sviluppare in una maniera più semplice e divertente.",
  "about_description_2": "Ci auguriamo che tu abbia apprezzato Phalcon tanto quanto quello che facciamo. Sono sempre ben accette richieste di collaborazione e di aiuto! <strong>Per aiutare Phalcon non è necessario che tu sia uno sviluppatore C!</strong> Ci sono molti altri settori dove puoi contribuire:",
  "about_documentation": "DOCUMENTAZIONE",
  "about_documentation_1": "E' possibile trovare il repository di questo sito Web su <a href=':1:'>github</a>. Quel repository lo stiamo usando solo per la documentazione per la lingua inglese! <br /><br />Sono sempre gradite le correzioni, aggiunte e miglioramenti nella nostra documentazione, tutto quello che dovete fare è clonare il repository ed emettere una richiesta di pull!<br /><br />Sarebbe grandioso aiutare gli sviluppatori di lingua non inglese a tradurre alcuni dei contenuti in un'altra lingua! Per le nostre traduzioni stiamo utilizzando <a href=':2:'>:3:</a>, potete trovare il nostro progetto <a href=':4:'>qui</a>",
  "about_donations_sponsoring": "DONAZIONI / SPONSORIZZAZIONI",
  "about_evangelism": "EVANGELIZZAZIONE",
  "about_evangelism_1": "Ci sono molte persone che ancora non conoscono Phalcon o non sanno che funziona veramente. Siamo certi che molti sviluppatori gioveranno nel conoscere quello che è realmente Phalcon e di come può aiutarli. Se siete a conoscenza di eventi/incontri PHP e volete parlare del progetto, sappiate di avere il nostro pieno supporto. Chi non vorrebbe conoscere lo strumento che sta rivoluzionando lo sviluppo in PHP?",
  "about_facebook_page": "Pagina Facebook",
  "about_flying_with_phalcon": "Grazie di volare con Phalcon! &lt;3",
  "about_follow_on_gab": "Seguici su Gab",
  "about_follow_on_twitter": "Seguici su Twitter",
  "about_google_plus_page": "Pagina Google+",
  "about_official_blog": "Blog ufficiale",
  "about_sample_applications": "APPLICAZIONI DI ESEMPIO",
  "about_sample_apps_1": "Grandi esempi aiutano gli altri a capire meglio come grandi cose possano essere create con Phalcon. Sentiti libero di condividere repository di applicazioni d'esempio, aiutando gli altri con il loro lavoro e permettendogli di darti un feedback sul tuo.",
  "about_screencasts": "SCREENCAST",
  "about_screencasts_1": "Tutti amiamo gli screencast. Se avete del tempo e desiderate supportare la comunità con alcuni bei video che insegnano una qualsiasi funzionalità del framework sappiate che è cosa molto gradita. Prendi come riferimento il nostro <a href=':1:'>Vimeo Channel</a>.",
  "about_share_experiences_1": "Non essere timido, sentiti libero di condividere con la comunità il modo in cui Phalcon ti ha aiutato. Se Phalcon è un caso di successo per te, lasciaci condividerlo con la comunità. Inoltre, discuti dei componenti che richiedono ritocchi, cosa semplificheresti, che benefici hai ottenuto utilizzando Phalcon. Anche se non tutto può essere implementato immediatamente, i tuoi suggerimenti riguardo nuove feature possono essere di grande aiuto per noi nel disegnare il futuro del progetto. Il tuo feedback è di aiuto per tutti noi.",
  "about_share_your_experiences": "CONDIVIDI LE TUE ESPERIENZE",
  "about_social_networks": "SOCIAL NETWORKS",
  "about_social_networks_1": "Phalcon evolve quotidianamente, attraverso il nostro desiderio di miglioraro. I social network sono parte delle nostre vite adesso, e noi interagiamo con gli altri attraverso di essi. Condividere la tua esperienza su Phalcon nelle tue cerchie sarebbe un grande miglioramento di visibilità per il progetto. Più persone entreranno nella nostra comunity, rendendola più folta, più diventera ricco di feature e popolare. Mi piace, '+1', condivisione dei post che costantemente pubblichiamo su ogni social network, partecipazione alle discussioni riguardanti i post. Le persone che scopriranno Phalcon attraverso le tue interazioni ti ringrazieranno!",
  "about_social_networks_2": "Siamo presneti sulla maggior parte dei social network più popolari. Seguendoci, ci aiuterai ad aumentare la visibilità dei nostri progetti:",
  "about_sponsoring_1": "Noi siamo un team di core developers piccolo ma efficientemente impegnato nel portare avanti il proprio lavoro. Cerchiamo di spendere più tempo possibile sul progetto. La nostra passione per questo progetto ci induce a volerci migliorare ogni giorno. Phalcon è un software open-source e l'aiuto di volontari è richiesto per la sua evoluzione costante. Ci puoi aiutare a sviluppare a mantenerne lo sviluppo attivo donando al progetto o sponsorizzandone lo sviluppo. Molto tempo e molte risorse dedicate al progetto significano molta attività, continuo miglioramento, miglior supporto, maggior numero di funzionalità, etc.",
  "about_star_on_github": "Valuta il progetto su Github",
  "about_tests": "TEST",
  "about_tests_1": "Nessun software è privo di bug. Se ne trovate qualcuno, non esitate a comunicarcelo. Abbiamo una suite di test con più di <a href=':1:'>16.000</a> test. Tuttavia gli unit-test non sono mai sufficienti. Aiutateci a migliorare la nostra suite di test con l'aggiunta di ulteriori test o migliorando quelli già esistenti. Ogni test aggiunto rende il framework più stabile.",
  "about_thank_you": "GRAZIE!",
  "about_thank_you_1": "Vorremmo ringraziare tutti coloro che hanno dato il loro contributo e i membri della comunità per l'aiuto checi danno a rendere Phalcon il miglior framework nel suo genere. Le vostre parole di incoraggiamento ed il coinvolgimento è quello che ci sprona a dare il meglio di noi. Speriamo di raggiungere e superare le aspettative che state riponendo in Phalcon.",
  "about_translations": "TRADUZIONI",
  "about_translations_1": "Stiamo cercando di raggiungere il maggior numero possibile di sviluppatori abbattendo le barriere linguistiche. Per gestire tutte le parole o le frasi da tradurre per questo sito stiamo utilizzando <a href=':1:'>:2:</a>. Il repository del progetto si trova <a href=':3:'>qui</a>.",
  "acl": "ACL",
  "acl_1": "Questo è il modo come tu puoi costruire l'elenco di controllo di accesso (ACL):",
  "acl_2": "Creare l'ACL",
  "acl_3": "L'azione predefinita è accesso NEGATO",
  "acl_4": "Registrare due ruoli, gli Users sono gli utenti registrati",
  "acl_5": "e i Guests sono gli utenti senza un'identità definita",
  "acl_description": "L'elenco di controllo di accesso (Acl) consente agli utenti di accedere ai moduli a cui sono autorizzati",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Registra namespaces, prefissi, directory o classi. Approfitta degli eventi autoloader e mantieni il pieno controllo su quali file vengono caricati e da dove.",
  "auto_loader_2": "Crea l'autoloader",
  "auto_loader_3": "Registra qualche Namespace",
  "auto_loader_4": "Registra autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Fornisce il meccanismo di caricamento automatico delle classi PHP dopo il PSR-4.",
  "basic_features": "Funzioni di base",
  "blog": "Blog",
  "built_with_phalcon": "Costruito con Phalcon",
  "cache": "Cache",
  "cache_1": "Il componente cache consente un accesso più rapido a dati utilizzati di frequente o già elaborati. Supporta molti backend come Redis, Memcached, Mongo, Files, Apc e altri",
  "cache_2": "Impostare i modelli cache service",
  "cache_3": "Mette i dati in cache per un giorno come impostazione predefinita",
  "cache_4": "Impostazioni di connessione Memcached",
  "cache_description": "Migliorate le vostre prestazioni grazie alle molteplici backend cache che Phalcon fornisce",
  "community": "Comunità",
  "consulting": "Consulenza",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO</a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO</a> congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Poiché la nostra azienda ha visto la luce del giorno nel 2003, abbiamo provato vari approcci e tecnologie nello sviluppo di software.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO</a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Ora che abbiamo acquisito un'esperienza positiva con Phalcon, siamo a consigliarvi di prendere la decisione di sviluppare con Phalcon e aiutarti a portare sul mercato il vostro prodotto basato su Phalcon.",
  "consulting_lezgro_5": "Contatta LEZGRO sul nostro <a href=':1:'> sito Web</a>, dove si possono vedere anche esempi e testimonianze del nostro lavoro.",
  "consulting_mctekk_1": "MCTekK è salito sul carro Phalcon fin dal primo giorno. Fin dal suo concepimento abbiamo visto i grandi vantaggi che Phalcon stava offrendo e potrà offrire in futuro.",
  "consulting_mctekk_2": "Abbiamo un'ampia esperienza con Phalcon e abbiamo sviluppato una miriade di progetto con lui come centro. Noi siamo qui per consigliarti su qualsiasi cosa di cui tu abbia bisogno riguardo Phalcon per aiutarti a migliorare la tua prontezza, rapidità e qualità.",
  "consulting_mctekk_3": "Contattaci attraverso il nostro <a href=':1:'> sito Web</a>, dove puoi dare un'occhiata ai progetti in cui siamo stati coinvolti.",
  "consulting_mctekk_header": "MCTekK ha già consegnato vari progetti di Phalcon di fascia alta, con i loro principali punti di forza nello sviluppo web e mobile.",
  "contribute": "Contribuisci",
  "contributors": "Contributori Phalcon",
  "contributors_description": "Phalcon viene migliorato ogni giorno dalla nostra incredibile comunità",
  "crypt": "Cripta",
  "crypt_description": "Cripta/decripta i dati importanti per tenerli al sicuro da terzi non autorizzati",
  "data_and_storage": "Dati & Archivio",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon è costruito su un potente, ma facile da comprendere e utilizzare, modello chiamato Dependency Injection. Inizializza o definisci i servizi una volta e utilizzali praticamente ovunque in tutta l'applicazione.",
  "dependency_injection_2": "Crea il contenitore Dependency Injector",
  "dependency_injection_3": "Registro di classi, funzioni, componenti",
  "dependency_injection_4": "Usa altrove nel codice",
  "dependency_injection_description": "Dependency Injection e Location de servizi e sono se stessi un contenitore per loro.",
  "discord": "Discord",
  "docs": "Documenti",
  "documentation": "Documentazione",
  "donate": "Donazioni",
  "download": "Scarica",
  "download_arch": "Arch Linux",
  "download_arch_1": "C'è un PKGBUILD per ArchLinux, disponibile <a href=':1:'> qui</a>",
  "download_box_1": "Casella n. 1",
  "download_box_2": "Casella n. 2",
  "download_box_doc_root": "Document Root :1:",
  "download_box_user_pass": "MySQL User: :1: Password: :2:",
  "download_compilation": "Compilazione",
  "download_compilation_1": "Su Linux puoi facilmente compilare ed installare l'estensione partendo dal codice sorgente.",
  "download_compilation_11": "1. Per creare l'estensione partendo dal codice sorgente in C segui i seguenti passi:",
  "download_compilation_12": "2. Aggiungi l'estensione al file php.ini:",
  "download_compilation_13": "3. Infine riavvia il server web",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Dopo le richieste della Comunità, gli sviluppatori di cPanel hanno rilasciato un modulo personalizzato che consente l'installazione di Phalcon nel siti in cui è ospitato. Informazioni possono essere trovate <a href=':1:'> qui</a>. Il modulo viene mantenuto in <a href=':2:'> Github</a>.",
  "download_dependencies": "Dipendenze",
  "download_dependencies_1": "Nonostante Phalcon non abbia link binari verso altre estensioni ne usa alcune per offrire delle funzionalità. Le estensioni usate sono:",
  "download_dependencies_2": "Non è necessario per tutte le estensioni di cui sopra siano presenti nel sistema in cui hai installato Phalcon. È possibile installare solo quelli che soddisfano le tue esigenze. Per esempio, se utilizzi un database MySQL, puoi caricare solo DOP e DOP/MySQL ignorando Oracle, SQlite, Postgresql e Mongo.",
  "download_developer_tools": "Developer Tools",
  "download_devtools_1": "Questi strumenti sono una collezione di script utili per la generazione di un'impalcatura di codice. I componenti di base della tua applicazione possono essere generati con un semplice comando, permettendoti di sviluppare facilmente applicazioni che sfruttano Phalcon.",
  "download_devtools_composer": "Installazione tramite Composer",
  "download_devtools_composer_1": "Installare composer globalmente o all'interno di un progetto:",
  "download_devtools_composer_2": "Crea il file composer.json nella seguente maniera:",
  "download_devtools_composer_3": "Lancia l'installer di composer:",
  "download_devtools_composer_4": "Crea un link simbolico allo script phalcon.php:",
  "download_devtools_docs": "Documentazione: <a href=':1:'> Phalcon Developer Tools</a>",
  "download_devtools_download": "È possibile scaricare o clonare un pacchetto cross-platform contenente i Developer Tools da <a href=':1:'> Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Ci sono molti modi possibili per utilizzare Phalcon con Docker.",
  "download_docker_2": "Le nostre immagini ufficiali si trovano <a href=':1:'> qui</a>. Sono sempre benvenute le richieste ed i miglioramenti. Il repository per i file di docker si trova qui:",
  "download_docker_3": "Con Phalcon-compose è possibile creare un ambiente isolato con docker, che ti permetterà di utilizzare Phalcon senza altre installazioni. Nota che utilizzare Phalcon Compose, richiede ",
  "download_docker_4": "e",
  "download_docker_5": "Servizi",
  "download_docker_6": "Phalcon Compose offre i seguenti servizi per impostazione predefinita:",
  "download_docker_7": "Phalcon Compose è molto facile da usare. Si supponga che sia necessario creare un'applicazione che si trova in: ",
  "download_docker_8": "Ora dobbiamo eseguire che il seguente comando per creare il contenitore della nostra applicazione:",
  "download_docker_9": "Col comando precedente verrà scaricato lo scheletro dell'ambiente docker.",
  "download_docker_10": "Variabili",
  "download_docker_11": "Sarà necessario creare un nuovo file chiamato",
  "download_docker_12": "in",
  "download_docker_13": "È stato fornito un file di esempio chiamato",
  "download_docker_14": "Modificare le variabili in quel file in base alle tue esigenze. La variabile più importante è",
  "download_docker_15": "Modifica il nome in qualcosa che sarai in grado di utilizzare. Nel nostro caso abbiamo solo lasciato il valore predefinito chiamato ",
  "download_docker_16": "Aprire il file hosts (<code>hosts/etc/hosts</code>) e immettere una nuova riga come questa:",
  "download_docker_17": "Puoi modificare il file <code>docker-compose.yml</code> e rimuovere i servizi che non utilizzerai. Phalcon Compose offre molti servizi, come accennato in precedenza, quindi la tua applicazione potrebbe non aver necessità di alcuni di loro. Rimuovendo i servizi pertinenti dal file <code>docker-compose.yml</code> ridurrai l'utilizzo della memoria del tuo ambiente.",
  "download_docker_18": "Build",
  "download_docker_19": "È ora possibile generare l'ambiente.",
  "download_docker_20": "I contenitori verranno scaricati quando necessari e impostati nel tuo ambiente.",
  "download_docker_21": "Avvia",
  "download_docker_22": "È ora possibile avviare l'ambiente:",
  "download_docker_23": "Vai a :1: nel tuo browser e vedrai che il tuo ambiente è impostato. È ora possibile sviluppare l'applicazione nella cartella app.",
  "download_docker_24": "Arresta",
  "download_docker_25": "Per arrestare l'ambiente, quando non è più necessario, è possibile eseguire il seguente comando:",
  "download_docker_26": "Ulteriori informazioni si trovano presso: ",
  "download_examples": "Esempi pre-installati",
  "download_examples_1": "I seguenti esempi sono preinstallati su ciascuna Vagrant box:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "E' disponibile un port per FREEBSD. Dovrai eseguire solo pochi comandi per installarlo:",
  "download_ide_stubs": "Integrazioni per IDE",
  "download_ide_stubs_1": "Il video qui sotto spiega come abilitare IDE stubs per PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Serve aiuto?",
  "download_need_help_1": "Dai un'occhiata alla nostra <a href=':1:'> pagina di supporto</a> per conoscere i modi per ottenere supporto. Faremo del nostro meglio per aiutarti.",
  "download_note": "Phalcon è un estensione in C, per questo motivo ti sarà necessario scaricare il binario per la tua piattaforma o compilarlo a partire dal codice sorgente.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "C'è un pacchetto disponibile <a href=':1:'> qui</a> (grazie a <a href=':2:'> Mariusz Łączak</a>)",
  "download_requirements": "Requisiti",
  "download_requirements_1": "E' necessario che alcuni pacchetti risultino già installati:",
  "download_requirements_2": "Risorse PHP 5.x per lo sviluppo",
  "download_requirements_3": "Compilatore GCC",
  "download_source_code": "Codice sorgente: <a href=':1:' target='_download' title='GitHub Repo'> github</a>",
  "download_source_code_switch": "Codice sorgente (per favore passare al ramo pertinente): <a href=':1:' target='_download' title='GitHub Repo'> github</a>",
  "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps:",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command:",
  "download_ubuntu_2": "Se si desidera installare la versione precedente del Phalcon (1. x), utilizzare il seguente PPA: ",
  "download_ubuntu_or_debian": "Ubuntu o Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'> Vagrant </a> è un ottimo strumento per creare e configurare ambienti di sviluppo leggeri, riproducibili e portatili.",
  "download_vagrant_2": "Usa una di queste box per testare o sviluppare con Phalcon su un ambiente pre-configurato.",
  "download_vagrant_boxes": "Vagrant Boxes",
  "download_windows": "DLL di Windows",
  "download_windows_download": "Scarica",
  "download_windows_dlls": "Le DLL di Windows si possono scaricare dalla nostra pagina delle release di Github <a href=':1:'> qui</a>",
  "download_windows_guides": "Guide Correlate",
  "download_windows_guides_wamp": "Installazione su WAMP",
  "download_windows_guides_xampp": "Installazione su XAMPP",
  "download_windows_installation": "Installazione",
  "download_windows_installation_1": "Per utilizzare phalcon su Windows puoi scaricare la libreria DLL. Modificare il file php. ini, aggiungi alla fine e riavviare il server Web per caricare l'estensione. <a href=':1:'> più</a>.",
  "download_windows_note": "Raccomandiamo vivamente di usare l'ultima estensione di PHP corrispondente alle nostre DLLs, in modo da poter sfruttare il vantaggio dell'intero set di funzionalità Phalcon.",
  "download_windows_older": "Versioni precedenti",
  "download_windows_stable": "Versioni Stable/Master",
  "encryption": "Crittografia",
  "encryption_1": "Phalcon fornisce servizi di crittografia tramite il componente Phalcon\\Crypt. Questa classe offre semplici wrapper orientato alla libreria di crittografia di PHP di openssl.",
  "encryption_2": "Questa è una chiave segreta (32 bytes).",
  "encryption_3": "Questo è il testo che vuoi crittografare.",
  "events": "Eventi",
  "events_description": "Estendei al massimo i componenti del framework impostando 'hook points'. Crea eventi personalizzati e rendi l'applicazione più flessibile e potente",
  "events_management": "Gestione degli Eventi",
  "events_management_1": "Un EventsManager consente di allegare i listener per un particolare tipo di evento. Il tipo che ci interessa ora è 'dispatch'. Il codice seguente Filtra tutti gli eventi generati dal Dispatcher:",
  "events_management_2": "Crea un manager eventi",
  "events_management_3": "Rimane in attesa/ascolto per eventi prodotti nel dispatcher utilizzando il plugin di sicurezza",
  "events_management_4": "Gestione delle eccezioni ed eccezioni \"non trovato\" tramite NotFoundPlugin",
  "events_management_5": "Assegnare la gestione degli eventi al dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Messaggi Flash",
  "flash_messages_1": "Utilizzare il \"notificatore flash\" per mostrare le notifiche a un utente in un'applicazione web:",
  "flash_messages_2": "ci sono errori nel form",
  "flash_messages_3": "sì!, tutto è andato molto bene",
  "flash_messages_4": "questo è un avviso per gli utenti",
  "flash_messages_5": "questo è solo un avvertimento",
  "flash_messages_description": "I messaggi Flash sono utilizzati per informare l'utente circa lo stato delle azioni.",
  "forms_builder": "Form Builder",
  "forms_builder_1": "Ogni elemento nel form può essere renderizzato come richiesto dallo sviluppatore. Internamente, Phalcon\\Tag viene utilizzato per generare il codice HTML corretto per ogni elemento che è possibile passare gli attributi HTML aggiuntivi come secondo parametro di render():",
  "forms_builder_2": "Home",
  "forms_builder_3": "Cellulare",
  "forms_builder_description": "Creare facilmente moduli HTML",
  "forum": "Forum",
  "gab": "Gab.ai",
  "get_phalcon": "Ottieni Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "La sua architettura innovativa rende Phalcon il framework PHP più veloce mai costruito!",
  "header_tagline": "Un framework PHP completo (full-stack: a tutto tondo) fornito come un'estensione di C",
  "high_performance_php_framework": "PHP Framework ad alte prestazioni",
  "hosting": "Hosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud offre capacità computazionale cloud, scalabile e che paghi per l'effettivo utilizzo.",
  "hosting_amazon_ec2_2": "Seleziona un template pre-configurato Amazon Machine Image (AMI) per averlo immediatamente installato e funzionante. O crea un AMI contenente le tue applicazioni, librerie, dati e relative impostazioni di configurazione. <a href=':1:'> Vedi altro</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows shared web hosting packages and plans, no configuration or installation required! They offer a variety of PHP versions from 5.2 - 7.0 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "Il <a href=':1:'> cloud Windows Azure</a> fornisce Windows hosting altamente scalabile e gestibile per le tue applicazioni web. Utilizza Phalcon per ridurre i costi della tua istanza.",
  "hosting_azure_2": "Per installare Phalcon, seguire la procedura passo per passo in <a href=':1:'> questo articolo di SitePoint</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon può essere installato su qualsiasi macchina sul quale il provider offra un accesso SSH di root (o sudo). Segue una lista di compagnie affidabili che offrono questi servizi:",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Costruito per gli sviluppatori. Fornisce un server cloud SSD in 55 secondi. <a href=':1:'>Vedi altro</a>",
  "hosting_digital_ocean_2": "Segui questo <a href=':1:'> tutorial</a> per iniziare",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host offre molteplici piani di hosting conveniente e di alta qualità.",
  "hosting_dcthost_2": "Per impostazione predefinita, hanno Phalcon installato su tutti i loro pacchetti di hosting condivisi.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit offre molti piani di hosting (ce n'è uno per sviluppatori ed è gratis - con alcune limitazioni) questo dovrebbe soddisfare il bisogno della maggior parte degli sviluppatori che vogliano anche solo provare Phalcon o deployare le applicazioni che lo usano.",
  "hosting_fortrabbit_2": "Offrono una varietà di <a href=':1:'> estensioni</a> che soddisferebbe anche il progetto più esigente.",
  "hosting_fortrabbit_3": "Versioni stabili di Phalcon vengono pre-installate, puoi attivarle dal tuo pannello di amministrazione.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Puoi installare Phalcon usando le istruzioni d'installazione standard.",
  "hosting_kinghost_1": "Dal 2006, KingHost è uno dei più grandi siti di hosting azienda in Brasile e ha già oltre 300.000 siti ospitati con circa 60.000 clienti. Con sede a Porto Alegre (RS), con data center in Brasile, l'azienda offre il servizio di hosting di server condivisi, piani specifici per gli sviluppatori personalizzati e progetti nel settore delle soluzioni di enterprise, tra cui il cloud computing e dedicato server. Offre anche soluzioni di marketing digitale come l'e-mail marketing e soluzioni di sicurezza.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Segui questo <a href=':1:'> tutorial</a> per iniziare",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Distribuisce e gestisce il server virtuali Linux nel Cloud Linode. Ottieni un server che esegue, in pochi secondi, la tua scelta di distro Linux, risorse e posizione del nodo. <a href=':1:'>Vedi altro</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "Server dedicato ad alte prestazioni con protezione contro le minacce, compresi gli attacchi Distributed Denial of Service (DDoS). La nostra rete ad alta capacità di protezione dal DDoS è in grado di proteggere automaticamente il tuo server dedicato dagli attacchi DDoS fino a 4,2 Tbps. <a href=':1:'>Vedi altro</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Server sono macchine virtuali che eseguono Linux o Windows® Server nel Rackspace Cloud. È possibile scalare le risorse come CPU, memoria e storage aumentando o diminuendo, a seconda delle tue esigenze. Meglio di tutto, tu puoi pagare e iniziate. <a href=':1:'> Vedi altro</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting per sviluppatori. Accesso completo alla shell a server veloci con tutti i tuoi tools preferiti pre installati e mantenuti per gli utenti.",
  "hosting_webfaction_2": "Per installare Phalcon WebFaction, seguire le istruzioni descritte <a href=':1:'> qui</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "Il componente Phalcon\\Translate aiuta nella creazione di applicazioni multilingue. Le applicazioni che utilizzano questo componente, visualizzano contenuti in diverse lingue, in base alla selezione della lingua dell'utente supportata dall'applicazione.",
  "i18n_2": "Chiedi al browser qual è il miglior linguaggio",
  "i18n_3": "Verifica se abbiamo un file di traduzione per quella lingua/lang",
  "i18n_4": "Fallback predefinito per alcuni",
  "i18n_5": "Restituire un oggetto di traduzione",
  "i18n_description": "Traduci facilmente le applicazioni in molte lingue",
  "installing_phalcon_php": "Installazione di Phalcon PHP",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Unisciti alla nostra vivace comunità di sviluppatori!",
  "join_our_community_description": "Contributi dalla comunità in estensioni, plugins, adattatori, VM, esempi, codice sorgente... e molto altro",
  "language_text": "Inglese",
  "learn": "Impara",
  "license_new_bsd": "Phalcon è un framework PHP open source < br / > costruito come un'estensione di C. È disponibile sotto il < br / &gt; <a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'> Nuova licenza BSD</a>.",
  "low_overhead": "Carico di lavoro minimo",
  "low_overhead_1": "Le estensioni Zephir/C sono caricate insieme a PHP, una volta all'avvio del daemon del web server",
  "low_overhead_2": "Classi e funzioni fornite dall'estensione sono pronte all'uso per qualsiasi applicazione",
  "low_overhead_3": "Il codice viene compilato e non è interpretato perché è già compilato per una specifica piattaforma e processore",
  "low_overhead_4": "Grazie alla sua architettura a basso livello e ottimizzazioni <strong>Phalcon fornisce l'overhead più basso per le applicazioni basate su MVC</strong>",
  "low_overhead_description": "Basso consumo di memoria e CPU rispetto ai tradizionali frameworks",
  "low_overhead_title": "Estensione PHP in C (Phalcon)",
  "more": "Altro...",
  "mvc": "MVC",
  "mvc_1": "Costruire applicazioni single e multi-modulo con facilità e divertimento. Utilizza la struttura di file, gli schemi e i patterns che già conosci.",
  "mvc_hmvc": "HMVC & MVC",
  "mvc_hmvc_description": "Moduli, componenti, modelli, viste e controllori",
  "odm_for_mongo": "ODM per Mongo",
  "odm_for_mongo_1": "Oltre alla sua capacità di mappare le tabelle nei database relazionali, Phalcon può associare i documenti a un database MongoDB. Il ODM offre una funzionalità CRUD, eventi, convalide tra gli altri servizi.",
  "odm_for_mongo_2": "Quanti robot ci sono?",
  "odm_for_mongo_3": "Quanti robot meccanici ci sono?",
  "odm_for_mongo_4": "Ci sono :1: robots",
  "odm_for_mongo_description": "Object Document Mapping per MongoDB",
  "oops": "Houston abbiamo un problema!",
  "or": "oppure",
  "orm": "ORM",
  "orm_1": "Un potente ORM è fornito da Phalcon consentendo di manipolare i record del database come classi e oggetti. MySQL, PostgreSQL e SQLite sono supportati pronti all'uso.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Il Team di Phalcon",
  "phalcon_team_1": "Molte altre persone",
  "phalcon_team_2": "Phalcon è ed è sempre stato un impegno di molti volontari: ",
  "phql": "PHQL",
  "phql_1": "PHQL è un dialetto SQL ad alto livello, orientato agli oggetti che consente di scrivere query utilizzando un linguaggio di tipo SQL standardizzato. PHQL viene implementato come un parser (scritto in C) che traduce la sintassi in quello di destinazione RDBMS. Per ottenere le massime prestazioni possibili, Phalcon fornisce un parser che utilizza la stessa tecnologia come SQLite. Questa tecnologia fornisce un piccolo parser \"in-memory\" con un ingombro di memoria molto basso ed è anche \"thread-safe\".",
  "phql_2": "Nome",
  "phql_description": "Il potente e sicuro Phalcon Query Language, PHQL",
  "polling_app": "Creare una app di polling da zero, in meno di 15 minuti",
  "queueing": "Accodamento - processo in background",
  "queueing_1": "Attività come l'elaborazione video, ridimensionamento delle immagini o l'invio di messaggi di posta elettronica non sono adatti per essere eseguito online o in tempo reale perché potrebbero rallentare i tempi di caricamento delle pagine e influire in modo significativo l'esperienza dell'utente. La soluzione migliore consiste nell'implementare di processi in background. L'applicazione web inserisce processi in una coda e saranno trattati separatamente.",
  "queueing_2": "Connettersi alla coda",
  "queueing_3": "Inserisci il lavoro in coda",
  "queueing_description": "Utilizza il sistema di queueing incorporato in Phalcon per pianificare i processi e ridurre il carico del tuo server web",
  "resources": "Risorse",
  "rest": "Rest",
  "rest_description": "In questo caso, puoi utilizzare in una applicazione micro o completa per raggiungere il tuo obiettivo. Inoltre, un potente set di \"helpers\" HTTP.",
  "restful_services": "Servizi Restful",
  "restful_services_1": "Scrivere un REST servers e applicazioni non è mai stato più facile. Nessun boilerplate. I servizi semplici si adatteranno in un unico file.",
  "restful_services_2": "Restituire i dati in JSON",
  "roadmap": "Roadmap",
  "router": "Router",
  "router_1": "Routing (L'inoltro) è come si suppone sia. Niente di più. Niente di meno.",
  "router_2": "Creare l'inoltro",
  "router_3": "Definisci un inoltro",
  "router_description": "Phalcon\\Mvc\\Router fornisce funzionalità di inoltro avanzate.",
  "sample_applications": "Applicazioni d'esempio",
  "see_for_yourself": "Guardate voi stessi...",
  "sharding": "Sharding (Partizionamento orizzontale)",
  "sharding_1": "Collegare i modelli a diversi database",
  "sharding_2": "Questo servizio restituisce un database MySQL",
  "sharding_3": "Questo servizio restituisce un database PostgreSQL",
  "sharding_description": "Connetti, archivia e recupera i dati da molti sistemi di database allo stesso tempo",
  "slack": "Slack",
  "something_went_wrong": "Qualcosa è andato storto :(",
  "sponsored_by": "Sponsorizzato da",
  "sponsors": "Sponsors",
  "sponsors_and_supporters": "Sponsor e sostenitori",
  "sponsors_and_supporters_upper": "SPONSOR E SOSTENITORI",
  "sponsors_become_patron": "Diventare un sostenitore!",
  "sponsors_description_1": "Per coloro che desiderano sponsorizzare il nostro lavoro e ulteriore sviluppo del Phalcon, offriamo varie opzioni di sponsorizzazione che si adattano a qualsiasi budget. Sponsorizzare il nostro lavoro ci permette di dedicare più tempo al progetto, offrire risposte più veloci a bug e funzionalità e garantire stabilità di progetti.",
  "sponsors_our_great_sponsors": "Questi sono i nostri sponsor! Grazie!!",
  "stack_overflow": "Overflow dello stack",
  "store": "Negozio",
  "support": "Supporto",
  "support_documentation_1": "Perfavore usa :1: prima di ogni altro tentativo. Puoi anche usare la funzionalità di ricerca nei documenti per trovare quello che stai cercando. Se la tua domanda permane senza risposta, in seguito trovi altre opzioni:",
  "support_download_page": "pagina dei download",
  "support_forum_1": "È possibile fare una domanda nel nostro <a href=':1:'> Forum di discussione</a>",
  "support_note": "Molti bug vengono segnalati da parte di utenti che non stanno utilizzando l'ultima versione. Perfavore visita la :1:, scarica l'ultima versione disponibile (o compilala) e conferma se il problema che stavi fronteggiando permanga un bug.",
  "support_phalcon_forum": "Forum Phalcon",
  "support_please_note": "Nota bene:",
  "support_please_note_1": "Stack Overflow non è dedicato al supporto di Phalcon",
  "support_please_note_2": "Per favore di non segnalare qui nuovi bug. Per questa attività per favore utilizza <a href=':1:'> issue tracker</a> in Github",
  "support_please_note_3": "Per favore non chiedere funzionalità qui. Per favore utilizza <a href=':1:'> issue tracker</a> in Github",
  "support_please_note_4": "Accertati di aver incluso il tag 'phalcon' nella tua domanda",
  "support_please_note_5": "Accertati di aver menzionato 'Phalcon' nell domanda",
  "support_reporting_a_bug": "Riportare un bug",
  "support_reporting_a_bug_1": "Per favore segnala bug quando hai esaurito tutte le opzioni di cui sopra, utilizzando il <a href=':1:'>issue tracker</a> in Github.",
  "support_slack": "Slack",
  "support_slack_1": "Potete trovarci nel canale <a href=':1:'> PhalconChats</a> su Slack.",
  "support_stack_overflow_1": "Se hai familiarità o preferisci Stack Overflow, c'è il tag <a href=':1:'> phalcon</a> che puoi utilizzare per la ricerca oppure per contrassegnare la tua query.",
  "support_us": "Sostienici",
  "team": "Squadra",
  "team_andres_1": "Andres non è nuovo ai progetti open source. Negli ultimi nove anni, ha disegnato e rilasciato frameworks per PHP ed è stato coinvolto nello sviluppo web - la sua principale passione.",
  "team_andres_2": "Vincitore TR35, l'obiettivo principale di Andres è di scegliere e implementare o usare il giusto strumento per il giusto lavoro, con particolare attenzione riguardo le prestazioni. Per questo nel 2011 una nuova idea entrò in cantiere; creare un nuovo tipo di framework per gli sviluppatori PHP, focalizzato sull'usabilità, le funzionalità e molto performante.",
  "team_andres_3": "Nell'ottica di questo approccio innovativo è nato Phalcon. Un framework PHP scritto in C che può offrire un ricco insieme di funzionalità agli sviluppatori massimizzando al tempo stesso le performance e mantenedo il consumo di risorse basso.",
  "team_andres_4": "Andres è uno dei principali artefici di Phalcon e della sua ideazione.",
  "team_eduar_1": "Eduar è uno sviluppatore C/PHP con diversi anni di esperienza nello sviluppo di applicazioni. E' uno dei fondatori e dei principali sviluppatori del progetto Phalcon iniziato nel 2011.",
  "team_eduar_2": "Ha partecipato in tutti i settori, dalla progettazione framework per le funzioni interne del kernel, compresi la documentazione e gli strumenti per lo sviluppatore(developer tools). E' affascinato dai frameworks, linguaggi e nuove tecnologie.",
  "team_eduar_3": "Eduar ama i film di fantascienza e a volte gioca a calcio.",
  "team_nikolay_1": "Nikolay sviluppa applicazioni web da più di 10 anni. Si è occupato di alte prestazioni così come di complessi siti web e di design.",
  "team_nikolay_2": "Nikolay lavora su progetti Open Source da molto tempo, utilizzandoli in base ai requisiti. Per questo ha cominciato ad usare il suo tempo per restituire valore alla comunità, forkando progetti, offrendo cambi e suggerimenti architetturali e di performance. E' stato determinante per il miglioramento di progetti di CMS Open Source ricevendo un feedback positivo dalla community.",
  "team_nikolay_3": "ll suo continuo coinvolgimento in progetti open source lo ha aiutato a maturare la propria conoscenza tecnica e al tempo stesso restituire valore alla comunità.",
  "team_nikolay_4": "Nikolay è un supporter sfegatato della massimizzazione delle prestazioni nelleapplicazioni web. Dopo essere stato introdotto a Phalcon,ha deciso di cominciare a usare il progetto e diventarne un Evanglista. Lui sta guuidando lo sforzo attraverso la comunità russa e offre risorse per gli speaker Russi.",
  "team_nikolay_5": "I suoi contributi comprendono: un mirror del sito principale in russo (<a href=':1:'> http://www.phalcon.ru</a>), uno mirror del repository di documentazione in russo (<a href=':2:'> http://docs.phalconphp.ru</a>), cambiamenti in corso e correzioni alla documentazione in inglese, un gruppo sul social network Vkontakte (<a href=':3:'> https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos è nell'industria IT da più di 20 anni. E' stato introdotto al mondo del PHP nel 2000 e ha iniziato ad usarlo prima su progetti personali come poi sui progetti dei suoi committenti.",
  "team_nikos_2": "Lui ama scorpire nuove tecnologie e i metodi per integrarli nelle applicazioni esistenti sfruttando quindi i vantaggi che queste offrono.",
  "team_nikos_3": "Lui è un sostenitore sfegatato del Test Driven Development (TDD) e cerca sempre di raggiungere la copertura completa del suo codice.",
  "team_nikos_4": "L'interesse spropositato e continuo di Nikos per le tecnologie innovative lo ha condotto verso Phalcon. E' entrato nel team del core ed i suoi compiti comprendono la coordinazione dell' NFRs ed il bug fixing, contribuisce con i testi, la documentazione ed incubator. Nikos è anche responsabile del mantenimento delle DLL Windows ed offre tutto il supporto possibile.",
  "team_paul_1": "Paul si considera molto fortunato ad aver trascorso l'ultimo decennio della sua vita scrivendo software user-friendly con l'aiuto di Framework open source e strumenti come Phalcon. Di conseguenza, trascorre le sue ore fuori del lavoro, cercando di migliorare gli strumenti FOSS e la vita di altri sviluppatori come lui. Ha un forte bisogno di codice semplice e lapalissiano UX, con Phalcon si concentra su documentazione, nuova esperienza utente, relazioni coi collaboratore e impegno sociale nella Comunità.",
  "team_paul_2": "Paul ha recentemente avviato la propria azienda per seguire la sua passione di costruire software intuitivo con le tecnologie emergenti come, ReactJS, Webpack, Ruby ed Elixir(Erlang). Ora con orgoglio aggiunge Zephir e Phalcon a quella lista sempre crescente ed è contento di assumere il ruolo di \"cheerleader\", sostenendo le loro caratteristiche innovative.",
  "team_paul_3": "Nel caso non stia scrivendo codice, Paul segue le orme di sua moglie e sviluppa il suo interesse nella videografia e produzione di video. Opera in un canale YouTube educativo attualmente focalizzata su Phalcon e quando serve con lezioni di scienze informatiche.",
  "team_serghei_1": "Serghei ha lavorato come sviluppatore Ruby/PHP per oltre 8 anni ed è specializzata nello sviluppo di applicazioni web. Come un sostenitore e promotore di Behavior Driven Development (BDD) è anche un membro del team di <a href=':1:'> Codeception</a>.",
  "team_serghei_2": "Serghei si colloca in profondità nelle tecnologie innovative che lo hanno introdotto in Phalcon. E' responsabile del coordinamento di correzioni dei bug, test, strumenti di sviluppo, incubator e sostenere altri progetti collegati a Phalcon.",
  "team_serghei_3": "Quando non lavora, Serghei si diletta a guardare documentari, film di fantascienza e a volte gioca Mahjong o Go.",
  "team_volodymyr_1": "Volodymyr ha sviluppato server e applicazioni web per oltre 20 anni. E' stato coinvolto nella progettazione e scrittura di applicazioni software ad alte prestazioni molto complesse. La passione di Volodymyr per scrivere software veloce, robusto e ottimizzato lo ha avvicinato a Phalcon ed ad unirsi al team di sviluppo.",
  "team_volodymyr_2": "Nel suo tempo libero Volodymyr si gusta la compagnia della sua amata moglie, contribuisce a progetti open source e studia le lingue straniere.",
  "template_engine_volt": "Motore template (Volt)",
  "template_engine_volt_1": "Volt è un linguaggio di template amichevole, ultra-veloce e scritto in Zephir/C per PHP. Fornisce una serie di 'helpers' per scrivere viste in modo semplice. Volt è altamente integrato con gli altri componenti di Phalcon, ma è possibile utilizzarlo come componente autonomo nelle tue applicazioni.",
  "template_engine_volt_description": "Un motore di template ispirato da Jinja ma costruito in C per PHP",
  "template_engines": "Motore template",
  "template_engines_1": "Le Viste rappresentano l'interfaccia utente dell'applicazione. Le Viste sono spesso file HTML con codice PHP incorporato che eseguono attività correlate esclusivamente alla presentazione dei dati. Le Viste permettono di gestire il lavoro dell'inserimento dei dati tramite il browser web o un altro strumento che viene utilizzato per effettuare richieste dall'applicazione.",
  "template_engines_description": "Viste rappresentano l'interfaccia utente della tua applicazione",
  "testimonials": "Testimoni",
  "testimonials_1": "Saluti, Team Phalcon ! Ho un progetto, basato su framework Phalcon. È un Guitarama (<a href=':1:'>:2:</a>) - Schede di chitarre e catalogo degli accordi. Il sito si rivolge al pubblico russo e utilizza la lingua russa, ma spero, non ci sarà nessun problema a capire la maggior parte delle pagine. Il sito è stato rilanciato su una nuova piattaforma all'inizio di gennaio 2013 e da allora ha dimostrato una crescita costante. Visite giornaliere attuali: ~1500 visitatori unici, ~5000 pagine viste. Il sito è in esecuzione su un vecchio server fisico 1хP4 - 3Ghz, 4GB di RAM. Ancora una volta, grazie per un grande framework e tutto quello che state facendo:) Michael.",
  "testimonials_2": "Ciao, Team Phalcon. Mi piacerebbe condividere con voi la nostra storia di successo usando Phalcon neil progetti <a href=':3:'>:4:</a> e <a href=':1:'>:2:</a>, il più visitato e ad elevato carico dei siti in Kazakistan, classificato nella TOP-10 classificati siti nel CIS. Entrambi i siti di lavoro su singole API RESTful scritte in Phalcon\\Mvc\\Micro. Nei picchi di carico le API processano qualcosa come 400 req/sec e nquesto non è un limite. Trasferirci a Phalcon ci ha permesso di ridurre i tempi di generazione della risposta e il consumo di CPU e RAM, nonché di ridurre i tempi del processo di sviluppo. Continueremo utilizzando Phalcon nei nostri nuovi progetti. Grazie per il grande lavoro che state facendo! Cordiali saluti, Nikita Vershinin, Lead Developer, Kolesa.kz e krisha.kz",
  "testimonials_3": "Team di Phalcon, il framework che voi ragazzi avede creato è semplciemente fantastico. Non ho mai usato un framework che combini velocità, efficienza, brevità e naturalezza in un solo package. Intendo sstenere e contribuire al progetto in qualsiasi modo io possa. Recentemente ho abbracciato un progeto da circa 800 ore e sono felice di dire che stiamo usando Phalcon. Bravi. Brian Seymour",
  "testimonials_4": "Ciao ragazzi, mi sono appena imbattuto in Phalcon è semplicemente fantastico! Volevo semplicemente dirvi che siete fantastici! Grazie mille per questo framework e continuate con questo ottimo lavoro! Ivan Penchev",
  "testimonials_5": "Ciao ragazzi, ho scritto un semplice servizio shortener url con phalcon. E' davvero incredibile! <a href=':1:'>:2:</a>. La demo è qui: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Ciao Phalcon Team, ho creato un piccolo progetto disegnato per gli utenti polacchi utilizzando il Vostro framework. Devo ammettere che le prestazioni sono incredibili, ottimo lavoro complimenti. Servizio per convalidare il contenuto delle pagine web in lingua polacca <a href=':1:'>:2:</a>",
  "testimonials_7": "Ciao ragazzi! Volevo condividere con voi l'ultima release del nostro vecchio progetto - <a href=':1:'>:2:</a>. Passare a phalcon ci ha permesso di dimezzare il carico del server rispetto al framework precedente, è questo fantastico!",
  "testimonials_description": "Di seguito è una raccolta di testimonianze e storie di successo, da voi, sviluppatori e utenti di Phalcon PHP. Per noi sono sempre benvenute e-mail con storie di successo e saranno pubblicate nel nostro blog. Se desideri inviarci la tua storia di successo o entrare in contatto con noi, non esitate a scriverci a <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Attiva/disattiva navigazione",
  "transactions": "Transazioni",
  "transactions_1": "Quando un processo esegue più operazioni di database, è importante che ciascuna fase venga completata con successo affinché possa essere mantenuta l'integrità dei dati. Le transazioni offrono la possibilità di garantire che tutte le operazioni di database siano state eseguite con successo prima che i dati vengano salvati nel database.",
  "transactions_2": "Creare un manager di transazione",
  "transactions_3": "Richiedi una transazione",
  "transactions_4": "Ottenere i robots da eliminare",
  "transactions_5": "Qualcosa è andato storto, dobbiamo effettuare il rollback della transazione",
  "transactions_6": "Tutto è andato bene, diamo il commit della transazione",
  "transactions_7": "I Robots sono stati eliminati con successo!",
  "transactions_8": "Fallito, motivo: ",
  "transactions_description": "Le transazioni in Phalcon ti permettono di mantenere sicura l'integrità dei dati.",
  "try_phalcon": "Prova Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Viste & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Guarda il video dimostrativo",
  "zephir": "Zephir"
}