{
  "about": "Over",
  "about_blog": "BLOG",
  "about_blog_1": "If you like writing, remember that <a href=':1:'>our blog</a> is open to post tutorials created by you. If you have a blog of your own and have written something about Phalcon, we can also publish in our social network pages so as to achieve maximum visibility. If your blog post is in a language other than English, we want to share it and potentially translate it if possible. If you know about blogs related to PHP that are interested in presenting the project to its audience please let us know.",
  "about_description_1": "Er is geen geweldig project zonder de juiste steun. Het is mogelijk dat we je nog niet kennen, maar we vinden dat je mooi past in het bouwen van een beter web. Samen zijn we klaar om de wereld te veranderen! Hier bij Phalcon bouwen we een nieuwe generatie framework voor PHP, we willen u een geweldige performantie geven terwijl we het ontwikkelen makkelijk en plezierig houden.",
  "about_description_2": "We hopen dat je Phalcon net zo leuk vind als ons. We verwelkomen je bijdrage en hulp! <strong>Je hoeft geen C ontwikkelaar te zijn om bij te dragen aan Phalcon!</strong> Er zijn vele andere manieren hoe je kunt bijdragen:",
  "about_documentation": "DOCUMENTATIE",
  "about_documentation_1": "Het archief van deze website is beschikbaar op <a href=':1:'> github</a>. We zijn met behulp van dat repository als een bron voor onze documentatie voor de Engelse taal alleen! <br /> <br /> wij altijd waarderen correcties, toevoegingen en verbeteringen in onze documentatie, dus alles wat je hoeft te doen is de repository clonen en de afgifte van een pull-aanvraag! <br /> <br /> Als u niet-Engels sprekende ontwikkelaars helpen kunt door het vertalen van sommige van de inhoud een andere taal, dat zou geweldig zijn! We gebruiken <a href=':2:'>:3:</a> voor onze vertalingen, en u vindt ons project <a href=':4:'> hier</a>",
  "about_donations_sponsoring": "DONATIES/SPONSORING",
  "about_evangelism": "EVANGELISME",
  "about_evangelism_1": "Er zijn nog steeds veel mensen, die nog niet weten dat Phalcon bestaat of dat het echt werkt. We zijn er zeker van dat veel programmeurs zullen profiteren van wat Phalcon kan bieden en hoe het hen kan helpen. Als je weet, dat er PHP bijeenkomsten zijn en je wilt er spreken over het project, je hebt onze volle ondersteuning. Wie wil nou niet weten over dit gereedschap dat revolutionair is voor alle PHP ontwikkeling.",
  "about_facebook_page": "Facebook Pagina",
  "about_flying_with_phalcon": "Bedankt voor het vliegen met Phalcon! &lt; 3",
  "about_follow_on_gab": "Volg ons op Gab",
  "about_follow_on_twitter": "Volg ons op Twitter",
  "about_google_plus_page": "Google + pagina",
  "about_official_blog": "Officiële Blog",
  "about_sample_applications": "VOORBEELD APPLICATIES",
  "about_sample_apps_1": "Uitgebreide voorbeelden helpen anderen met het beter verstaan hoe grote dingen gebouwd kunnen worden met Phalcon, voel je vrij om respositories met voorbeeld applicaties te delen om zo anderen te helpen met hun werk. Laat anderen ook toe om feedback te geven op je werk!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "We all love screencasts. If you have some extra time and want to support the community with some nice videos teaching any of the framework's features, it's very welcome. Check out our <a href=':1:'>Vimeo Channel</a> as a guide.",
  "about_share_experiences_1": "Wees niet verlegen en voel je vrij om te delen met de gemeenschap. Vertel ons de manieren waarop Phalcon handig was voor je. Indien Phalcon een succesverhaal is voor je, laat ons dat dan delen met de gemeenschap. Laat ons ook zeker weten welke onderdelen er volgens jou extra werk nodig hebben, wat je makkelijker kon door Phalcon en welke voordelen het je gaf. Hoewel niet alles tegelijkertijd geïmplementeerd kan worden, is wat jij ons kan vertellen samen met feature requests iets wat ons goed kan helpen om de toekomst van ons project vorm te geven. Je feedback helpt ons allen.",
  "about_share_your_experiences": "DEEL JE ERVARINGEN",
  "about_social_networks": "SOCIALE NETWERKEN",
  "about_social_networks_1": "Phalcon evolueert op een dagelijkse basis, door ons verlangen om het steeds te verbeteren. Sociale netwerken vormen nu een deel van ons leven en we gebruiken ze allemaal. Door je ervaringen met Phalcon te delen met je kenissen word de zichtbaarheid van het project veel groter. Meer en meer mensen zullen deel van onze gemeenschap vormen, waardoor het krachtiger, uitgebreider en populairder wordt. 'Like', '+1' en 'share' posts die we op elk sociaal netwerk zetten, en neem deel aan discussies rond deze posts. Mensen die dankzij jou Phalcon zullen ontdekken zullen je dankbaar zijn!",
  "about_social_networks_2": "We zijn aanwezig op de meeste populaire sociale netwerken. Door ons te volgen, help je de zichtbaarheid van het project te vergroten:",
  "about_sponsoring_1": "We zijn een klein maar effectief kern team van ontwikkelaars dat zich uit de naad werkt. We proberen zoveel mogelijk tijd per dag in ons project te steken. Al onze passie voor dit project zorgt ervoor dat we elke dag beter willen worden. Phalcon is open-source software en we hebben hulp nodig van vrijwilligers voor een voortdurende vooruitgang. Jij kan ons helpen om een meer actieve ontwikkeling te hebben door aan het project te doneren of de ontwikkeling te sponsoren. Meer tijd en bronnen voor het project betekend meer activeit, meer verbeteringen, meer ondersteuning, meer geweldige features, etc.",
  "about_star_on_github": "geef het project een ster op Github",
  "about_tests": "TESTEN",
  "about_tests_1": "Er is geen software vrij van bugs. Als je een bug kunt vinden, aarzel dan niet om dat ons te vertellen. Wij hebben een testsuite met meer dan <a href=':1:'> 16.000</a> tests. Eenheid-tests zijn echter nooit genoeg. Help ons met het verbeteren van onze testsuite door toevoeging van meer tests of de huidige tests te verbeteren. Elke toegevoegde test maakt het Phalcon framework stabieler.",
  "about_thank_you": "DANK JE WEL!",
  "about_thank_you_1": "We willen graag iedereen bedanken die deel vormt van onze gemeenschap en ertoe bijgedragen heeft om ons de moed te geven om Phalcon het beste framework van zijn soort te maken. Jullie vriendelijke woorden en verbintenis is wat ons drijft om het steeds beter te doen.",
  "about_translations": "VERTALINGEN",
  "about_translations_1": "We are trying to reach as many developers as possible, breaking down the language barriers. We are using <a href=':1:'>:2:</a>, to handle all the words or sentences that need to be translated for this site. The project repository is located <a href=':3:'>here</a>.",
  "acl": "ACL",
  "acl_1": "Dit is hoe je de toegangsbeheerlijst kunt opzetten (ACL):",
  "acl_2": "Maak de toegangsbeheerlijst ACL",
  "acl_3": "De standaardactie is toegang weigeren",
  "acl_4": "Registreer twee rollen, gebruikers is geregistreerde gebruikers",
  "acl_5": "en de gasten zijn gebruikers zonder een gedefinieerde identiteit",
  "acl_description": "Access Control List allows users to access the modules they're authorized to",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Register namespaces, prefixes, directories or classes. Take advantage of the autoloader events and maintain full control over what files are loaded and from where.",
  "auto_loader_2": "Creates the autoloader",
  "auto_loader_3": "Registreer naamruimten",
  "auto_loader_4": "Register-autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Biedt het autoloading mechanisme van PHP classes volgens PSR-4.",
  "basic_features": "Basisfuncties",
  "blog": "Blog",
  "built_with_phalcon": "Gemaakt met Phalcon",
  "cache": "Cache",
  "cache_1": "De cache-component biedt snellere toegang tot vaak gebruikte of reeds verwerkte gegevens. Het ondersteunt vele backends zoals Redis, Memcached, Mongo, bestanden, Apc en meer",
  "cache_2": "Set the models cache service",
  "cache_3": "Cache data for one day by default",
  "cache_4": "Memcached verbindingsinstellingen",
  "cache_description": "Verbeter uw prestaties met veel van de backend-caches die Phalcon beschikbaar heeft",
  "community": "Gemeenschap",
  "consulting": "Consultatie",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO</a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO</a> congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO</a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Contact LEZGRO through our <a href=':1:'>website</a>, where you can also see samples and testimonials of our work.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Neem contact op met ons via onze <a href=':1:'>website</a>, waar je de projecten kunt bekijken, waar we bij betrokken zijn.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Bijdragen",
  "contributors": "Phalcon medewerkers",
  "contributors_description": "Phalcon is improved everyday by our amazing community",
  "crypt": "Crypt",
  "crypt_description": "Encrypt/Decrypt belangrijke data om deze te beschermen tegen niet-geautoriseerde derde partijen",
  "data_and_storage": "Gegevens & opslag",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon is gebouwd op een krachtig en toch gemakkelijk te begrijpen en te gebruiken patroon 'Dependency Injection' genoemd. Je hoeft slechts een maal alle diensten te initialiseren of definiëren, daarna kun je ze vrijwel overal gebruiken in de toepassing.",
  "dependency_injection_2": "Create the Dependency Injector Container",
  "dependency_injection_3": "Registreren van klassen, functies, componenten",
  "dependency_injection_4": "Gebruik overal waar je wilt in de code",
  "dependency_injection_description": "Dependency Injection and Location of services and it's itself a container for them.",
  "discord": "Discord",
  "docs": "Documenten",
  "documentation": "Documentatie",
  "donate": "Doneer",
  "download": "Download",
  "download_arch": "Arch Linux",
  "download_arch_1": "Er is een PKGBUILD voor ArchLinux <a href=':1:'>hier</a> beschikbaar",
  "download_box_1": "Box #1",
  "download_box_2": "Box #2",
  "download_box_doc_root": "Document Root: :1:",
  "download_box_user_pass": "MySQL User: :1: Password: :2:",
  "download_compilation": "Compilatie",
  "download_compilation_1": "In Linux kun je de extensie makkelijk compileren en installeren vanuit de broncode.",
  "download_compilation_11": "1. Volg volgende stappen om de extensie vanaf C code te creëren:",
  "download_compilation_12": "2. Voeg de extensie toe aan je php.ini:",
  "download_compilation_13": "3. Herstart je webserver",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "After requests from the community, the cPanel developers released a custom module that allows for installation of Phalcon in cPanel hosted sites. Information can be found <a href=':1:'>here</a>. The module is maintained in <a href=':2:'>Github</a>.",
  "download_dependencies": "Afhankelijkheden",
  "download_dependencies_1": "Hoewel Phalcon niet binair gekoppeld is aan andere extensie worden sommige hiervan wel gebruikt voor bepaalde functionaliteit. De gebruikte extensies zijn:",
  "download_dependencies_2": "It is not necessary for all the above extensions to be present in the system that has Phalcon installed. You can only install the ones that meet your needs. For instance if you use a MySQL database, then you can only load PDO and PDO/MySQL ignoring the Oracle, SQlite, Postgresql and Mongo.",
  "download_developer_tools": "Hulpmiddelen voor ontwikkelaars",
  "download_devtools_1": "Deze tools zijn een verzameling van handige scripts om skelet code te genereren. Kerncomponenten voor je verzameling kunnen gegenereerd worden met een simpel commando, waardoor je makkelijk applicaties kan ontwikkelen met Phalcon.",
  "download_devtools_composer": "Installeren via Composer",
  "download_devtools_composer_1": "Installeer composer in een gemeenschappelijke locatie of in je project:",
  "download_devtools_composer_2": "Creëer het composer.json bestand op deze manier:",
  "download_devtools_composer_3": "Draai de composer installer:",
  "download_devtools_composer_4": "Creëer een symbolic link naar het phalcon.php script:",
  "download_devtools_docs": "Documentatie: <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "Je kunt van een cross-platform-pakket downloaden of klonen met de Ontwikkelaarshulpmiddelen van <a href=':1:'> Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Er zijn veel manieren om Phalcon met Docker te gebruiken.",
  "download_docker_2": "Onze officiële beelden bevinden zich <a href=':1:'> hier</a>. We verwelkomen altijd pull requests en verbeteringen. De opslagplaats voor de docker bestanden bevindt zich hier:",
  "download_docker_3": "With Phalcon-compose you can create an isolated environment with docker, that will allow you to use Phalcon without any additional installations. Note that using Phalcon Compose, requires ",
  "download_docker_4": "en",
  "download_docker_5": "Diensten",
  "download_docker_6": "Phalcon Compose biedt standaard de volgende services",
  "download_docker_7": "Phalcon Compose is very easy to use. Assume that you need to create an application that will be located in: ",
  "download_docker_8": "We will now need to run the following command for our container application can be created:",
  "download_docker_9": "The above command will download the skeleton of the docker environment.",
  "download_docker_10": "Variabelen",
  "download_docker_11": "Je dient een nieuw bestand aan te maken met de naam",
  "download_docker_12": "in",
  "download_docker_13": "Een voorbeeld bestand is beschikbaar genaamd",
  "download_docker_14": "Pas de variabelen aan in het bestand naar jouw wensen. De meest belangrijke variabele is de",
  "download_docker_15": "Change the name to something you will be able to use. In our case we just leave the default called ",
  "download_docker_16": "Open your hosts file (<code>/etc/hosts</code>) and enter a new line like this:",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Versie",
  "download_docker_19": "Je kunt nu de omgeving opstarten.",
  "download_docker_20": "Containers will be downloaded as needed and set up on your environment.",
  "download_docker_21": "Opstart",
  "download_docker_22": "Je kunt nu de omgeving opstarten",
  "download_docker_23": "Go to :1: in your browser and you will see your environment is set up. You can now develop your application in the app folder.",
  "download_docker_24": "Afsluiten",
  "download_docker_25": "Voor het afsluiten van de omgeving wanneer deze niet langer nodig is, kun je het volgende commando invoegen:",
  "download_docker_26": "Aanvullende informatie kun je vinden op:",
  "download_examples": "Voor-geïnstalleerde voorbeelden",
  "download_examples_1": "De volgende voorbeelden zijn voor-geïnstalleerd op elke vagrant box:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Er is een port beschikbaar voor FreeBSD. Je moet alleen de volgende commando's volgen om het te installeren:",
  "download_ide_stubs": "IDE stubs",
  "download_ide_stubs_1": "De video hieronder schetst het inschakelen van IDE stubs voor PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Hulp nodig?",
  "download_need_help_1": "Neem een kijkje op onze <a href=':1:'> ondersteuningspagina</a> voor manieren om ondersteuning te krijgen. Wij zullen ons best doen om u te helpen.",
  "download_note": "Phalcon is een C extensie, dus moet je de binary voor je platform downloaden of het vanaf de broncode compileren.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Er is een pakket beschikbaar <a href=':1:'> hier</a> (met dank aan <a href=':2:'> Mariusz Łączak</a>)",
  "download_requirements": "Vereisten",
  "download_requirements_1": "Enkele packages moeten op voorhand geïnstalleerd zijn:",
  "download_requirements_2": "PHP 5.x ontwikkelbronnen",
  "download_requirements_3": "GCC compiler",
  "download_source_code": "Broncode: <a href=':1:' target='_download' title='GitHub Repo'> github</a>",
  "download_source_code_switch": "Source Code (schakelt u naar de desbetreffende tak): <a href=':1:' target='_download' title='GitHub Repo'> github</a>",
  "download_ubuntu": "Om Phalcon op Ubuntu te installeren dien je de volgende stappen te volgen:",
  "download_ubuntu_1": "Als je het commando apt-add-repository mist, voer dan het volgende commando uit:",
  "download_ubuntu_2": "Als je een oudere versie van Phalcon (1.x) wilt installeren, gebruik de volgende PPA: ",
  "download_ubuntu_or_debian": "Ubuntu of Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'> Vagrant </a> is een uitstekend hulpmiddel voor het maken en configureren van lichtgewicht en reproduceerbare ontwikkelomgevingen.",
  "download_vagrant_2": "Gebruik een van de volgende 'boxes' om Phalcon te testen of ontwikkelen in een voor-geconfigureerde omgeving.",
  "download_vagrant_boxes": "Vagrant Boxes",
  "download_windows": "Windows DLL 's",
  "download_windows_download": "Download",
  "download_windows_dlls": "Windows DLLs kunnen <a href=':1:'>hier</a> gedownload worden van onze Github versie pagina ",
  "download_windows_guides": "Gerelateerde handleidingen",
  "download_windows_guides_wamp": "Installatie op WAMP",
  "download_windows_guides_xampp": "Installatie op XAMPP",
  "download_windows_installation": "Installatie",
  "download_windows_installation_1": "Voor het gebruik van phalcon op Windows kun je een DLL-bibliotheek downloaden. Bewerk het php.ini bestand en voeg aan het einde toe en start opnieuw de webserver op om de uitbreiding te laden. <a href=':1:'> meer</a>.",
  "download_windows_note": "We raden ten zeerste aan om de nieuwste versie van PHP te gebruiken dat overeenkomt met onze DLLs. Op deze manier kan je het meest gebruik maken van de mogelijkheden die Phalcon aanbiedt.",
  "download_windows_older": "Oudere versies",
  "download_windows_stable": "Stabiele/Master versies",
  "encryption": "Encryptie",
  "encryption_1": "Phalcon biedt encryptie faciliteiten via de Phalcon\\Crypt-component. Deze klasse biedt eenvoudige object-georiënteerde wrappers naar de PHP openssl codering bibliotheek.",
  "encryption_2": "Dit is een geheime sleutel (32 bytes).",
  "encryption_3": "Dit is de tekst, die je wilt versleutelen.",
  "events": "Gebeurtenissen",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Evenementen Management",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Maak een events manager",
  "events_management_3": "Listen for events produced in the dispatcher using the Security plugin",
  "events_management_4": "Handle exceptions and not-found exceptions using NotFoundPlugin",
  "events_management_5": "Assign the events manager to the dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Flash Berichten",
  "flash_messages_1": "Gebruik de flash component om meldingen aan een gebruiker in een webtoepassing weer te geven:",
  "flash_messages_2": "er zijn fouten in dit formulier",
  "flash_messages_3": "ja!, alles verliep zeer vlot",
  "flash_messages_4": "dit is een bericht voor gebruikers",
  "flash_messages_5": "dit is alleen een waarschuwing",
  "flash_messages_description": "Flashberichten worden gebruikt om de gebruiker over de status van de acties te informeren.",
  "forms_builder": "Formulier bouwer",
  "forms_builder_1": "Elk element in de vorm kan worden weergegeven, zoals gewenst door de ontwikkelaar. Intern, Phalcon\\Tag wordt gebruikt om de juiste HTML-code voor elk element te genereren en je kunt extra HTML-kenmerken als een tweede parameter aan de functie render() doorgeven:",
  "forms_builder_2": "Home",
  "forms_builder_3": "Mobiele telefoon",
  "forms_builder_description": "Eenvoudig HTML-formulieren maken",
  "forum": "Forum",
  "gab": "Gab.Ai",
  "get_phalcon": "Verkrijg Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "De innovatieve architectuur maakt Phalcon het snelste PHP framework ooit gebouwd!",
  "header_tagline": "Een full-stack PHP framework geleverd als een C-extensie",
  "high_performance_php_framework": "Hoge Performance PHP Framework",
  "hosting": "Webhosting",
  "hosting_amazon_ec2_1": "Amazon Elastic Complete Cloud levert schaalbare, pay-as-you-go capaciteit in the cloud.",
  "hosting_amazon_ec2_2": "Select a pre-configured, templated Amazon Machine Image (AMI) to get up and running immediately. Or create an AMI containing your applications, libraries, data, and associated configuration settings. <a href=':1:'>See more</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows shared web hosting packages and plans, no configuration or installation required! They offer a variety of PHP versions from 5.2 - 7.0 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "The <a href=':1:'>Windows Azure cloud</a> provides you with highly scalable and manageable Windows hosting for your web apps. Use Phalcon to reduce your instance costs.",
  "hosting_azure_2": "Om Phalcon te installeren kun je dit <a href=':1:'>dit SitePoint artikel</a> artikel stap-voor-stap volgen.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon kan geïnstalleerd worden op elke machine waarbij de hosting provider SSH root access (of sudo) bij aanbiedt. Hieronder vind je een lijst met respectabele bedrijven dat zulke diensten aanbieden:",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
  "hosting_digital_ocean_2": "<p>Volg deze <a href=':1:'>tutorial</a> om te beginnen</p>",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host offers multiple affordable and high quality hosting plans.",
  "hosting_dcthost_2": "By default, they have Phalcon installed on all their shared hosting packages.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit biedt verschillende hosting plannen aan (er is een voor ontwikkelaars dat gratis is - met enkele limitaties) dat aan de noden voldoet van de meeste ontwikkelaars die Phalcon willen uitproberen of hun applicaties ermee willen deployen.",
  "hosting_fortrabbit_2": "Ze bieden een uitgebreide variëteit aan van <a href=':1:'>extensies</a> die moeten voldoen aan zelfs de meest veeleisende projecten.",
  "hosting_fortrabbit_3": "Stabiele versies van Phalcon zijn op voorhand geïnstalleerd, je kan deze activeren vanaf het administration dashboard.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Installeer Phalcon met de standaard installatie instructies.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "Jij brengt de code, wij regelen de servers. Volgende generatie, automatisch schalende PaaS voor PHP.",
  "hosting_layershift_2": "<p>Volg deze <a href=':1:'>tutorial</a> om te beginnen</p>",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Servers zijn virtuele machines die dat een Linux of Windows&reg; Server draaien in de Rackspace Cloud. Je kunt bronnen zoals CPU, RAM en geheugen schalen, afhankelijk van wat je nodig hebt. En het beste van alles is hun \"pay as you go\" model. <a href=':1:'>Lees meer</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting voor developers. Volledige shell access tot snelle servers met al je favoriete tools op voorhand geïnstalleerd en onderhouden voor de gebruiker.",
  "hosting_webfaction_2": "Om PhalconPHP te installeren op WebFaction, volg <a href=':1:'>deze</a> instructies",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Vraag de browser wat de beste taal is",
  "i18n_3": "Kijk of we een vertaling hebben voor deze taal",
  "i18n_4": "Val terug naar een standaard",
  "i18n_5": "Return a translation object",
  "i18n_description": "Gemakkelijk uw toepassingen in vele talen vertalen",
  "installing_phalcon_php": "Phalcon PHP installeren",
  "issue_tracker": "Issue Tracker",
  "join_our_community": "Doe mee met onze levendige ontwikkelaargemeenschap!",
  "join_our_community_description": "Bijdragen van de Gemeenschap aan extensies, Plugins, Adapters, VM, voorbeelden, broncode... en meer",
  "language_text": "Engels",
  "learn": "Leer",
  "license_new_bsd": "Phalcon is een open-source PHP framework <br /> gebouwd als een C-extensie. Het is beschikbaar onder de <br /> <a href='http: //opensource.org/licenses/BSD-3-Clause' target='_blank'> Nieuwe BSD-licentie</a>.",
  "low_overhead": "Weinig overhead",
  "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
  "low_overhead_2": "Klassen en functies gegenereerd door de extensie zijn klaar voor gebruik voor elke toepassing",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
  "low_overhead_description": "Laag geheugengebruik en CPU in vergelijking met traditionele frameworks",
  "low_overhead_title": "PHP C-extensie (Phalcon)",
  "more": "MEER...",
  "mvc": "MVC",
  "mvc_1": "Single- en multi module toepassingen bouw je met gemak en plezier. Gebruik een bestandsstructuur, schema en patronen die je al kent.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, onderdelen, modellen, weergaven en controllers",
  "odm_for_mongo": "ODM voor Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "Hoeveel robots zijn er?",
  "odm_for_mongo_3": "Hoeveel mechanische robots zijn er?",
  "odm_for_mongo_4": "Er zijn :1: robots",
  "odm_for_mongo_description": "Object Document toewijzing voor MongoDB",
  "oops": "Houston, we hebben een probleem!",
  "or": "of",
  "orm": "ORM",
  "orm_1": "Een krachtige ORM wordt gegenereerd door Phalcon, opdat je voor het bewerken van databaserecords deze als klassen en objecten kunt gebruiken. PostgreSQL, MySQL en SQLite worden standaard ondersteund.",
  "orm_description": "Object-relationele Mapping",
  "phalcon_team": "Phalcon Team",
  "phalcon_team_1": "Veel meer mensen",
  "phalcon_team_2": "Phalcon is en is altijd een inspanning van vele vrijwilligers geweest: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Naam",
  "phql_description": "De krachtige en veilige Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Verbinden met de wachtrij",
  "queueing_3": "Invoegen van de taak in de wachtrij",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Middelen",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Restful Services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Ontvangen gegevens in JSON",
  "roadmap": "Roadmap",
  "router": "Router",
  "router_1": "Routering zoals het zou moeten werken. Niets meer. Niets minder.",
  "router_2": "Maken van de router",
  "router_3": "Definiëren van een route",
  "router_description": "Phalcon\\Mvc\\Router biedt geavanceerde mogelijkheden voor routering.",
  "sample_applications": "Voorbeeld Applicaties",
  "see_for_yourself": "Zie voor jezelf...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Er is iets fout gegaan :(",
  "sponsored_by": "Gesponsord door",
  "sponsors": "Sponsoren",
  "sponsors_and_supporters": "Sponsors en Supporters",
  "sponsors_and_supporters_upper": "SPONSORS EN SUPPORTERS",
  "sponsors_become_patron": "Become a Patron!",
  "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "Dit zijn onze sponsors! Dank je wel!!",
  "stack_overflow": "Stack Overflow",
  "store": "Winkel",
  "support": "Hulp",
  "support_discord": "Come join the Phalcon <a href=':1:'>Discord</a>",
  "support_documentation_1": "Gebruik allereerst de :1:. Je kan ook de zoekfunctie in onze documenten gebruiken om te vinden waar je naar zoekt. Als je vraag nog niet beantwoord is zijn er hieronder nog opties.",
  "support_download_page": "download pagina",
  "support_note_1": "Our great community and contributors are happy to help you though! Please use these community resources for obtaining help.",
  "support_note_2": "Veel bugs komen boven, omdat gebruikers de laatste versie niet gebruiken. Bezoek :1:, download de laatst beschikbare versie (of compileer het) en bevestig of het probleem, dat je hebt, daadwerkelijk een bug is.",
  "support_phalcon_forum": "Questions should go to <a href=':1:'>Official Forums</a>",
  "support_please_note": "Let op:",
  "support_please_note_1": "Stack Overflow is er niet om Phalcon te ondersteunen",
  "support_please_note_2": "Meld hier a.u.b. geen nieuwe bugs. Gebruik hiervoor de <a href=':1:'>issue tracker</a> in Github.",
  "support_please_note_3": "Vraag hier a.u.b. niet om nieuwe features. Gebruik hiervoor de <a href=':1:'>issue tracker</a> in Github.",
  "support_please_note_4": "Zorg ervoor dat je een 'phalcon' tag toevoegd aan je vraag",
  "support_please_note_5": "Zorg ervoor dat je 'Phalcon' vermeld in je vraag",
  "support_reporting_a_bug": "Een bug melden",
  "support_reporting_a_bug_0": "Wanneer je overtuigd bent, dat wat je gevonden hebt echt een bug is, <a href=':1:'>open een ticket</a> aub",
  "support_reporting_a_bug_1": "Meld bugs wanneer je alle bovenstaande opties uitgeprobeerd hebt, door gebruik van de <a href=':1:'>issue tracker</a> op Github.",
  "support_slack": "Er is een minder actieve, maar bestaande community op <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Een andere manier is een vraag te stellen op <a href=':1:' target='_blank'>Stack Overflow</a> en er het label <a href=':2:'><code>phalcon</code></a> aan te geven",
  "support_social_network_accounts": "Onze social media accounts zijn: <a href=':1:'>Gab.ai</a> , <a href=':2:'>Twitter</a>, <a href=':3:'>Facebook</a> en <a href=':4:'>Google+</a>",
  "support_us": "Ondersteun ons",
  "team": "Team",
  "team_andres_1": "Andres is geen onbekende voor open source projecten. Tijdens de laatste 9 jaar heeft hij PHP frameworks ontworpen en is met web development bezig geweest, zijn voornaamste passie.",
  "team_andres_2": "Een TR35 winnaar. Andres' voornaamste drijfveer is om altijd de juiste \"tool for the job\" te kiezen en implementeren, vooral gefocused op performantie. Daardoor kreeg hij in 2011 het idee om een nieuw soort framework voor PHP ontwikkelaars te creëeren, één dat een focus heeft op bruikbaarheid, functionaliteiten en vooral performantie.",
  "team_andres_3": "Door deze nieuwe, innovatieve benadering is Phalcon ontstaan. Een PHP-framework geschreven in C dat een schat aan functionaliteiten biedt terwijl het de prestaties maximaliseert en het gebruik van resources laag houdt.",
  "team_andres_4": "Andres is een van de kern ontwikkelaars en de inspiratie van Phalcon.",
  "team_eduar_1": "Eduar is een C/PHP ontwikkelaar met meerdere jaren ervaring in applicatie ontwikkeling. Hij is een van de oprichters en hoofd ontwikkelaars van het Phalcon project, dat begon in 2011.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar likes science fiction movies and sometimes plays football.",
  "team_nikolay_1": "Nikolay ontwikkeld reeds 10 jaar webapplicaties. Hij is betrokken geweest in zowel high performance als complexe websites en ontwerpen.",
  "team_nikolay_2": "Nikolay werkt reeds lange tijd met Open Source projecten, en gebruikt ze wanneer de requirements het toelaten. Hierdoor begon hij met zijn persoonlijke tijd te geven aan de gemeenschap, door projecten te forken, en veranderingen ten voordele van zowel de architectuur en de performantie voor te stellen. Zijn werk is zeer gunstig voor het verbeteren van Open Source CMS projecten en ontving steeds positieve feedback van de gemeenschap.",
  "team_nikolay_3": "Zijn voortdurende betrokkenheid met open source projecten heeft hem geholpen zijn technische kennis uit te breiden en tegelijk veel aan de gemeenschap terug te geven.",
  "team_nikolay_4": "Nikolay is een enthousiast voorstander van het maximalizeren van de performantie van web applicaties. Na zijn introductie tot Phalcon heeft hij beslist het te gebruiken, verbeteren en het woord erover te verspreiden. Hij leidt ook de Russische Phalcon gemeenschap en biedt bronnen aan voor de Russisch sprekende ontwikkelaars.",
  "team_nikolay_5": "His contributions include:  A mirror of the main website in Russian (<a href=':1:'>http://www.phalcon.ru</a>), a mirror of the documentation repository in Russian (<a href=':2:'>http://docs.phalconphp.ru</a>), ongoing changes and corrections to the documentation in English, a group in the social network Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos is reeds 20 jaar actief in de IT industrie. Hij werd in 2000 geïntroduceerd tot de PHP wereld en gebruikt het sindsdien voor zowel persoonlijke als professionele projecten.",
  "team_nikos_2": "Hij houdt van het ontdekken van nieuwe technologieën en manieren om deze te integreren met bestaande applicaties en de voordelen hiervan te bekomen.",
  "team_nikos_3": "Hij is een groot voorstander van Test Driven Development (TDD) and tracht steeds tests te maken voor zijn volledige code.",
  "team_nikos_4": "Nikos's voortdurende interesse in nieuwe en innovatieve technologieën die de norm doorbreken bracht hem bij Phalcon. Hij voegde zich toe aan het kern team en zijn taken hebben vooral te maken met de coördinatie van NFRs en bug fixes, hulp met de tests, documentatie en de incubator. Nikos is ook verantwoordelijk voor het onderhouden van de Windows DLLs voor het project en bied hulp aan wanneer mogelijk.",
  "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
  "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
  "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
  "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Sjabloon-Engine (Volt)",
  "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
  "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
  "template_engines": "Sjabloon Engines",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Views represent the user interface of your application",
  "testimonials": "Getuigenissen",
  "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits:  ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1хP4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing: )  Michael.",
  "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing! Best regards, Nikita Vershinin, Lead Developer, Kolesa.kz and krisha.kz",
  "testimonials_3": "Phalcon Team, het framework dat jullie gemaakt hebben is geweldig. Ik heb nog nooit een framework gebruikt dat op zo'n manier snelheid, efficiëntie, beknoptheid combineerd in een enkel pakket. Ik ben van plan om het project te verdedigen en er toe bij te brengen op elke manier dat ik kan. Ik vertrok pas op een ~800 uur durend project en ik ben blij te zeggen dat we Phalcon gebruiken. Bravo. Brian Seymour",
  "testimonials_4": "Hallo iedereen, ik kwam Phalcon net tegen en het is geweldig! Ik wou enkel laten weten hoe geweldig jullie zijn! Dus bedankt voor dit framework en keep up the good work! Ivan Penchev",
  "testimonials_5": "Hi Guys, i wrote simple url-shortener service with phalcon. That was amazing! really. <a href=':1:'>:2:</a>. Demo is here: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Hello Phalcon Team, I created a small project designed for Polish users using your framework. I have to admit that the performance is amazing, congratulations good job. Service to validate the content of the web pages in Polish language <a href=':1:'>:2:</a>",
  "testimonials_7": "Hi guys! Just wanted to share with you the latest release of our old project - <a href=':1:'>:2: </a>. Switching to phalcon allowed us to halve the server load compared to the previous framework, which is great!",
  "testimonials_description": "Below is a collection of testimonials and success stories, from you, the developers and users of Phalcon PHP. We always welcome emails with success stories and will be posting those in our blog. If you wish to send us your success story or get in touch with us, feel free to mail us at <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Wissel de navigatie",
  "transactions": "Transacties",
  "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
  "transactions_2": "Een transactie manager maken",
  "transactions_3": "Verzoek een transactie",
  "transactions_4": "Verwijder de robots",
  "transactions_5": "Something's gone wrong, we should rollback the transaction",
  "transactions_6": "Everything's gone fine, let's commit the transaction",
  "transactions_7": "Robots zijn succesvol verwijderd!",
  "transactions_8": "Mislukt, oorzaak: ",
  "transactions_description": "Met transacties in Phalcon kun je de integriteit van de gegevens veilig en intact houden.",
  "try_phalcon": "Probeer Phalcon",
  "tutorial": "Handleiding",
  "twitter": "Twitter",
  "views_and_frontend": "Weergaven & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Bekijk de demo video",
  "zephir": "Zephir"
}