{
  "about": "Sobre",
  "about_blog": "BLOG",
  "about_blog_1": "Se você gosta de escrever, lembre-se que <a href=':1:'> nosso blog </ a> está aberto para postar tutoriais criados por você. Se você tem um blog de sua preferência e ter escrito algo sobre Phalcon, também podemos publicar em nossas páginas de redes sociais, de modo a atingir a máxima visibilidade. Se o seu blog está em um idioma diferente do Inglês, queremos compartilhá-lo e, potencialmente, traduzi-lo, se possível. Se você sabe sobre blogs relacionados ao PHP que estão interessados ​​em apresentar o projeto para o seu público, por favor nos avise.",
  "about_description_1": "Projetos surpreendentes precisam de mãos surpreendentes. Podemos ainda  não te conhecer , mas acho que você seria um grande ajuste para a construção de uma melhor web. Juntos, nós estamos prontos para mudar o mundo! Aqui no Phalcon, estamos construindo um novo quadro de geração para PHP, queremos dar-lhe um desempenho incrível, ajudando você a desenvolver de uma forma fácil e divertida.",
  "about_description_2": "We hope that you enjoy Phalcon as much as we do. We always welcome your collaboration and help! <strong>You don't have to be a C developer to help Phalcon!</strong> There are many other areas that you can contribute:",
  "about_documentation": "DOCUMENTAÇÃO",
  "about_documentation_1": "The repository of this website is available on <a href=':1:'>github</a>. We are using <a href=':2:'>readthedocs</a> to manage our documentation.<br /><br />We always appreciate corrections, additions and enhancements in our documentation, so all you have to do is clone the repository and issue a pull request!<br /><br />If you can help non English speaking developers by translating some of the content to another language, that would be great!",
  "about_donations_sponsoring": "DOAÇÕES / PATROCÍNIO",
  "about_evangelism": "EVANGELISMO",
  "about_evangelism_1": "Há um monte de pessoas que ainda não sabem que Phalcon existe ou que ele realmente funciona. Estamos certos de que muitos desenvolvedores se beneficiarão ouvindo o que Phalcon é sobre tudo de como ele pode ajudá-los. Se você souber de qualquer evento  ou reuniões de  PHP  e deseja dar uma palestra sobre o projeto, você tem o nosso total apoio. Quem não gostaria de saber sobre a ferramenta que está revolucionando o desenvolvimento em PHP?",
  "about_facebook_page": "Página do Facebook",
  "about_flying_with_phalcon": "Obrigado por voar com Phalcon! &Lt;3",
  "about_follow_on_gab": "Siga-nos no Gab",
  "about_follow_on_twitter": "Siga-nos no Twitter",
  "about_google_plus_page": "Google+ Page",
  "about_official_blog": "Blog Oficial",
  "about_sample_applications": "SAMPLE APPLICATIONS",
  "about_sample_apps_1": "Grandes exemplos ajudam os outros a entender melhor como as coisas grandes podem ser criados com Phalcon. Sinta-se livre para compartilhar repositórios, ajudando outros com o seu trabalho e permitindo que lhe deem  feedback sobre o seu trabalho também!",
  "about_screencasts": "SCREENCASTS",
  "about_screencasts_1": "Nós todos amamos screencasts. Se você tiver algum tempo extra e quer apoiar a comunidade com alguns vídeos  ​​de ensino de qualquer das características do framework, seja muito bem-vindo. Confira nosso <a href=':1:'> Vimeo Canal </ a> como um guia.",
  "about_share_experiences_1": "Não seja tímido, sinta-se livre para compartilhar as formas através das quais Phalcon foi útil para você com a comunidade. Se Phalcon é um caso de sucesso para você, vamos compartilhar isso com a comunidade. Além disso, discutir quais os componentes precisaram de trabalho extra, o que poderia fazer isso fácil, quais os benefícios que você tem usando Phalcon. Apesar de tudo não poder ser implementado imediatamente, sua entrada em novos pedidos de recurso pode ajudar muito nos moldar o futuro do projeto. O seu feedback ajuda a todos nós.",
  "about_share_your_experiences": "COMPARTILHE SUAS EXPERIÊNCIAS",
  "about_social_networks": "REDES SOCIAIS",
  "about_social_networks_1": "Phalcon está evoluindo em uma base diária, através do nosso desejo de torná-lo melhor. As redes sociais são parte de nossas vidas agora, e todos nós interagimos com os outros através delas. Compartilhando sua experiência com Phalcon em seus círculos sociais você aumentará muito a visibilidade do projeto. Mais e mais pessoas vão se envolver em nossa comunidade, tornando-o mais poderoso, mais rico em recursos e popular. Por exemplo, dê um '+1', compartilhe mensagens que estamos constantemente postando em todas as redes sociais, participe das discussões destes postagens. As pessoas que descobrirem Phalcon através de suas interações irão agradecê-lo!",
  "about_social_networks_2": "Nós temos presença na maioria das redes sociais mais populares. Seguindo-nos, você está nos ajudando a aumentar a visibilidade do projeto:",
  "about_sponsoring_1": "Nós somos uma  pequena, mas eficaz equipe de desenvolvedores . Tentamos passar o máximo de tempo possível no projeto. Toda a nossa paixão por este projeto nos faz querer ser melhor a cada dia. Phalcon é um software open-source, e esforços voluntários são necessários para sua constante evolução. Você pode nos ajudar a manter o desenvolvimento ativo, doando para o projeto ou patrocinando o desenvolvimento. Mais tempo e recursos dedicados ao projeto significa mais atividade, mais melhorias, melhor suporte, características mais surpreendentes, etc.",
  "about_star_on_github": "Favorite o projeto no Github",
  "about_tests": "TESTES",
  "about_tests_1": "Nenhum software é livre de erros. Se você encontrar algum, por favor, não hesite em nos dizer. Temos um testsuite com mais de <a href=':1:'> 16,000 </ a> testes. No entanto, testes unitários nunca são suficientes. Ajude-nos a melhorar a nossa testsuite adicionando mais testes ou melhorando  os atuais. Cada teste adicionado faz com que o framework seja mais estável.",
  "about_thank_you": "OBRIGADO!",
  "about_thank_you_1": "Gostaríamos de agradecer a todos os contribuidores e membros da comunidade por nos impulsionar a tornar Phalcon o melhor framework de seu tipo. Suas palavras gentis e envolvimento são o que nos mantém a fazer o melhor. Esperamos encontrar e exceder a confiança que vocês depositam no Phalcon.",
  "about_translations": "TRADUÇÕES",
  "about_translations_1": "Estamos buscando alcançar quantos desenvolvedores o possível, rompendo as barreiras de idiomas. Estamos utilizando <a href=':1:'>:2:</a>, para manipular todas as palavras ou frases que precisam ser traduzidas para este site. O repositório do projeto está localizado <a href=':3:'>aqui</a> e abaixo você pode ver o status atual dos nossos esforços de tradução.",
  "acl": "ACL",
  "acl_1": "É assim que você pode criar a lista de controle de acesso (ACL):",
  "acl_2": "Criar a ACL",
  "acl_3": "The default action is DENY access",
  "acl_4": "Register two roles, Users is registered users",
  "acl_5": "and guests are users without a defined identity",
  "acl_description": "Access Control List allows users to access the modules they're authorized to",
  "api": "API",
  "auto_loader": "Autoloader",
  "auto_loader_1": "Registre namespaces, prefixos, diretórios ou classes. Aproveite os eventos do carregador automático e mantenha controle total sobre quais arquivos são carregados e de onde.",
  "auto_loader_2": "Creates the autoloader",
  "auto_loader_3": "Register some namespaces",
  "auto_loader_4": "Register autoloader",
  "autoloader": "Autoloader",
  "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.",
  "basic_features": "Basic Features",
  "blog": "Blog",
  "built_with_phalcon": "Built with Phalcon",
  "cache": "Cache",
  "cache_1": "O componente de cache permite um acesso mais rápido aos dados usados com freqüência ou já processados. Suporta muitos backends tais como Redis, Memcached, Mongo, Aqruivos, Apc e mais",
  "cache_2": "Set the models cache service",
  "cache_3": "Cache data for one day by default",
  "cache_4": "Memcached connection settings",
  "cache_description": "Improve your performance with many of the backend caches that Phalcon provides",
  "community": "Comunidade",
  "consulting": "Consultoria",
  "consulting_header": "We have partnered with <a href=':1:'>LEZGRO<\/a>, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "<a href=':1:'>LEZGRO<\/a> congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve <a href=':1:'>LEZGRO<\/a> to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Contact LEZGRO through our <a href=':1:'>website</a>, where you can also see samples and testimonials of our work.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Contact us through our <a href=':1:'>website</a>, where you can take a look at the projects we have been involved in.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Contribute",
  "contributors": "Contribuidores Phalcon",
  "contributors_description": "Phalcon é melhorado todos os dias por sua incrível comunidade",
  "crypt": "Crypt",
  "crypt_description": "Encrypt/Decrypt important data to keep them safe from unauthorized third-parties",
  "data_and_storage": "Data & storage",
  "dependency_injection": "Dependency Injection",
  "dependency_injection_1": "Phalcon is built upon a powerful yet easy to understand and use pattern called Dependency Injection. Initialize or define services once - and use them virtually anywhere throughout the application.",
  "dependency_injection_2": "Create the Dependency Injector Container",
  "dependency_injection_3": "Registrar classes, funções, componentes",
  "dependency_injection_4": "Use anywhere else in code",
  "dependency_injection_description": "Dependency Injection and Location of services and it's itself a container for them.",
  "docs": "Docs",
  "documentation": "Documentação",
  "donate": "Doação",
  "download": "Baixar",
  "download_arch": "Arch Linux",
  "download_arch_1": "Há um PKGBUILD para ArchLinux, disponível <a href=':1:'>aqui</ a>",
  "download_box_1": "Box #1",
  "download_box_2": "Box #2",
  "download_box_doc_root": "Document Root: :1:",
  "download_box_user_pass": "MySQL Usuário: :1: Senha: :2:",
  "download_compilation": "Compilação",
  "download_compilation_1": "No Linux, você pode facilmente compilar e instalar a extensão a partir do código fonte.",
  "download_compilation_11": "1. Para criar a extensão a partir do código fonte em C siga estes passos:",
  "download_compilation_12": "2. Adicione a extensão no seu php.ini:",
  "download_compilation_13": "3. Finalmente, reinicie o servidor web",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Após solicitações da comunidade, os desenvolvedores do cPanel lançaram um módulo personalizado que permite a instalação do Phalcon em sites hospedados pelo cPanel. As informações podem ser encontradas <a href=':1:'> aqui </a>. O módulo é mantido em <a href=':2:'> Github </a>.",
  "download_dependencies": "Dependências",
  "download_dependencies_1": "Embora Phalcon não seja vinculado à outras extensões, ele utiliza algumas delas para oferecer certas funcionalidades. As extensões utilizadas são:",
  "download_dependencies_2": "Não é necessário que todas as extensões acima estejam presentes no sistema onde Phalcon for instalado. Você pode instalar somente aquelas conforme suas necessidades. Por exemplo, se você usa um banco de dados MySQL, você pode então adicionar somente PDO e PDO/MySQL, ignorando as extensões Oracle, SQLite, Postgresql e Mongo.",
  "download_developer_tools": "Ferramentas para Desenvolvedores",
  "download_devtools_1": "Estas ferramentas são uma coleção de scripts úteis para gerar o esqueleto de código. Componentes do Core de sua aplicação podem ser gerados através de um simples comando, permitindo a você facilmente desenvolver aplicações com Phalcon.",
  "download_devtools_composer": "Instalação via Composer",
  "download_devtools_composer_1": "Instale o Composer em um local comum ou em seu projeto:",
  "download_devtools_composer_2": "Crie o arquivo composer.json da seguinte forma:",
  "download_devtools_composer_3": "Execute a instalação pelo composer:",
  "download_devtools_composer_4": "Crie um link simbólico para o script phalcon.php:",
  "download_devtools_docs": "Documentação: <a href=':1:'>Ferramentas para Desenvolvedores Phalcon</a>",
  "download_devtools_download": "Você pode baixar ou clonar um pacote independente de plataforma contendo as ferramentas de desenvolvimento através do <a href=':1:'>Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Há muitas maneiras que você pode usar Phalcon com Docker.",
  "download_docker_2": "Our official images are located <a href=':1:'>here</a>. We always welcome pull requests and improvements. The repository for the docker files is located here:",
  "download_docker_3": "Com Phalcon-compose você pode criar um ambiente isolado com docker, que permitirá que você use Phalcon sem qualquer instalação adicional. Note que a utilização Phalcon Compose, exige",
  "download_docker_4": "e",
  "download_docker_5": "Serviços",
  "download_docker_6": "Phalcon Compose oferece os seguintes serviços por padrão:",
  "download_docker_7": "Phalcon Compose é muito fácil de usar. Suponha que você precise criar um aplicativo que será localizado em:",
  "download_docker_8": "We will now need to run the following command for our container application can be created:",
  "download_docker_9": "The above command will download the skeleton of the docker environment.",
  "download_docker_10": "Variáveis",
  "download_docker_11": "Você precisará criar um novo arquivo chamado",
  "download_docker_12": "in",
  "download_docker_13": "Um arquivo de exemplo foi fornecido chamado",
  "download_docker_14": "Adjust the variables in that file to suit your needs. The most important variable is the",
  "download_docker_15": "Change the name to something you will be able to use. In our case we just leave the default called ",
  "download_docker_16": "Open your hosts file (<code>/etc/hosts</code>) and enter a new line like this:",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Build",
  "download_docker_19": "You can now build the environment.",
  "download_docker_20": "Containers will be downloaded as needed and set up on your environment.",
  "download_docker_21": "Launch",
  "download_docker_22": "You can now launch the environment:",
  "download_docker_23": "Go to :1: in your browser and you will see your environment is set up. You can now develop your application in the app folder.",
  "download_docker_24": "Encerrar",
  "download_docker_25": "Para encerrar o ambiente quando não é mais necessário, você pode emitir o seguinte comando:",
  "download_docker_26": "Informações adicionais podem ser encontradas em:",
  "download_examples": "Exemplos pré-instalados",
  "download_examples_1": "Os seguintes exemplos estão pré-instalados em cada box do vagrant:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Uma porta está disponível para FreeBSD. Você só precisa destes poucos comandos para instalá-lo:",
  "download_ide_stubs": "Integração com IDE",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Precisa de ajuda?",
  "download_need_help_1": "Confira em nossa <a href=':1:'>página de suporte</a> para saber formas de obter suporte. Faremos o nosso melhor para ajudar você.",
  "download_note": "Phalcon é uma extensão em C, então você precisará baixar um binário para a sua plataforma ou compilá-lo a partir do código fonte.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Há um pacote disponível <a href=':1:'> aqui </ a> ( graças a <a href=':2:'> Mariusz Łączak </ a> )",
  "download_requirements": "Requisitos",
  "download_requirements_1": "Precisamos de alguns pacotes previamente instalados:",
  "download_requirements_2": "Recursos de desenvolvimento com PHP 5.x",
  "download_requirements_3": "Compilador GCC",
  "download_source_code": "Código fonte: <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Código Fonte (por favor selecione o branch pertinente): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "To install Phalcon on Ubuntu or Debian you need to follow these steps:",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command:",
  "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
  "download_ubuntu_or_debian": "Ubuntu ou Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "O <a href=':1:'>Vagrant</a> é uma excelente ferramenta para criar e configurar ambientes de desenvolvimento leves, reproduzíveis e portáteis.",
  "download_vagrant_2": "Use qualquer uma das seguintes boxes para testar ou desenvolver com Phalcon em um ambiente previamente configurado.",
  "download_vagrant_boxes": "Vagrant Boxes",
  "download_windows": "DLLs para Windows",
  "download_windows_guides": "Guias Relacionados",
  "download_windows_guides_wamp": "Instalação no WAMPP",
  "download_windows_guides_xampp": "Instalação no XAMPP",
  "download_windows_installation": "Instalação",
  "download_windows_installation_1": "Para usar Phalcon no Windows, você pode baixar uma biblioteca em um arquivo DLL. Edite seu php.ini, acrescente a extensão no final, e reinicie o servidor para carregar a extensão. <a href=':1:'>Mais</ a>.",
  "download_windows_note": "Nós altamente recomendamos que você use a versão mais recente do PHP correspondente à nossas DLLs, de modo a aproveitar o conjunto completo de recursos de Phalcon.",
  "download_windows_older": "Versões anteriores",
  "download_windows_stable": "Stable/Master versions",
  "encryption": "Encriptação",
  "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
  "encryption_2": "This is a secret key (32 bytes).",
  "encryption_3": "Este é o texto que você deseja criptografar.",
  "events": "Eventos",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Gestão de Eventos",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Create an events manager",
  "events_management_3": "Listen for events produced in the dispatcher using the Security plugin",
  "events_management_4": "Handle exceptions and not-found exceptions using NotFoundPlugin",
  "events_management_5": "Assign the events manager to the dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Mensagens Rápidas",
  "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
  "flash_messages_2": "there were errors in this form",
  "flash_messages_3": "yes!, everything went very smoothly",
  "flash_messages_4": "este é um aviso para os usuários",
  "flash_messages_5": "este é apenas um aviso",
  "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
  "forms_builder": "Construtor de Formulários",
  "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
  "forms_builder_2": "Home",
  "forms_builder_3": "Celular",
  "forms_builder_description": "Easily create HTML forms",
  "forum": "Fórum",
  "gab": "Gab.ai",
  "get_phalcon": "Get Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "Sua arquitetura inovadora faz Phalcon o framework PHP mais rápido já construído!",
  "header_tagline": "A full-stack PHP framework delivered as a C-extension",
  "high_performance_php_framework": "High Performance PHP Framework",
  "hosting": "Hospedagem",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud oferece capacidade  de computação na nuvem pagando quanto puder.",
  "hosting_amazon_ec2_2": "Selecione um modelo pré-configurado da Amazon Machine Image (AMI) para começar a trabalhar imediatamente. Ou crie uma AMI contendo suas aplicações, bibliotecas, dados e configurações associadas. <a href=':1:'> Veja mais </ a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows shared web hosting packages and plans, no configuration or installation required! They offer a variety of PHP versions from 5.2 - 7.0 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "A <a href=':1:'>Nuvem do Windows Azure</a> fornece ambientes de hospedagem Windows de alta escalabilidade e gerenciamento para suas aplicações web. Use Phalcon para reduzir seus custos de instância.",
  "hosting_azure_2": "Para instalar o Phalcon, siga a rotina passo a passo descrita <a href=':1:'>neste artigo do SitePoint</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon pode ser instalado em qualquer máquina na qual o provedor de hospedagem oferece acesso de root por conexão SSH (ou sudo). Abaixo está uma lista de empresas conceituadas que oferecem esses serviços:",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
  "hosting_digital_ocean_2": "Siga este <a href=':1:'> tutorial </a> para começar",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_fortrabbit_1": "Fortrabbit oferece diversos planos de hospedagem (há um para desenvolvedores, e é gratuito - com algumas limitações) que podem satisfazer as necessidades da maiorias dos desenvolvedores que desejam tanto experimentar Phalcon ou desejam implantar suas aplicações com ele.",
  "hosting_fortrabbit_2": "Eles oferecem uma variedade de <a href=':1:'>extensões</a> que satisfazem até mesmo o projeto mais exigente.",
  "hosting_fortrabbit_3": "Versões estáveis ​​de Phalcon são pré-instaladas, você pode ativá-las a partir do painel de administração.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Instale Phalcon utilizando as instruções padrão de instalação.",
  "hosting_kinghost_1": "Presente no mercado desde 2006, a KingHost é uma das maiores empresas de hospedagem de sites do Brasil e já apresenta mais de 300 mil sites hospedados, com aproximadamente 60 mil clientes. Sediada em Porto Alegre (RS), com data centers no Brasil, a empresa oferece o serviço de hospedagem de sites compartilhada, planos específicos para desenvolvedores e projetos personalizados na área de soluções corporativas, incluindo cloud computing e servidores dedicados. Também oferece soluções de marketing digital, como e-mail marketing e soluções de segurança.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Siga este <a href=':1:'> tutorial </a> para começar",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
  "hosting_linode_title": "Linode",
  "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hospedagem para desenvolvedores. Acesso shell completo para servidores rápidos com todas as suas ferramentas favoritas pré-instaladas e mantidas para o usuário.",
  "hosting_webfaction_2": "Para instalar Phalcon no WebFaction, siga as instruções descritas <a href=':1:'>aqui</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Ask browser what is the best language",
  "i18n_3": "Check if we have a translation file for that lang",
  "i18n_4": "Fallback to some default",
  "i18n_5": "Return a translation object",
  "i18n_description": "Translate your applications to many languages easily",
  "installing_phalcon_php": "Instalando o Phalcon PHP",
  "issue_tracker": "Acompanhar Questões",
  "join_our_community": "Venha participar da nossa vibrante comunidade de desenvolvedores!",
  "join_our_community_description": "Community contributions in Extensions, Plugins, Adapters, VM, examples, source code... and more",
  "language_text": "Inglês",
  "learn": "Learn",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http: //opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Low overhead",
  "low_overhead_1": "Zephir/C extensions are loaded together with PHP one time on the web server's daemon start process",
  "low_overhead_2": "Classes and functions provided by the extension are ready to use for any application",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Thanks to its low-level architecture and optimizations <strong>Phalcon provides the lowest overhead for MVC-based applications</strong>",
  "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "MAIS...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC & HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM para Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "There are :1: robots",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Houston we have a problem!",
  "or": "ou",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Time Phalcon",
  "phalcon_team_1": "Many more people",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Nome",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "Um aplicativo de pesquisa construído a partir do zero em <15 min",
  "queueing": "Queueing - background process",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Recursos",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "Restful Services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Retornando dados em JSON",
  "roadmap": "Roteiro",
  "router": "Router",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Create the router",
  "router_3": "Define a route",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Amostras de Aplicações",
  "see_for_yourself": "Veja por si mesmo...",
  "sharding": "Sharding",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Something went wrong :(",
  "sponsored_by": "Patrocinado por",
  "sponsors": "Patrocinadores",
  "sponsors_and_supporters": "Sponsors and Supporters",
  "sponsors_and_supporters_upper": "PATROCINADORES E SUPORTES",
  "sponsors_become_patron": "Become a Patron!",
  "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
  "stack_overflow": "Stack Overflow",
  "store": "Loja",
  "support": "Suporte",
  "support_documentation_1": "Por favor, use a :1: antes de qualquer coisa. Você também pode usar a ferramenta de pesquisa em nossos documentos para encontrar pelo que você está procurando. Se sua dúvida ainda não for respondida, existem outras opções abaixo. ",
  "support_download_page": "página de download",
  "support_forum_1": "Você pode deixar sua dúvida em nosso <a href=':1:'>Fórum de Discussões</a>",
  "support_note": "Diversos bugs aparecem porque os usuários não estão executando a versão mais recente. Por favor acesse a :1:, baixe a versão mais recente disponível (ou compile-a) e confirme se o problema que vem experimentando é de fato um bug.",
  "support_phalcon_forum": "Fórum Phalcon",
  "support_please_note": "Favor notar:",
  "support_please_note_1": "Stack Overflow não é dedicado a apoiar o Phalcon",
  "support_please_note_2": "Please do not raise new bugs there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_3": "Please do not ask for feature requests there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_4": "Certifique-se de que você incluiu a tag 'phalcon' com sua dúvida",
  "support_please_note_5": "Certifique-se de que mencionou 'Phalcon' na dúvida",
  "support_reporting_a_bug": "Relatando um bug",
  "support_reporting_a_bug_1": "Please report bugs when you've exhausted all of the above options, using the <a href=':1:'>issue tracker</a> in Github.",
  "support_slack": "Slack",
  "support_slack_1": "You can find us in the <a href=':1:'>PhalconChats</a> channel on Slack.",
  "support_stack_overflow_1": "If you are familiar or prefer Stack Overflow, there is a <a href=':1:'>phalcon</a> tag that you can use to search or to tag your query.",
  "support_us": "Support Us",
  "team": "Time",
  "team_andres_1": "Andres não é um estranho para projetos de código aberto. Nos últimos nove anos, ele têm planejado e lançado frameworks para PHP e têm se envolvido no desenvolvimento web - sua principal paixão.",
  "team_andres_2": "Como campeão da TR35, o principal foco de Andres  é sempre escolher e implementar ou usar a ferramenta certa para o trabalho, principalmente com foco no desempenho. Portanto, em 2011, uma nova idéia estava em trabalho, para criar um novo tipo de framework para desenvolvedores PHP, que tenha foco em usabilidade, recursos e principalmente no desempenho.",
  "team_andres_3": "Através desta inovadora aproximação é que Phalcon surgiu. Um framework PHP escrito em C que oferece uma riqueza de recursos para desenvolvedores enquanto maximiza a performance e mantém um baixo consumo de recursos.",
  "team_andres_4": "Andres é um dos desenvolvedores do núcleo do Phalcon e sua inspiração.",
  "team_eduar_1": "Eduar is a C/PHP developer with several years of experience in application development. He is one of the founders and lead developers of the Phalcon project which began in 2011.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar likes science fiction movies and sometimes plays football.",
  "team_nikolay_1": "Nikolay tem desenvolvido aplicações web por cerca de 10 anos. Ele esteve envolvido em alta performance bem como em websites e projetos complexos.",
  "team_nikolay_2": "Nikolay vem trabalhando com projetos \"Open Source\" por um longo tempo, utilizando-os sempre que os requisitos o permitem. Assim, ele começou a usar o seu tempo pessoal para contribuir à comunidade, se integrando a projetos, oferecendo mudanças e sugestões na arquitetura, bem como  de desempenho. Ele tem sido fundamental na melhoria de projetos Open Source CMS recebendo um feedback positivo por parte da comunidade.",
  "team_nikolay_3": "Seu envolvimento contínuo com projetos Open Source ajudou-o a avançar seu conhecimento técnico ao mesmo tempo respeitando e contribuindo à mentalidade da comunidade.",
  "team_nikolay_4": "Nikolay é um ávido apoiador em maximizar a performance de aplicações web. Após sua apresentação ao Phalcon, ele decidiu seguir e usar o projeto e tornou-se um Evangelista do mesmo. Ele lidera o apoio através da comunidade da Rússia e oferece recursos para desenvolvedores do idioma russo.",
  "team_nikolay_5": "Suas contribuições incluem: uma cópia do site principal no idioma Russo (<a href=':1:'>http://www.phalconphp.ru</a>), uma cópia do repositório da documentação também no idioma Russo (<a href=':2:'>http://docs.phalconphp.ru</a>), constantes mudanças e correções para a documentação no idioma Inglês, um grupo na rede social Vkontakte (<a href=':3:'>http://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos está na indústria de TI a cerca de 20 anos. Ele foi apresentado ao mundo PHP em 2000 e tem utilizado a linguagem tanto em projetos pessoais, bem como em projetos para seus contratantes.",
  "team_nikos_2": "Ele ama descobrir novas tecnologias e formas de integrá-las com aplicações existentes e assim colher os benefícios que elas oferecem.",
  "team_nikos_3": "Ele é um ávido apoiador do Desenvolvimento Orientado a Testes (TDD) e sempre busca obter uma cobertura completa em seu código.",
  "team_nikos_4": "Nikos,  continuando  interessado em tecnologias novas e inovadoras que fogem à regra, apresentaram-lhe  Phalcon. Ele se juntou à equipe de desenvolvimento do Core e suas tarefas envolvem principalmente a coordenação de NFRs e correções de bugs, ajudar com os testes, documentação e da incubadora. Nikos também é responsável por manter a DLLs do Windows para o projeto e oferece apoio sempre que possível.",
  "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Mecanismo de Templates (Volt)",
  "template_engine_volt_1": "Volt is an ultra-fast and designer friendly templating language written in Zephir/C for PHP. It provides you a set of helpers to write views in an easy way. Volt is highly integrated with other components of Phalcon, just as you can use it as a stand-alone component in your applications.",
  "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
  "template_engines": "Template Engines",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Views represent the user interface of your application",
  "testimonials": "Testemunhos",
  "testimonials_1": "Saudações, time Phalcon! Eu tenho um projeto, desenvolvido com o framework Phalcon. Chama-se Guitarama (<a href=':1:'>:2:</a>) tablaturas de guitarra e catálogo de acordes. O site é voltado para os usuários da Rússia, e usa o idioma Russo, mas espero que não haja problemas para entender a maioria das páginas. o site foi relançado em uma nova plataforma no começo de janeiro de 2013, e desde então tem crescido constantemente. Número diário de visitas: ~1500 visitantes únicos, com ~5000 visualizações de páginas. O site está sendo executado em um antigo servidor físico 1xP4-3Ghz, com 4GB RAM. Mais uma vez, obrigado por um ótimo framework e por tudo o que vocês estão fazendo : ) Michael.",
  "testimonials_2": "Olá, time Phalcon. Gostaria de compartilhar com vocês nossa história de sucesso no uso do Phalcon nos projetos <a href=':1:'>:2:</a> e <a href=':3:'>:4:</a>, os mais acessados e carregados do Cazaquistão, classificados no TOP-10 de sites classificados no CIS. Ambos os sites trabalham com uma única API RESTful escrita com Phalcon\\Mvc\\Micro. Nos picos de acesso a API processa algo em torno de 400 requisições por segundo e isso não é um limite. Mudar para o Phalcon nos permitiu reduzir o tempo de geração de resposta e o consumo de CPU e memória RAM, bem como reduzir o tempo do processo de desenvolvimento. Continuaremos usando o Phalcon em nossos novos projetos. Obrigado pelo grande trabalho que vocês vem fazendo! Meus cumprimentos, Nikita Vershinin, desenvolvedor Lider, Kolesa.kz e krisha.kz.",
  "testimonials_3": "Equipe Phalcon, o framework que vocês criaram é incrível. Eu nunca usei um framework que combina velocidade, eficiência, brevidade e naturalidade em um único pacote. Tenho a intenção de defender e contribuir para o projeto de qualquer maneira que eu puder. Eu embarquei recentemente em um projeto  de cerca de 800 horas e estou feliz em dizer que estamos usando o Framework Phalcon. Bravo. Brian Seymour",
  "testimonials_4": "Oi pessoal, eu apenas dei uma olhada no Phalcon e é simplesmente fantástico! Eu apenas queria dizer a você o quão incríveis vocês são! Então, obrigado por este framework e mantenham o bom trabalho! Ivan Penchev",
  "testimonials_5": "Olá Pessoal, eu escrevi um serviço simples de encurtador de URL usando Phalcon. Isso foi fantástico! <a href=':1:'>:2:</a>. Demo aqui <a href=':3:'>:4:</a> :) Murat Küçükosman",
  "testimonials_6": "Olá Time Phalcon, eu criei um pequeno projeto desenvolvido para usuários da Polônia utilizando o seu framework. Eu tenho que admitir que a performance é incrível, estão de parabéns pelo grande trabalho. Serviço para validar o conteúdo de páginas web no idioma Polonês <a href=':1:'>:2:</a>.",
  "testimonials_7": "Olá pessoal! Só gostaria de compartilhar com você o mais recente release de nosso antigo projeto - <a href=':1:'>:2:</a>. Mudar para o Phalcon nos permitiu reduzir o carregamento do servidor pela metade em comparação ao framework anterior, o que é ótimo!",
  "testimonials_description": "Abaixo está uma coleção de testemunhos e histórias de sucesso, de vocês, os desenvolvedores e usuários de Phalcon PHP. Nós sempre apreciamos e-mails com histórias de sucesso e estaremos postando-os em nosso blog. Se você quiser enviar sua história de sucesso ou entrar em contato conosco, não hesite em nos enviar seu email para <a href='mailto::1:'>:2:</ a>.",
  "toggle_navigation": "Toggle navigation",
  "transactions": "Transações",
  "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
  "transactions_2": "Create a transaction manager",
  "transactions_3": "Request a transaction",
  "transactions_4": "Get the robots to be deleted",
  "transactions_5": "Something's gone wrong, we should rollback the transaction",
  "transactions_6": "Everything's gone fine, let's commit the transaction",
  "transactions_7": "Robots were deleted successfully!",
  "transactions_8": "Failed, reason: ",
  "transactions_description": "Transactions in Phalcon allows to keep the data integrity safe.",
  "try_phalcon": "Try Phalcon",
  "tutorial": "Tutorial",
  "twitter": "Twitter",
  "views_and_frontend": "Views & frontend",
  "vimeo": "Vimeo",
  "watch_demo": "Watch the demo video",
  "zephir": "Zephir"
}
