{
  "about": "О проекте",
  "about_blog": "БЛОГ",
  "about_blog_1": "Если вам нравится писать статьи, не забудьте, что <a href=':1:'>наш блог</a> открыт для добавления обучающих статей, написанных вами. Если у вас есть собственный блог и вы написали что-то о Phalcon, мы также можем опубликовать анонс на наших страницах социальных сетей, чтобы как можно больше людей смогли прочитать вашу статью. Если ваш блог не на английском языке, мы разместим информацию о нём и, возможно, сможем перевести представленные материалы. Если вы знаете какие-либо сайты, посвящённые PHP, которые заинтересованы в представлении нашего проекта своей аудитории, пожалуйста, сообщите нам.",
  "about_description_1": "Удивительным проектам — удивительные руки. Возможно, мы ещё не знакомы, но мы думаем, что вы могли бы идеально подойти для разработки лучших веб приложений. Вместе мы готовы изменить мир! Здесь, в Phalcon, мы создаем PHP фреймворк нового поколения. Мы хотим предложить вам потрясающую производительность, которая позволяет программировать в простой и увлекательной форме.",
  "about_description_2": "Надеемся, что вам нравится Phalcon так же, как и нам. Мы всегда открыты для сотрудничества. <strong>Вам не обязательно быть Си разработчиком, чтобы помогать развивать Phalcon!</strong> Есть много других областей, в которые Вы можете внести свой вклад:",
  "about_documentation": "ДОКУМЕНТАЦИЯ",
  "about_documentation_1": "The repository of this website is available on <a href=':1:'>github</a>. We are using that repository as a source for our documentation for the English language only!.<br /><br />We always appreciate corrections, additions and enhancements in our documentation, so all you have to do is clone the repository and issue a pull request!<br /><br />If you can help non English speaking developers by translating some of the content to another language, that would be great! We are using <a href=':2:'>:3:</a> for our translations, and you can find our project <a href=':4:'>here</a>",
  "about_donations_sponsoring": "ПОЖЕРТВОВАНИЯ / СПОНСОРСТВО",
  "about_evangelism": "ЕВАНГЕЛИЗМ",
  "about_evangelism_1": "Многие до сих пор ещё не догадываются о существовании Phalcon или сомневаются, что он действительно работает. Мы уверены, что многие разработчики только выиграют от того, что узнают о Phalcon, о том, как он может помочь им. Если вам известно о каком-либо PHP событии/встрече, и вы хотите выступить с докладом о проекте, мы вас полностью поддержим. Кто не хотел бы узнать об инструменте, который так преобразовывает разработку под PHP?",
  "about_facebook_page": "Страница на Facebook",
  "about_flying_with_phalcon": "Спасибо за полет с Phalcon! &lt;3",
  "about_follow_on_gab": "Мы в Gab",
  "about_follow_on_twitter": "Мы в Twitter",
  "about_official_blog": "Официальный блог",
  "about_sample_applications": "ПРИМЕРЫ ПРИЛОЖЕНИЙ",
  "about_sample_apps_1": "Большое количество примеров помогают другим лучше понять, как с помощью Phalcon можно создать крупные проекты. Не стесняйтесь делиться ссылками на ваши проекты или примеры приложений. Это позволит другим программистам улучшить свои навыки использования фреймворка, а вы сможете получить отзывы о вашей работе!",
  "about_screencasts": "СКРИНКАСТЫ",
  "about_screencasts_1": "Нам всем нравится смотреть скринкасты. Если у вас есть немного свободного времени, и вы хотите помочь сообществу с представлением какого-либо функционала фреймворка,  создайте небольшой видеоролик. Это будет здорово! Посмотрите наш <a href=':1:'>Vimeo канал</a> в качестве примера.",
  "about_share_experiences_1": "Не стесняйтесь делиться с сообществом вашим опытом работы с Phalcon. Если Phalcon помог вашему проекту достичь успеха, расскажите об этом. Кроме того, принимайте участие в обсуждении, какие компоненты нуждаются в доработке, что можно было бы сделать проще, какие преимущества в разработке вам дал Phalcon. Хотя не все функциональности могут быть реализованы немедленно, ваши замечания и отзывы позволят значительно помочь нам определить будущее проекта. Ваши отзывы помогают нам делать Phalcon лучше.",
  "about_share_your_experiences": "ДЕЛИТЕСЬ СВОИМ ОПЫТОМ",
  "about_social_networks": "СОЦИАЛЬНЫЕ СЕТИ",
  "about_social_networks_1": "Phalcon развивается ежедневно, ведомый нашим желанием сделать его лучше. Социальные сети сейчас являются частью нашей жизни и все мы общаемся с другими людьми через них. Совместное обсуждение опыта работы с Phalcon в кругу ваших знакомых значительно увеличит интерес к проекту. Все больше и больше людей будет вступать в наше сообщество, что сделает его продуктивнее, сильнее и популярнее. Ставьте лайк, '+1', 'поделиться', участвуя в обсуждениях вопросов, касающихся Phalcon. Люди, которые узнают о Phalcon через вашу активность в социальных сетях, будут вам благодарны!",
  "about_social_networks_2": "Мы присутствуем в большинстве популярных социальных сетях. Подписываясь на нас, вы помогаете увеличить популярность проекта:",
  "about_sponsoring_1": "Мы — маленькая, но эффективная команда разработчиков, работающих не покладая рук. Мы стараемся уделять проекту как можно больше времени. Наша страсть к этому проекту заставляет нас совершенствоваться каждый день. Phalcon является программным обеспечением с открытым кодом и развивается с помощью усилий добровольцев. Вы можете помочь нам продолжить активно развивать проект с помощью пожертвований или спонсорской поддержки. Чем больше времени и ресурсов будет затрачено на проект, тем быстрее он будет развиваться и тем больше удивительных возможностей будет реализовано.",
  "about_star_on_github": "Добавьте нам звезд на Github",
  "about_tests": "ТЕСТЫ",
  "about_tests_1": "В любом программном обеспечении могут быть ошибки. Если вы обнаружили новую ошибку, пожалуйста, сразу сообщите нам. У нас есть набор тестов с более, чем <a href=':1:'>16 000</a> проверками. Тем не менее, модульные тесты не могут охватить все возможные варианты. Помогите нам улучшить наши тесты, за счет добавления новых условий проверок или улучшения существующих. Каждый добавленный тест делает фреймворк стабильнее.",
  "about_thank_you": "СПАСИБО ВАМ!",
  "about_thank_you_1": "Мы благодарим всех наших разработчиков и членов сообщества за вклад в процесс создания лучшего в своём роде фреймворка. Ваша поддержка помогает нам двигаться в достижении этой цели. Мы надеемся, что Phalcon оправдает или превзойдёт то доверие, которое вы оказали ему.",
  "about_translations": "ПЕРЕВОДЫ",
  "about_translations_1": "Мы стремимся охватить настолько большой круг разработчиков, насколько это возможно, преодолевая языковые барьеры. Мы используем <a href=':1:'>:2:</a>, чтобы обрабатывать все слова или предложения, которые необходимо перевести для этого сайта. Репозиторий проекта расположен <a href=':3:'>здесь</a>.",
  "acl": "ACL",
  "acl_1": "Так вы можете создать список контроля доступа (ACL):",
  "acl_2": "Create the ACL",
  "acl_3": "Действие по умолчанию - запрет (DENY) доступа",
  "acl_4": "Register two roles, Users is registered users",
  "acl_5": "and guests are users without a defined identity",
  "acl_description": "Access Control List allows users to access the modules they're authorized to",
  "api": "API",
  "auto_loader": "Автозагрузчик",
  "auto_loader_1": "Register namespaces, prefixes, directories or classes. Take advantage of the autoloader events and maintain full control over what files are loaded and from where.",
  "auto_loader_2": "Creates the autoloader",
  "auto_loader_3": "Register some namespaces",
  "auto_loader_4": "Register autoloader",
  "autoloader": "Автозагрузчик",
  "autoloader_description": "Provides the autoloading mechanism of PHP classes following PSR-4.",
  "basic_features": "Основные черты",
  "blog": "Блог",
  "built_with_phalcon": "Сделано на Phalcon",
  "cache": "Кэш",
  "cache_1": "The cache component allows faster access to frequently used or already processed data. It supports many backends such as Redis, Memcached, Mongo, Files, Apc and more",
  "cache_2": "Set the models cache service",
  "cache_3": "Cache data for one day by default",
  "cache_4": "Настройки соединения Memcached",
  "cache_description": "Improve your performance with many of the backend caches that Phalcon provides",
  "community": "Сообщество",
  "consulting": "Консалтинг",
  "consulting_header": "We have partnered with LEZGRO, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "LEZGRO congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve LEZGRO to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Для связи с нами используйте <a href=':1:'>наш сайт</a>, где вы также сможете ознакомиться с нашим портфолио и отзывам о нашей работе.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Для связи с нами используйте <a href=':1:'>наш сайт</a>, где вы также сможете взглянуть на проекты, в которые мы были вовлечены.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "О нас",
  "contributors": "Контрибьюторы Phalcon",
  "contributors_description": "Phalcon становится лучше с каждым днем благодаря удивительному сообществу",
  "crypt": "Шифрование",
  "crypt_description": "Используйте шифрование, чтобы данные в безопасности от несанкционированного доступа третьих лиц",
  "data_and_storage": "Данные и хранение",
  "dependency_injection": "Внедрение зависимостей",
  "dependency_injection_1": "Phalcon is built upon a powerful yet easy to understand and use pattern called Dependency Injection. Initialize or define services once - and use them virtually anywhere throughout the application.",
  "dependency_injection_2": "Create the Dependency Injector Container",
  "dependency_injection_3": "Register classes, functions, components",
  "dependency_injection_4": "Use anywhere else in code",
  "dependency_injection_description": "Внедрение зависимостей, локатор сервисов и контейнер для них.",
  "discord": "Discord",
  "docs": "Документация",
  "documentation": "Документация",
  "donate": "Поддержать проект",
  "download": "Скачать",
  "download_arch": "Arch Linux",
  "download_arch_1": "Существует PKGBUILD для ArchLinux, доступный <a href=':1:'>здесь</a>",
  "download_box_1": "Бокс #1",
  "download_box_2": "Бокс #2",
  "download_box_doc_root": "Корневой каталог: :1:",
  "download_box_user_pass": "MySQL пользователь: :1: пароль: :2:",
  "download_compilation": "Компиляция",
  "download_compilation_1": "В Linux проще собрать и установить расширение из исходного кода.",
  "download_compilation_11": "1. Чтобы собрать расширение из исходного кода, выполните следующие действия:",
  "download_compilation_12": "2. Добавьте в файл php.ini:",
  "download_compilation_13": "3. Перезапустите веб сервер",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "После просьб от сообщества, разработчики cPanel выпустили специальный модуль, который позволяет производить установку Phalcon для сайтов использующих cPanel. Информация может быть найдена <a href=':1:'>здесь</a>. Модуль поддерживается на <a href=':2:'>Github</a>.",
  "download_dependencies": "Зависимости",
  "download_dependencies_1": "Не смотря на то, что бинарный код Phalcon не содержит связей со сторонними расширениями, он использует функционал некоторых из них. Используемые расширения:",
  "download_dependencies_2": "Нет необходимости устанавливать все перечисленные расширения для использования Phalcon. Вы можете установить только те расширения, которые необходимы в вашем конкретном случае. Например, если вы используете базу данных MySQL, вы можете загрузить только PDO и PDO/MySQL, игнорируя Oracle, SQlite, Postgresql и Mongo.",
  "download_developer_tools": "Инструменты разработчика",
  "download_devtools_1": "Эти инструменты представляют собой набор полезных скриптов для создания основы приложения. Основные компоненты приложения можно создать с помощью простых команд, что позволяет легко разрабатывать приложения, используя Phalcon.",
  "download_devtools_composer": "Установка с помощью Composer",
  "download_devtools_composer_1": "Установите composer в общую директорию или в ваш проект:",
  "download_devtools_composer_2": "Создайте файл composer.json и напишите в нем:",
  "download_devtools_composer_3": "Выполните установку с помощью composer:",
  "download_devtools_composer_4": "Создайте символическую ссылку на файл phalcon.php:",
  "download_devtools_docs": "Документация: <a href=':1:'>Инструменты разработчика Phalcon</a>",
  "download_devtools_download": "Вы можете скачать или клонировать кроссплатформенный пакет, содержащий инструменты разработчика с <a href=\":1:\">Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "Существует много способов использования Phalcon с Docker.",
  "download_docker_2": "Our official images are located <a href=':1:'>here</a>. We always welcome pull requests and improvements. The repository for the docker files is located here:",
  "download_docker_3": "With Phalcon-compose you can create an isolated environment with docker, that will allow you to use Phalcon without any additional installations. Note that using Phalcon Compose, requires ",
  "download_docker_4": "и",
  "download_docker_5": "Сервисы",
  "download_docker_6": "Phalcon Compose offers the following services by default:",
  "download_docker_7": "Phalcon Compose очень прост в использовании. Представим, что вы хотите создать приложение в: ",
  "download_docker_8": "We will now need to run the following command for our container application can be created:",
  "download_docker_9": "The above command will download the skeleton of the docker environment.",
  "download_docker_10": "Переменные",
  "download_docker_11": "Вам нужно создать файл",
  "download_docker_12": "в",
  "download_docker_13": "A sample file has been provided called",
  "download_docker_14": "Настройте переменные в файле под ваши нужды. Самая важная переменная это",
  "download_docker_15": "Смените имя на что-то более подходящее. В нашем случае мы оставляем стандартное имя",
  "download_docker_16": "Откройте ваш hosts файл (например <code>/etc/hosts</code>) и добавьте туда новую запись:",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Сборка",
  "download_docker_19": "Теперь вы можете собрать окружение.",
  "download_docker_20": "Контейнеры будут загружены и настроены в вашем окружении.",
  "download_docker_21": "Запуск",
  "download_docker_22": "Теперь вы можете запустить окружение:",
  "download_docker_23": "Go to :1: in your browser and you will see your environment is set up. You can now develop your application in the app folder.",
  "download_docker_24": "Выключение",
  "download_docker_25": "Чтобы отключить окружение когда оно больше не нужно, вы можете использовать следующую команду:",
  "download_docker_26": "Дополнительную информацию вы можете найти здесь:",
  "download_examples": "Предустановленные примеры",
  "download_examples_1": "Следующие примеры установлены в наших vagrant боксах:",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Порт доступен для FreeBSD. Необходимо выполнить одну из следующих команд для его установки:",
  "download_ide_stubs": "Заглушки для IDE",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Нужна помощь?",
  "download_need_help_1": "Если вам необходима помощь, на нашей <a href=':1:'>странице поддержки</a> вы найдёте ссылки на дополнительные ресурсы. Мы всегда готовы помочь вам.",
  "download_note": "Phalcon является PHP расширением на языке C, поэтому вам нужно скачать бинарный файл для вашей платформы или скомпилировать его из исходных кодов.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "Существует пакет, доступный <a href=':1:'>здесь</a> (благодаря <a href=':2:'>Mariusz \\u0141\\u0105czak</a>)",
  "download_requirements": "Требования",
  "download_requirements_1": "Необходимо предварительно установить следующие пакеты:",
  "download_requirements_2": "Инструменты разработки PHP 5.x",
  "download_requirements_3": "Компилятор GCC",
  "download_source_code": "Исходный код: <a href=':1:' target='_download' title='GitHub репозиторий'>GitHub</a>",
  "download_source_code_switch": "Исходный код (пожалуйста, переключитесь в соответствующую ветку): <a href=':1:' target='_download' title='GitHub репозиторий'>GitHub</a>",
  "download_ubuntu": "Для установки Phalcon на Ubuntu необходимо выполнить следующие действия:",
  "download_ubuntu_1": "Если у вас отсутствует apt-add-repository,  выполните следующую команду:",
  "download_ubuntu_2": "Если вы хотите установить старую версию Phalcon (1.x), используйте следующий PPA:",
  "download_ubuntu_or_debian": "Ubuntu или Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> является отличным средством для создания и конфигурации легковесных, воспроизводимых и портативных средств разработки.",
  "download_vagrant_2": "Используйте любой из подготовленных боксов для разработки с использованием Phalcon.",
  "download_vagrant_boxes": "Боксы Vagrant",
  "download_windows": "DLL для Windows",
  "download_windows_download": "Скачать",
  "download_windows_dlls": "Windows DLLs can be downloaded from our Github release page <a href=':1:'>here</a>",
  "download_windows_guides": "Краткое руководство",
  "download_windows_guides_wamp": "Установка на WAMP",
  "download_windows_guides_xampp": "Установка на XAMPP",
  "download_windows_installation": "Установка",
  "download_windows_installation_1": "Для использования phalcon в Windows вы можете скачать DLL библиотеку. Отредактируйте ваш php.ini, добавив в конце подключение модуля, и перезагрузите ваш веб-сервер, чтобы применить изменения. <a href=':1:'>Подробнее</a>.",
  "download_windows_note": "Мы настоятельно рекомендуем вам использовать последние версии PHP и соответствующие DLL, чтобы воспользоваться полным набором возможностей Phalcon.",
  "download_windows_older": "Устаревшие версии",
  "download_windows_stable": "Стабильные версии",
  "encryption": "Шифрование",
  "encryption_1": "Phalcon provides encryption facilities via the Phalcon\\Crypt component. This class offers simple object-oriented wrappers to the openssl PHP's encryption library.",
  "encryption_2": "This is a secret key (32 bytes).",
  "encryption_3": "This is the text that you want to encrypt.",
  "events": "События",
  "events_description": "Extend the most of the framework components by setting 'hook points'. Create your own events and make your application more flexible and powerful",
  "events_management": "Управление событиями",
  "events_management_1": "An EventsManager allows us to attach listeners to a particular type of event. The type that interests us now is 'dispatch'. The following code filters all events produced by the Dispatcher:",
  "events_management_2": "Create an events manager",
  "events_management_3": "Listen for events produced in the dispatcher using the Security plugin",
  "events_management_4": "Handle exceptions and not-found exceptions using NotFoundPlugin",
  "events_management_5": "Assign the events manager to the dispatcher",
  "facebook": "Facebook",
  "flash_messages": "Информационные сообщения",
  "flash_messages_1": "Use the flash notifier to show notifications to a user in a web application:",
  "flash_messages_2": "there were errors in this form",
  "flash_messages_3": "yes!, everything went very smoothly",
  "flash_messages_4": "this is a notice for users",
  "flash_messages_5": "this is just a warning",
  "flash_messages_description": "Flash messages are used to notify the user about the state of actions.",
  "forms_builder": "Конструктор форм",
  "forms_builder_1": "Each element in the form can be rendered as required by the developer. Internally, Phalcon\\Tag is used to produce the correct HTML for each element and you can pass additional HTML attributes as the second parameter of render():",
  "forms_builder_2": "Домашний",
  "forms_builder_3": "Смартфон",
  "forms_builder_description": "Легко создавайте HTML-формы",
  "forum": "Форум",
  "gab": "Gab.ai",
  "get_phalcon": "Скачать Phalcon",
  "github": "GitHub",
  "header_slogan": "Инновационная архитектура делает Phalcon быстрейшим PHP-фреймворком из всех существующих!",
  "header_tagline": "Полнофункциональный PHP-фреймворк, поставляемый как C-расширение",
  "high_performance_php_framework": "Высокопроизводительный PHP Фреймворк",
  "hosting": "Хостинг",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud предоставляет масштабируемые, оплачиваемые по факту, вычислительные ресурсы в облаке.",
  "hosting_amazon_ec2_2": "Выберите предварительно настроенный образ шаблона машины Amazon (AMI), чтобы сразу приступить к работе. Или создайте AMI, содержащий приложения, библиотеки, данные и соответствующие настройки конфигурации. <a href=':1:'>Подробнее</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix предоставляет превосходный сервис Windows-хостинга. Наши клиенты оценили наш сервис по достоинству. Мы предлагаем экономичные тарифные планы для Windows и cPanel Linux хостинга, а также для виртуальных и выделенных серверов! <a href=':1:'>Подробнее</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows and Linux cPanel shared web hosting packages and plans, no configuration or installation required! ASPnix offers a variety of PHP versions from 5.2 - 7.2 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "Облако <a href=':1:'>Windows Azure</a> представляет собой масштабируемый и управляемый хостинг на OS Windows для ваших приложений. Используя Phalcon можно сократить необходимое количество экземпляров/инстансов.",
  "hosting_azure_2": "Для установки Phalcon выполните пошаговые инструкции, указанные в <a href=':1:'>этой статье на SitePoint</a>",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon может быть установлен на любом сервере, к которому хостинг-провайдер предоставляет SSH доступ с root правами (или sudo). Ниже приведен список известных компаний, которые предлагают такие услуги:",
  "hosting_digital_ocean_1": "Молниеносно быстрые облачные технологии. Созданы для разработчиков. Развертывание сервера в SSD облаке за 55 секунд. <a href=':1:'>Подробнее</a>",
  "hosting_digital_ocean_2": "Перейдите к разделу <a href=':1:'>руководство</a> для ознакомления",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host offers multiple affordable and high quality hosting plans.",
  "hosting_dcthost_2": "By default, they have Phalcon installed on all their shared hosting packages.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit предлагает множество тарифов (есть один для разработчиков и бесплатный - с некоторыми ограничениями), чтобы удовлетворить потребности большинства разработчиков, которые хотели бы попробовать Phalcon или развернуть свои приложения, использующие его.",
  "hosting_fortrabbit_2": "Они предлагают множество <a href=':1:'>расширений</a>, которые удовлетворят даже самый требовательный проект.",
  "hosting_fortrabbit_3": "Стабильная версия Phalcon предварительно установлена. Модуль можно активировать в панели администрирования.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Установите Phalcon, используя стандартную инструкцию.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "You bring the code, we'll sort the servers. Next generation, auto-sizing PaaS for PHP",
  "hosting_layershift_2": "Перейдите к разделу <a href=':1:'>руководство</a> для ознакомления",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Развертывайте и управляйте виртуальными серверами в Linode Cloud. Получите сервер за несколько секунд с выбранным вами Linux дистрибутивом, ресурсами и размещением узлов. <a href=':1:'>Подробнее</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Облачные серверы представляют собой виртуальные машины, работающие под управлением Linux или Windows&reg; Server в Rackspace Cloud. В зависимости от ваших потребностей вы можете масштабировать ресурсы, такие как процессор, память и размер диска, изменяя их как в большую, так и в меньшую сторону. Вы оплачиваете только те ресурсы, которые вам необходимо использовать. <a href=':1:'>Подробнее</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction хостинг для разработчиков. Полный доступ к быстрым серверам с предустановленными вашими любимыми инструментами ​​и технической поддержкой для пользователей.",
  "hosting_webfaction_2": "Для установки Phalcon в WebFaction следуйте инструкциям, приведенным <a href=':1:'>здесь</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "Интернационализация",
  "i18n_1": "The component Phalcon\\Translate aids in creating multilingual applications. Applications using this component, display content in different languages, based on the user's chosen language supported by the application.",
  "i18n_2": "Ask browser what is the best language",
  "i18n_3": "Check if we have a translation file for that lang",
  "i18n_4": "Fallback to some default",
  "i18n_5": "Return a translation object",
  "i18n_description": "Translate your applications to many languages easily",
  "installing_phalcon_php": "Установка Phalcon",
  "issue_tracker": "Трекер задач",
  "join_our_community": "Come join our vibrant developer community!",
  "join_our_community_description": "Community contributions in Extensions, Plugins, Adapters, VM, examples, source code... and more",
  "language_text": "Английский",
  "learn": "Коротко",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Низкое потребление",
  "low_overhead_1": "Расширения на Zephir/C загружаются вместе с PHP один раз, при запуске демона веб-сервера",
  "low_overhead_2": "Классы и функции предоставляемые расширением готовы к использованию в любом приложении",
  "low_overhead_3": "The code is compiled and isn't interpreted because it's already compiled to a specific platform and processor",
  "low_overhead_4": "Благодаря его низко-уровневой архитектуре и оптимизациям <strong>Phalcon обеспечивает наименьшую нагрузку при работе MVC-приложений</strong>",
  "low_overhead_description": "Low memory consumption and CPU compared to traditional frameworks",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "ЕЩЁ...",
  "mvc": "MVC",
  "mvc_1": "Build single and multi-module applications with ease and pleasure. Using the file structure, scheme and patterns you already know.",
  "mvc_hmvc": "MVC и HMVC",
  "mvc_hmvc_description": "Modules, components, models, views and controllers",
  "odm_for_mongo": "ODM для Mongo",
  "odm_for_mongo_1": "In addition to its ability to map tables in relational databases, Phalcon can map documents to a MongoDB database. The ODM offers a CRUD functionality, events, validations among other services.",
  "odm_for_mongo_2": "How many robots are there?",
  "odm_for_mongo_3": "How many mechanical robots are there?",
  "odm_for_mongo_4": "There are :1: robots",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Хьюстон у нас проблема!",
  "or": "или",
  "orm": "ORM",
  "orm_1": "A powerful ORM is provided by Phalcon allowing you to manipulate database records as classes and objects. MySQL, PostgreSQL and SQLite are supported out of the box.",
  "orm_description": "Object Relational Mapping",
  "phalcon_team": "Команда Phalcon",
  "phalcon_team_1": "Many more people",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL is a high-level, object-oriented SQL dialect that allows to write queries using a standardized SQL-like language. PHQL is implemented as a parser (written in C) that translates syntax in that of the target RDBMS. To achieve the highest performance possible, Phalcon provides a parser that uses the same technology as SQLite. This technology provides a small in-memory parser with a very low memory footprint that is also thread-safe.",
  "phql_2": "Name",
  "phql_description": "The powerful and secure Phalcon Query Language, PHQL",
  "polling_app": "A polling app built from scratch in < 15 min",
  "queueing": "Очереди",
  "queueing_1": "Activities like processing videos, resizing images or sending emails aren't suitable to be executed online or in real time because it may slow the loading time of pages and severely impact the user experience. The best solution here is to implement background jobs. The web application puts jobs into a queue and which will be processed separately.",
  "queueing_2": "Connect to the queue",
  "queueing_3": "Insert the job in the queue",
  "queueing_description": "Use the built-in queueing system in Phalcon to schedule jobs and reduce the load of your web server",
  "resources": "Ресурсы",
  "rest": "Rest",
  "rest_description": "In this case, you can use either a micro or full stack application to meet your goal. In addition, a powerful set of HTTP helpers.",
  "restful_services": "RESTful services",
  "restful_services_1": "Writing REST servers and applications has never been easier. No boilerplate. Simple services will fit in one file.",
  "restful_services_2": "Returning data in JSON",
  "roadmap": "План развития",
  "router": "Роутинг",
  "router_1": "Routing as it supposed to be. Nothing more. Nothing less.",
  "router_2": "Create the router",
  "router_3": "Define a route",
  "router_description": "Phalcon\\Mvc\\Router provides advanced routing capabilities.",
  "sample_applications": "Примеры приложений",
  "see_for_yourself": "Смотрите сами...",
  "sharding": "Шардирование",
  "sharding_1": "Attach models to different databases",
  "sharding_2": "This service returns a MySQL database",
  "sharding_3": "This service returns a PostgreSQL database",
  "sharding_description": "Connect, store and retrieve data from many database systems at the same time",
  "slack": "Slack",
  "something_went_wrong": "Что-то пошло не так :(",
  "sponsored_by": "При поддержке",
  "sponsors": "Спонсоры",
  "sponsors_and_supporters": "СПОНСОРЫ И ПОДДЕРЖКА",
  "sponsors_and_supporters_upper": "СПОНСОРЫ И ПОДДЕРЖКА",
  "sponsors_become_patron": "Станьте патроном!",
  "sponsors_description_1": "Для тех, кто желает поддержать нашу работу и дальнейшее развитие Phalcon, мы предлагаем различные варианты спонсорства, которые подойдут для любого бюджета. Спонсорство нашей работы позволяет нам уделять больше времени проекту, быстрее реагировать на ошибки и предложения и обеспечивать стабильность проекта.",
  "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
  "stack_overflow": "Stack Overflow",
  "store": "Магазин",
  "support": "Поддержка",
  "support_discord": "Come join the Phalcon <a href=':1:'>Discord</a>",
  "support_documentation_1": "Пожалуйста, изучите раздел :1: прежде, чем предпринять дальнейшие шаги. Вы также можете воспользоваться поиском, чтобы найти интересующую информацию. Если вы всё же не получили ответ на ваш вопрос, воспользуйтесь ресурсами, перечисленными ниже.",
  "support_download_page": "скачать",
  "support_note_1": "Our great community and contributors are happy to help you though! Please use these community resources for obtaining help.",
  "support_note_2": "Many bugs are raised because users are not running the latest version. Please visit the :1:, download the latest available version (or compile it) and confirm if the issue you are experiencing is indeed a bug.",
  "support_phalcon_forum": "Questions should go to <a href=':1:'>Official Forums</a>",
  "support_please_note": "Пожалуйста, обратите внимание на следующие моменты:",
  "support_please_note_1": "Stack Overflow не является ресурсом, который используется только для поддержки Phalcon",
  "support_please_note_2": "Пожалуйста, не создавайте там сообщений об ошибках. Используйте <a href=':1:'>issue tracker</a> на Github для этих целей",
  "support_please_note_3": "Пожалуйста, не создавайте там запросы о новом функционале. Используйте <a href=':1:'>issue tracker</a> на Github для этих целей",
  "support_please_note_4": "Убедитесь, что вы отметили тэгом 'phalcon' ваш вопрос",
  "support_please_note_5": "Убедитесь, что вы упоминаете слово 'Phalcon' в вопросе",
  "support_reporting_a_bug": "Сообщение об ошибке",
  "support_reporting_a_bug_0": "If you still believe that what you found is a bug, please <a href=':1:'>open an issue</a>",
  "support_reporting_a_bug_1": "Пожалуйста, сообщайте об ошибках, когда вы испробовали все из вышеперечисленных вариантов, используя <a href=':1:'>issue tracker</а> на Github.",
  "support_slack": "There is a less active but still functioning community on <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Another way is to ask a question on <a href=':1:' target='_blank'>Stack Overflow</a> and tag it with <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Our social network accounts are: <a href=':1:'>Gab.ai</a> , <a href=':2:'>Twitter</a> and <a href=':3:'>Facebook</a>",
  "support_us": "Поддержать",
  "team": "О команде",
  "team_andres_1": "Андрес &mdash; не случайный человек в open-source сообществе. Последние девять лет он разрабатывает и выпускает фреймворки для PHP и принимает участие в веб-разработке &mdash; его главной страсти.",
  "team_andres_2": "Лидер списка TR35, Андрес руководствуется принципом \"всегда выбирать и реализовывать или использовать правильный инструмент для работы, ориентированной, главным образом, на высокую производительность\". Поэтому в 2011 году появилась идея: создать новый тип фреймворка для PHP разработчиков, который фокусируется на удобстве, функциональности и высокой производительности.",
  "team_andres_3": "В результате реализации этой идеи появился Phalcon. PHP фреймворк, написанный на C, который может предложить массу возможностей для разработчиков при максимальной производительности и минимальном использовании ресурсов системы.",
  "team_andres_4": "Андрес является одним из основных разработчиков Phalcon и его идейным вдохновителем.",
  "team_eduar_1": "Эдуар является C/PHP разработчиком с богатым опытом в разработке приложений. Он является одним из основателей и ведущих разработчиков проекта Phalcon, который зародился в 2011 году.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar likes science fiction movies and sometimes plays football.",
  "team_nikolay_1": "Николай занимается разработкой веб-приложений уже более 10 лет. Он принимал участие в проектах с высокой нагрузкой.",
  "team_nikolay_2": "Николай работает с Open Source проектами в течение длительного времени, используя их во всех случаях, когда это позволяют требования. В свободное время он начал сотрудничать с сообществом, предлагая архитектурные изменения и высказывая различные идеи по оптимизации, в том числе, с целью повышения производительности. Он сыграл важную роль в улучшении Open Source CMS проектов, которое получило высокую оценку сообщества.",
  "team_nikolay_3": "Его постоянное участие в open source проектах помогло ему повысить свой уровень профессионализма и, в то же время, внести вклад в развитие сообщества.",
  "team_nikolay_4": "Николай является ярым сторонником максимальной производительности в веб-приложениях. После вступления в команду Phalcon он решил продолжить работу с проектом и стать его проповедником. Он возглавляет русское сообщество и осуществляет поддержку русскоязычных ресурсов.",
  "team_nikolay_5": "Его вклад в проект: зеркало основного сайта на русском языке (<a href=':1:'>http://www.phalcon.ru </a>), зеркало репозитория документации на русском языке (<a href = ':2:'>http://docs.phalconphp.ru <\\/a>), текущие изменения и исправления в документации на английском языке, группа в социальной сети ВКонтакте (<a href=':3:'>https://vk.com/phalconphp<\\/a>).",
  "team_nikos_1": "Никос работает в ИТ-индустрии более 20 лет. Он пришёл в мир PHP в 2000 году и с тех пор использует его в личных проектах, а также проектах своих работодателей.",
  "team_nikos_2": "Ему нравится открывать новые технологии и способы их интеграции с существующими приложениями и, таким образом, использовать преимущества, которые они предлагают.",
  "team_nikos_3": "Он заядлый сторонник Test Driven Development (TDD) и всегда старается получить полное покрытие кода.",
  "team_nikos_4": "Постоянный интерес Никоса к инновационным технологиям, нарушающим традиционные подходы, познакомил его с Phalcon. Он присоединился к команде и в настоящий момент его задачи в основном связаны c координацией запросов на новые функциональности и исправления ошибок, тестированием, подготовкой документации и работой с инкубатором. Никос также отвечает за поддержание Windows библиотеки DLL для проекта и оказывает другую  помощь.",
  "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
  "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
  "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
  "team_serghei_1": "Сергей является Ruby/PHP разработчиком более 8 лет. Он специализируется на разработке web-приложений. Как ярый сторонник Behavior Driven Development (BDD), также он является членом команды <a href=':1:'>Codeception</a>.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Шаблонизатор (Volt)",
  "template_engine_volt_1": "Volt является ультра-быстрым и дружелюбным языком шаблона, написанным на Zephir/C для PHP. Он предоставляет вам набор хелперов для написания представлений легким способом. Volt сильно интегрирован с другими компонентами Phalcon. Также вы можете использовать его в качестве самостоятельного компонента в вашем приложении.",
  "template_engine_volt_description": "A template engine inspired by Jinja but built in C for PHP",
  "template_engines": "Шаблонизаторы",
  "template_engines_1": "Views represent the user interface of your application. Views are often HTML files with embedded PHP code that perform tasks related solely to the presentation of the data. Views handle the job of providing data to the web browser or other tool that is used to make requests from your application.",
  "template_engines_description": "Views represent the user interface of your application",
  "testimonials": "Отзывы",
  "testimonials_1": "Привет, команда Phalcon! У меня есть проект, построенный на фреймворке Phalcon. Это Guitarama (<a href=':1:'>:2:</a>) -  каталог нот и аккордов для гитары. Сайт ориентирован на русскую аудиторию и использует русский язык, но я надеюсь, что не будет никаких проблем с пониманием содержания большинства страниц. Сайт был вновь запущен на новой платформе в начале января 2013 года и с тех пор показывает устойчивый рост. Ежедневная статистика на данный момент: ~ 1500 уникальных посетителей, ~ 5000 просмотров страниц. Сайт работает на старом сервере 1\\u0445P4-3Ghz, 4 Гб оперативной памяти. Еще раз благодарю Вас за отличный фреймворк и все, что вы делаете :) Michael.",
  "testimonials_2": "Привет, команда Phalcon. Я хотел бы поделиться нашими результатами использования Phalcon в проектах <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a>, наиболее посещаемых и высоконагруженных сайтах в Казахстане, которые входят в TOP-10 рейтинговых каталогов СНГ. Оба сайта работают на RESTful-like API, написанном на Phalcon\\Mvc\\Micro. При пиковых нагрузках API обрабатывает около 400 req/sec, и это не предел. Переход на Phalcon позволил нам сократить время ответа и использования CPU и RAM, а также сократить сроки разработки. Мы продолжим использовать Phalcon в наших новых проектах. Спасибо за большую работу, которую вы делаете. С уважением, Никита Вершинин, ведущий разработчик, Kolesa.kz и krisha.kz",
  "testimonials_3": "Команда Phalcon, фреймворк, который вы, ребята, создали - удивителен. Я никогда ранее не использовал фреймворк, который объединил в себе скорость, эффективность, краткость и естественность. Я хотел бы содействовать развитию проекта любым возможным способом. Я недавно начал работу над ~800 часовым проектом и я рад сообщить, что мы используем Phalcon Framework. Браво. Брайан Сеймур",
  "testimonials_4": "Привет, ребята, я просто ознакомился с Phalcon, и это просто потрясающе! Я всего лишь хотел сказать вам, какие вы молодцы! Так что, спасибо за этот фреймворк и продолжайте в том же духе! Ivan Penchev",
  "testimonials_5": "Привет ребята. Я написал простой сервис коротких ссылок, использующий Phalcon. Это было удивительно! На самом деле. <a href=':1:'>:2:</a>. Демо здесь <a href=':3:'>:4:</a> :) Murat K\\u00fc\\u00e7\\u00fckosman",
  "testimonials_6": "Здравствуйте, команда Phalcon. Я создал небольшой проект, предназначенный для польских пользователей, используя ваш фреймворк. Я должен признать, что производительность потрясающая. Поздравляю, хорошая работа. Сервис для проверки содержимого веб-страниц на польском языке <a href=':1:'></a>:2:</a>",
  "testimonials_7": "Привет ребята! Я хотел поделиться с вами последней версия нашего старого проекта - <a href=':1:'>:2:</a>. Переход на Phalcon позволил вдвое снизить нагрузку на сервер по сравнению с предыдущим фреймворками, и это здорово!",
  "testimonials_description": "Ниже опубликованы отзывы и результаты использования Phalcon, которые мы получили от вас, разработчиков и пользователей Phalcon PHP. Мы всегда рады письмам с вашими отзывами и будем размещать их в нашем блоге. Если вы хотите прислать нам свои результаты или связаться с нами, не стесняйтесь, пишите нам по адресу <a href='mailto::1:'>:2:</a>.",
  "toggle_navigation": "Переключить навигацию ",
  "transactions": "Транзакции",
  "transactions_1": "When a process performs multiple database operations, it might be important that each step is completed successfully so that data integrity can be maintained. Transactions offer the ability to ensure that all database operations have been executed successfully before the data is committed to the database.",
  "transactions_2": "Create a transaction manager",
  "transactions_3": "Request a transaction",
  "transactions_4": "Get the robots to be deleted",
  "transactions_5": "Something's gone wrong, we should rollback the transaction",
  "transactions_6": "Everything's gone fine, let's commit the transaction",
  "transactions_7": "Robots were deleted successfully!",
  "transactions_8": "Failed, reason: ",
  "transactions_description": "Transactions in Phalcon allows to keep the data integrity safe.",
  "try_phalcon": "Начать",
  "tutorial": "Руководство",
  "twitter": "Twitter",
  "views_and_frontend": "Представления и фронтенд",
  "vimeo": "Vimeo",
  "watch_demo": "Watch the demo video",
  "zephir": "Zephir",
  "telegram": "Telegram",
  "mewe": "MeWe",
  "parler": "Parler",
  "stack_overflow": "Stack Overflow"
}
