{
  "about": "Про проект",
  "about_blog": "БЛОҐ",
  "about_blog_1": "Якщо ви любите писати, пам'ятайте, що <a href=':1:'>наш блоґ </a> відкритий для публікації навчальних матеріалів створених вами. Якщо у вас є власний блоґ і ви написали що-небудь про Phalcon ми можемо опублікувати це на наших сторінках у соціальних мережах, щоб забезпечити вашому запису максимальну видимість. Якщо ж ваша публікація не англійською, тоді ми можемо поширити її та, якщо це можливо, перекласти. Якщо вам відомі блоґи про PHP з матеріалами про Phalcon - дайте нам знати.",
  "about_description_1": "Дивовижні проекти потребують дивовижних рук. Скоріш за все ми ще не знайомі але ми думаємо, що чудово підходите до побудови кращого вебу. Разом ми готові змінити світ! Тут, на Phalcon, ми будуємо PHP-фреймворк нового покоління; ми хочемо дати вам неймовірну продуктивність та допомогти вам розвиватися у легкій та грайливій формі.",
  "about_description_2": "Сподіваємось, ви насолоджуватиметеся Phalcon як і ми. Ми завжди раді вашій співпраці та допомозі! <strong>Вам не обов'язково бути C-розробником, щоб допомогти Phalcon!</strong> Є багато інших місць, де ви можете допомогти:",
  "about_documentation": "ДОКУМЕНТАЦІЯ",
  "about_documentation_1": "The repository of this website is available on <a href=':1:'>github</a>. We are using that repository as a source for our documentation for the English language only!.<br /><br />We always appreciate corrections, additions and enhancements in our documentation, so all you have to do is clone the repository and issue a pull request!<br /><br />If you can help non English speaking developers by translating some of the content to another language, that would be great! We are using <a href=':2:'>:3:</a> for our translations, and you can find our project <a href=':4:'>here</a>",
  "about_donations_sponsoring": "ПОЖЕРТВУВАННЯ / СПОНСОРСТВО",
  "about_evangelism": "ЄВАНГЕЛІЗМ",
  "about_evangelism_1": "Багато людей ще й досі не здогадуються про існування Phalcon або сумніваються, що він дійсно працює. Ми впевнені, що багато розробників тільки виграють від того, що дізнаються про Phalcon, про те, як він може допомогти їм. Якщо вам відома будь-яка PHP подія/зустріч, й ви хотіли б виступити з докладом про проект, ми вас повністю підтримаємо. Хто б не хотів би дізнатися про інструмент, який так трансформує розробку для PHP?",
  "about_facebook_page": "Сторінка у Facebook",
  "about_flying_with_phalcon": "Дякуємо за політ з Phalcon! &lt;3",
  "about_follow_on_gab": "Ми у Gab",
  "about_follow_on_twitter": "Ми у Twitter",
  "about_google_plus_page": "Сторінка у Google+",
  "about_official_blog": "Офіційний блоґ",
  "about_sample_applications": "ПРИКЛАДИ ПРОГРАМ",
  "about_sample_apps_1": "Велика кількість прикладів допомагає іншим краще зрозуміти, наскільки великі речі можна створити за допомогою Phalcon. Не соромтеся ділитися репозиторіями, які допоможуть іншим з їх роботою а також приймайте відгуки інший щодо вашої робот!",
  "about_screencasts": "СКРІНКАСТИ",
  "about_screencasts_1": "Усі ми любимо переглядати скрінкасти. Якщо у вас є зайва хвилинка та бажання допомогти спільноті розібратися з будь-якою функцією фреймворку - створіть відеоурок. Ми будемо дуже вдячні. Ознайомтеся з нашим <a href=':1:'>Vimeo каналом</a> в якості прикладу.",
  "about_share_experiences_1": "Не соромтеся ділитися із спільнотою вашим досвідом роботи з Phalcon. Якщо Phalcon допоміг вашому проекту досягнути успіху, розповідайте про це. Крім того, приймайте участь в обговоренні, які з компонентів потребують допрацювання, що можна було б зробити простіше, які переваги у розробці вам надав Phalcon. Хоч і не всі нові функції можуть бути реалізовані негайно, ваші зауваження та відгуки дозволять значно допомогти нам визначити майбутнє проекту. Ваші відгуки допомагають нам робити Phalcon краще.",
  "about_share_your_experiences": "ДІЛІТЬСЯ ДОСВІДОМ",
  "about_social_networks": "СОЦІАЛЬНІ МЕРЕЖІ",
  "about_social_networks_1": "Phalcon is evolving on a daily basis, through our desire to make it better. Social networks are part of our lives now, and we all interact with others through them. Sharing your Phalcon experience with your social circles will greatly increase the visibility of the project. More and more people will engage in our community, thus making it more powerful, even more feature rich and popular. Like, '+1', share posts that we constantly post on every social network, engage in discussions regarding those posts. People who discover Phalcon through your interactions will thank you!",
  "about_social_networks_2": "We have a presence in most of the popular social networks. By following us, you are helping us increase the project's visibility: ",
  "about_sponsoring_1": "We're a tiny but effective core team of developers working our tails off. We try to spend as much time as possible on the project. All our passion for this project makes us want to be better every day. Phalcon is open-sourced software and volunteer efforts are needed for its constant evolution. You can help us keep the development active by donating to the project or sponsoring the development. More time and resources dedicated to the project means more activity, more improvement, better support, more amazing features, etc.",
  "about_star_on_github": "Додати нам зірку на Github",
  "about_tests": "ТЕСТИ",
  "about_tests_1": "У кожній програмі є помилки. Якщо ви знайшли помилку в Phalcon, будь ласка, не соромтеся та повідомте нам. У нас є тестовий набір із <a href=':1:'>16,000</a> тестів. Проте, юніт-тестів завжди мало. Допоможіть нам покращити існуючі тести, або додайте нові. Кожен доданий тест робить фреймворк стабільнішим.",
  "about_thank_you": "СПАСИБІ!",
  "about_thank_you_1": "We would like to thank all of our contributors and members of the community for pushing us to make Phalcon the best framework of its kind. Your kind words and engagement is what drives us to do better. We hope to meet and exceed the trust you put in Phalcon.",
  "about_translations": "ПЕРЕКЛАДИ",
  "about_translations_1": "Ми прагнемо охопити настільки велике коло розробників, наскільки це можливо, долаючи мовні бар'єри. Ми використовуємо <a href=':1:'>:2:</a>, щоб обробляти усі слова або речення, які необхідно перекласти для цього сайту. Репозиторій проекту розташований <a href=':3:'>here</a>.",
  "acl": "ACL",
  "acl_1": "Так ви можете створити список контролю доступу (ACL):",
  "acl_2": "Створення ACL",
  "acl_3": "Дія за замовчуванням - ЗАБОРОНА  доступу",
  "acl_4": "Реєструємо дві ролі; Зареєстрованих користувачів",
  "acl_5": "та гостей, які є користувачами без визначеного ідентифікатора",
  "acl_description": "Список контролю доступу надає користувачам доступ до авторизованих модулів",
  "api": "API",
  "auto_loader": "Автозавантажувач",
  "auto_loader_1": "Реєструйте простори імен, префікси, каталоги або класи. Скористайтеся перевагами автозавантаження подій та зберігайте повний контроль над тим, які файли завантажуються і звідки.",
  "auto_loader_2": "Створення автозавантажувача",
  "auto_loader_3": "Реєструємо деякі простори імен.",
  "auto_loader_4": "Реєструємо автозавантажувач",
  "autoloader": "Автозавантажувач",
  "autoloader_description": "Забезпечує механізм автозавантаження класів PHP, згідно PSR-4.",
  "basic_features": "Основні функції",
  "blog": "Блоґ",
  "built_with_phalcon": "Створені на Phalcon",
  "cache": "Кеш",
  "cache_1": "Кеш надає швидкий доступ до даних, які часто використовуються або вже оброблені. Він підтримує безліч рушіїв, таких як: Redis, Memcached, Mongo, Apc, файли та інші",
  "cache_2": "Встановлюємо сервіс кешування для моделей",
  "cache_3": "Кешуємо дані на один день",
  "cache_4": "Налаштовуємо підключення для Memcached",
  "cache_description": "Збільши продуктивність за допомогою багатьох бек-енд кеш провайдерів",
  "community": "Спільнота",
  "consulting": "Консалтинг",
  "consulting_header": "We have partnered with LEZGRO, a company that specializes in web and mobile application development and is very adept in delivering Phalcon powered applications to their clientele.",
  "consulting_lezgro_1": "LEZGRO congratulates you with the your choice of making Phalcon central in your technology stack!",
  "consulting_lezgro_2": "Since our company first saw the light of the day in 2003, we have tried various technologies and approaches in software development.",
  "consulting_lezgro_3": "Product managers, CTOs, and non-technical founders involve LEZGRO to build products that stand out, quickly and with a high quality.",
  "consulting_lezgro_4": "Now that we have acquired positive experience with Phalcon, we are open to advise you on making the decision to develop on Phalcon, and help you bring your Phalcon-based product to market.",
  "consulting_lezgro_5": "Contact LEZGRO through our <a href=':1:'>website</a>, where you can also see samples and testimonials of our work.",
  "consulting_mctekk_1": "MCTekK jumped on the Phalcon wagon since day one. From its conception we saw the great advantages that Phalcon was offering and could offer in the future.",
  "consulting_mctekk_2": "We have ample experience with Phalcon and have developed a myriad of project with it as the core. We are here to advise you on anything you need concerning Phalcon to help you improve your readiness, quickness and quality.",
  "consulting_mctekk_3": "Contact us through our <a href=':1:'>website</a>, where you can take a look at the projects we have been involved in.",
  "consulting_mctekk_header": "MCTekK has already delivered various high end Phalcon projects, with their main strengths being web and mobile development.",
  "contribute": "Про нас",
  "contributors": "Творці Phalcon",
  "contributors_description": "Кожного дня Phalcon покращується нашою дивовижною спільнотою",
  "crypt": "Шифрування",
  "crypt_description": "Користуйтеся шифруванням, аби вберегти дані від несанкціонованого доступу третіх осіб",
  "data_and_storage": "Дані та зберігання",
  "dependency_injection": "Впровадження залежностей",
  "dependency_injection_1": "Phalcon побудований на потужному та водночас простому в розумінні та використанні шаблоні, який називається Впровадження залежностей. Ініціювавши чи визначивши сервіси один раз - можна використовувати їх практично по всій програмі.",
  "dependency_injection_2": "Створюємо контейнер Dependency Injector",
  "dependency_injection_3": "Реєструємо класи, функції, компоненти",
  "dependency_injection_4": "Доступ з будь-якого місця програми",
  "dependency_injection_description": "Впровадження залежностей, локатор сервісів і контейнер для них.",
  "discord": "Discord",
  "docs": "Документація",
  "documentation": "Документація",
  "donate": "Підтримати",
  "download": "Завантажити",
  "download_arch": "Arch Linux",
  "download_arch_1": "Існує PKGBUILD для ArchLinux, доступний <a href=':1:'>тут</a>",
  "download_box_1": "Поле #1",
  "download_box_2": "Поле #1",
  "download_box_doc_root": "Кореневий каталог: :1: ",
  "download_box_user_pass": "Користувач MySQL: :1:  Пароль: :2: ",
  "download_compilation": "Компіляція",
  "download_compilation_1": "На Linux можна легко зібрати і встановити розширення з сирців.",
  "download_compilation_11": "1. Щоб скомпілювати розширення з вихідних кодів виконайте такі дії: ",
  "download_compilation_12": "2. Додайте розширення до вашого php.ini: ",
  "download_compilation_13": "3. Зрештою, перезапустіть веб-сервер",
  "download_cpanel": "cPanel",
  "download_cpanel_1": "Після прохань від спільноти, розробники cPanel випустили спеціальний модуль, який дозволяє встановлення Phalcon для сайтів, які використовують cPanel. Інформацію можна знайти <a href=':1:'>тут</a>. Модуль підтримується на <a href=':2:'>Github</a>.",
  "download_dependencies": "Залежності",
  "download_dependencies_1": "Although Phalcon does not binary link to other extensions it does use some of them to offer functionality. The extensions used are: ",
  "download_dependencies_2": "It is not necessary for all the above extensions to be present in the system that has Phalcon installed. You can only install the ones that meet your needs. For instance if you use a MySQL database, then you can only load PDO and PDO/MySQL ignoring the Oracle, SQlite, Postgresql and Mongo.",
  "download_developer_tools": "Інструменти розробника",
  "download_devtools_1": "These tools are a collection of useful scripts to generate skeleton code. Core components of your application can be generated with a simple command, allowing you to easily develop applications using Phalcon.",
  "download_devtools_composer": "Встановлення за допомогою Composer",
  "download_devtools_composer_1": "Встановіть Composer у загальну теку або у ваш проект: ",
  "download_devtools_composer_2": "Створіть файл composer.json і напишіть у ньому: ",
  "download_devtools_composer_3": "Запустіть встановлення через composer: ",
  "download_devtools_composer_4": "Створіть символічне посилання на файл phalcon.php: ",
  "download_devtools_docs": "Документація: <a href=':1:'>Phalcon Developer Tools</a>",
  "download_devtools_download": "You can download or clone a cross platform package containing the developer tools from <a href=':1:'>Github</a>.",
  "download_docker": "Docker",
  "download_docker_1": "There are many ways that you can use Phalcon with Docker.",
  "download_docker_2": "Our official images are located <a href=':1:'>here</a>. We always welcome pull requests and improvements. The repository for the docker files is located here:",
  "download_docker_3": "With Phalcon-compose you can create an isolated environment with docker, that will allow you to use Phalcon without any additional installations. Note that using Phalcon Compose, requires ",
  "download_docker_4": "та",
  "download_docker_5": "Служби",
  "download_docker_6": "Phalcon Compose offers the following services by default:",
  "download_docker_7": "Phalcon Compose is very easy to use. Assume that you need to create an application that will be located in: ",
  "download_docker_8": "We will now need to run the following command for our container application can be created:",
  "download_docker_9": "The above command will download the skeleton of the docker environment.",
  "download_docker_10": "Змінні",
  "download_docker_11": "You will need to create a new file called",
  "download_docker_12": "у",
  "download_docker_13": "A sample file has been provided called",
  "download_docker_14": "Adjust the variables in that file to suit your needs. The most important variable is the",
  "download_docker_15": "Change the name to something you will be able to use. In our case we just leave the default called ",
  "download_docker_16": "Open your hosts file (<code>/etc/hosts</code>) and enter a new line like this:",
  "download_docker_17": "You might want to edit the <code>docker-compose.yml</code> file and remove services that you will not be using. Phalcon Compose offers a lot of services as mentioned above, so your application might not need some of them. Removing the relevant services from the <code>docker-compose.yml</code> file will reduce memory usage of your environment.",
  "download_docker_18": "Побудова",
  "download_docker_19": "You can now build the environment.",
  "download_docker_20": "Containers will be downloaded as needed and set up on your environment.",
  "download_docker_21": "Launch",
  "download_docker_22": "You can now launch the environment:",
  "download_docker_23": "Go to :1: in your browser and you will see your environment is set up. You can now develop your application in the app folder.",
  "download_docker_24": "Shutdown",
  "download_docker_25": "To shut down the environment when is no longer needed you can issue the following command:",
  "download_docker_26": "Додаткову інформацію можна знайти на: ",
  "download_examples": "Попередньо встановлені приклади",
  "download_examples_1": "The following examples are pre-installed on each vagrant box: ",
  "download_freebsd": "FreeBSD",
  "download_freebsd_1": "Порт наявний для FreeBSD. Вам необхідно тільки виконати одну з цих команд щоб встановити його: ",
  "download_ide_stubs": "Заглушки IDE",
  "download_ide_stubs_1": "The video below outlines how to enable IDE stubs for PhpStorm",
  "download_linux": "Linux/Unix/Mac",
  "download_need_help": "Потрібна допомога?",
  "download_need_help_1": "Have a look at our <a href=':1:'>support page</a> for ways to get support. We will do our best to help you.",
  "download_note": "Phalcon це C-розширення, тому вам потрібно завантажити двійковий файл для вашої платформи, або скомпілювати його з вихідних кодів.",
  "download_opensuse": "OpenSUSE",
  "download_opensuse_1": "There is a package available <a href=':1:'>here</a> (thanks to <a href=':2:'>Mariusz Łączak</a>)",
  "download_requirements": "Вимоги",
  "download_requirements_1": "У вас повинні бути встановлені наступні пакети: ",
  "download_requirements_2": "Інструменти розробки PHP 5.x",
  "download_requirements_3": "Компілятор GCC",
  "download_source_code": "Source Code:  <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_source_code_switch": "Source Code (please switch to the relevant branch): <a href=':1:' target='_download' title='GitHub Repo'>github</a>",
  "download_ubuntu": "Щоб встановити Phalcon на Ubuntu або Debian, потрібно виконати такі дії: ",
  "download_ubuntu_1": "If you are missing apt-add-repository run the following command: ",
  "download_ubuntu_2": "If you wish to install the legacy version of Phalcon (1.x) use the following PPA: ",
  "download_ubuntu_or_debian": "Ubuntu або Debian",
  "download_vagrant": "Vagrant",
  "download_vagrant_1": "<a href=':1:'>Vagrant</a> is an excellent tool to create and configure lightweight, reproducible, and portable development environments.",
  "download_vagrant_2": "Use any of the following boxes to test or develop with Phalcon on a pre-configured environment.",
  "download_vagrant_boxes": "Vagrant Boxes",
  "download_windows": "DLL для Windows",
  "download_windows_download": "Завантажити",
  "download_windows_dlls": "DLL для Windows можна завантажити з нашої сторінки випусків Github <a href=':1:'>тут</a>",
  "download_windows_guides": "Пов'язані довідники",
  "download_windows_guides_wamp": "Встановлення на WAMP",
  "download_windows_guides_xampp": "Встановлення на XAMPP",
  "download_windows_installation": "Встановлення",
  "download_windows_installation_1": "Для використання phalcon у Windows ви можете завантажити DLL-бібліотеку. Відредагуйте ваш php.ini, додавши в кінці підключення модуля, і перезавантажте ваш веб-сервер, щоб застосувати зміни.<a href=':1:'>Детальніше</a>.",
  "download_windows_note": "We highly recommend you use the latest version of PHP corresponding to our DLLs, so as to take advantage of the full feature set of Phalcon.",
  "download_windows_older": "Застарілі версії",
  "download_windows_stable": "Stable/Master versions",
  "encryption": "Шифрування",
  "encryption_1": "Phalcon забезпечує шифрування об'єктів за допомогою компоненту Phalcon\\Crypt. Цей клас пропонує просту, об'єктно-орієнтовану обгортку для PHP-бібліотеки шифрування openssl.",
  "encryption_2": "Це секретний ключ (32 байта).",
  "encryption_3": "Це текст, який ви бажаєте зашифрувати.",
  "events": "Події",
  "events_description": "Розширюйте більшість основних компонентів, встановивши \"умови спрацювань\". Створіть свої власні події та зробіть свою програму більш гнучкою та потужною",
  "events_management": "Керування подіями",
  "events_management_1": "EventsManager дозволяє нам додавати слухачів до певного типу подій. Зараз нас цікавить тип \"диспетчер\". Наступний код фільтрує всі події, створені диспетчером:",
  "events_management_2": "Створіть менеджер подій",
  "events_management_3": "Додати прослуховування події в SecurityPlugin",
  "events_management_4": "Обробка винятків та винятків, які відповідають за незнайдені елементи за допомогою NotFoundPlugin",
  "events_management_5": "Призначте менеджер подій диспетчеру",
  "facebook": "Facebook",
  "flash_messages": "Інфоповідомлення",
  "flash_messages_1": "Використовуйте інфоповідомлення, щоб показати користувачу сповіщення у веб-програми:",
  "flash_messages_2": "де сталися помилку у формі",
  "flash_messages_3": "так!, усе пройшло дуже добре",
  "flash_messages_4": "це повідомлення для користувачів",
  "flash_messages_5": "це просто попередження",
  "flash_messages_description": "Інфоповідомлення використовуються, щоб сповістити користувача про стан дій.",
  "forms_builder": "Конструктор форм",
  "forms_builder_1": "Кожен елемент у формі може бути відрендерений відповідно до вимог розробника. Внутрішньо, Phalcon\\Tag використовується для створення правильного HTML для кожного елемента, і ви можете передати додаткові атрибути HTML в якості другого аргументу в render():",
  "forms_builder_2": "Головна",
  "forms_builder_3": "Мобільний телефон",
  "forms_builder_description": "З легкістю створюйте HTML-форми",
  "forum": "Форум",
  "gab": "Gab.ai",
  "get_phalcon": "Отримати Phalcon :1:",
  "github": "GitHub",
  "google_plus": "Google Plus",
  "header_slogan": "Інноваційна архітектура робить Phalcon найшвидший PHP-фреймворком!",
  "header_tagline": "Повнофункціональний PHP-фреймворк, що поставляється як C-розширення",
  "high_performance_php_framework": "Високопродуктивний PHP-фреймворк",
  "hosting": "Хостинг",
  "hosting_amazon_ec2_1": "Amazon Elastic Compute Cloud delivers scalable, pay-as-you-go compute capacity in the cloud.",
  "hosting_amazon_ec2_2": "Select a pre-configured, templated Amazon Machine Image (AMI) to get up and running immediately. Or create an AMI containing your applications, libraries, data, and associated configuration settings. <a href=':1:'>See more</a>",
  "hosting_amazon_ec2_title": "Amazon EC2",
  "hosting_aspnix_1": "ASPnix provides superior Windows web hosting services. Our customers have rated our service as outstanding. We offer economical plans for shared Windows and Linux cPanel web hosting, Virtual private servers and dedicated servers!  <a href=':1:'>See more</a>",
  "hosting_aspnix_2": "Phalcon is supported on all Windows shared web hosting packages and plans, no configuration or installation required! They offer a variety of PHP versions from 5.2 - 7.0 as well as many <a href=':1:' target=\"_blank\">additional extensions</a>!",
  "hosting_aspnix_title": "ASPnix",
  "hosting_azure_1": "The <a href=':1:'>Windows Azure cloud</a> provides you with highly scalable and manageable Windows hosting for your web apps. Use Phalcon to reduce your instance costs.",
  "hosting_azure_2": "To install Phalcon, follow the step by step procedure in <a href=':1:'>this SitePoint article</a>.",
  "hosting_azure_title": "Windows Azure",
  "hosting_description": "Phalcon can be installed on any machine on which the hosting provider offers SSH root access (or sudo). Below is a list of reputable companies that offer such services: ",
  "hosting_digital_ocean_1": "Blazing Fast Cloud Technology. Built for developers. Deploy an SSD cloud server in 55 seconds. <a href=':1:'>See more</a>",
  "hosting_digital_ocean_2": "Follow this <a href=':1:'>tutorial</a> to get started",
  "hosting_digital_ocean_title": "Digital Ocean",
  "hosting_dcthost_1": "DCT Host offers multiple affordable and high quality hosting plans.",
  "hosting_dcthost_2": "By default, they have Phalcon installed on all their shared hosting packages.",
  "hosting_dcthost_title": "DCT Host",
  "hosting_fortrabbit_1": "Fortrabbit offers many hosting plans (there is one for developers and is free - with some limitations) that would satisfy the needs of most of the developers that wish to either try Phalcon or deploy their applications using it.",
  "hosting_fortrabbit_2": "They offer a variety of <a href=':1:'>extensions</a> that would satisfy even the most demanding project.",
  "hosting_fortrabbit_3": "Stable versions of Phalcon are pre-installed, you can activate them from the administration dashboard.",
  "hosting_fortrabbit_title": "Fortrabbit",
  "hosting_install_instructions": "Встановіть Phalcon за допомогою стандартних інструкцій установки.",
  "hosting_kinghost_1": "Since 2006, KingHost is one of the largest hosting company sites in Brazil and already has over 300,000 sites hosted with approximately 60,000 customers. Headquartered in Porto Alegre (RS) , with data centers in Brazil , the company offers the hosting service of shared servers, specific plans for custom developers and projects in the area of enterprise solutions , including cloud computing and dedicated servers. It also offers digital marketing solutions such as email marketing and security solutions.",
  "hosting_kinghost_title": "KingHost",
  "hosting_layershift_1": "Next generation, auto-sizing PaaS for Java, PHP, Ruby, Python, and Node.js apps. Fully isolated self-scaling role-based containers for each customer, including choice of Apache or Nginx, and full range of SQL and NoSQL servers. Pay for resource usage, not server instance size. SSD-powered. UK hosted.",
  "hosting_layershift_2": "Follow this <a href=':1:'>tutorial</a> to get started",
  "hosting_layershift_title": "Layershift",
  "hosting_linode_1": "Deploy and Manage Linux Virtual Servers in the Linode Cloud. Get a server running in seconds with your choice of Linux distro, resources, and node location. <a href=':1:'>See more</a>",
  "hosting_linode_title": "Linode",
  "hosting_mediasecure_1": "High performance Dedicated Servers with protection against threats including Distributed Denial of Service (DDoS) attacks. Our high-capacity DDoS-Protected network can automatically protect your dedicated server from DDoS attacks up to 4.2 Tbps. <a href=':1:'>See more</a>",
  "hosting_mediasecure_title": "Mediasecure",
  "hosting_rackspace_1": "Cloud Servers are virtual machines running Linux or Windows&reg; Server in the Rackspace Cloud. You can scale resources like CPU, memory, and storage up or down, depending on your needs. Best of all, you can pay as you go. <a href=':1:'>See more</a>",
  "hosting_rackspace_title": "Rackspace",
  "hosting_webfaction_1": "WebFaction Hosting for developers. Full shell access to fast servers with all your favorite tools pre-installed and maintained for the user.",
  "hosting_webfaction_2": "To install Phalcon in WebFaction, follow the instructions outlined <a href=':1:'>here</a>",
  "hosting_webfaction_title": "WebFaction",
  "i18n": "i18n",
  "i18n_1": "Компонент Phalcon\\Translate допомагає створювати багатомовні програми. Програми, що використовують цей компонент, показують контент різними мовами, з огляду на обрану мову користувача, яку підтримує програма.",
  "i18n_2": "Запитуємо браузера, яка мова для нього найкраща",
  "i18n_3": "Перевіряємо, чи маємо ми файл перекладу для цієї мови",
  "i18n_4": "Якщо немає, підключаємо першопочаткову мову",
  "i18n_5": "Повертаємо об'єкт перекладу",
  "i18n_description": "Без проблем перекладайте свої програми багатьма мовами",
  "installing_phalcon_php": "Встановлення Phalcon PHP",
  "issue_tracker": "Трекер питань",
  "join_our_community": "Приєднуйтесь до нашої яскравої спільноти розробників!",
  "join_our_community_description": "Внесок спільноти у розширення, плагіни, адаптери, віртуальні машини, приклади, вихідний код... та багато іншого",
  "language_text": "Англійська",
  "learn": "Стисло",
  "license_new_bsd": "Phalcon is an open-source PHP framework <br />built as a C-extension. It is available under the <br /><a href='http://opensource.org/licenses/BSD-3-Clause' target='_blank'>new BSD License</a>.",
  "low_overhead": "Низьке споживання",
  "low_overhead_1": "Розширення Zephir/C завантажуються разом з PHP один раз, при запуску демона веб-сервера",
  "low_overhead_2": "Класи та функції, які надає розширення, готові до використання в будь-якій програмі",
  "low_overhead_3": "Код скомпільований та не інтерпретується, оскільки він уже скомпільований для певної платформи та процесора",
  "low_overhead_4": "Завдяки його низькорівневій архітектурі та оптимізаціям <strong>Phalcon забезпечує найнижчі навантаження для MVC-подібних програм</strong>",
  "low_overhead_description": "Низьке споживання пам'яті та процесорного часу в порівнянні з традиційними фреймворками",
  "low_overhead_title": "PHP C-extension (Phalcon)",
  "more": "БІЛЬШЕ...",
  "mvc": "MVC",
  "mvc_1": "Створюйте одно та багатомодульні програми з легкістю та задоволенням. Використовуючи структуру файлів, схему та шаблони, які ви вже знаєте.",
  "mvc_hmvc": "MVC і HMVC",
  "mvc_hmvc_description": "Модулі, компоненти, моделі, представлення та контроллери",
  "odm_for_mongo": "ODM для MongoDB",
  "odm_for_mongo_1": "На додачу до можливості оперувати таблицями у реляційних базах даних, Phalcon може оперувати документами в базі даних MongoDB. ODM пропонує CRUD-функціональність, події, перевірки серед інших сервісів.",
  "odm_for_mongo_2": "Скільки роботів?",
  "odm_for_mongo_3": "Скільки механічних роботів?",
  "odm_for_mongo_4": "Тут :1: роботів",
  "odm_for_mongo_description": "Object Document Mapping for MongoDB",
  "oops": "Х'юстон у нас проблема!",
  "or": "або",
  "orm": "ORM",
  "orm_1": "Phalcon поставляється із потужною ORM, яка дозволяє кенрувати записами бази даних через класи та об'єкти. MySQL, PostgreSQL та SQLite підтримуються з коробки.",
  "orm_description": "Об'єктно-реляційне відображення",
  "phalcon_team": "Команда Phalcon",
  "phalcon_team_1": "Та безліч інших людей",
  "phalcon_team_2": "Phalcon is and has always been an effort of many volunteers: ",
  "phql": "PHQL",
  "phql_1": "PHQL - це високорівневий об'єктно-орієнтований діалект SQL, який дозволяє писати запити з використанням стандартизованої SQL-мови. PHQL реалізується як синтаксичний аналізатор (написаний на C), який перетворює синтаксис у цільову RDBMS. Щоб досягти максимальної продуктивності, Phalcon надає аналізатор, який використовує ту ж саму технологію, що і SQLite. Ця технологія забезпечує невеликий, безпечний для потоків аналізатор, який міститься в оперативній пам'яті.",
  "phql_2": "Назва",
  "phql_description": "Потужна та безпечна Phalcon Query Language (мова запитів фалкон), PHQL",
  "polling_app": "Створення опитування з нуля за 15хв",
  "queueing": "Черги - фонові завдання",
  "queueing_1": "Такі дії, як обробка відео, зміна розміру зображень або надсилання електронних листів, не підходять для виконання в режимі онлайн або в режимі реального часу, оскільки це може призвести до уповільнення часу завантаження сторінок та серйозного впливу на взаємодію з користувачем. Найкращим рішенням тут є реалізація фонових завдань. Веб-програма ставить завдання в чергу та оброблятиме їх окремо.",
  "queueing_2": "Підключаємося до черги",
  "queueing_3": "Додаємо завдання в чергу",
  "queueing_description": "Використовуйте вбудовану в Phalcon систему черг, щоб запланувати завдання та зменшити навантаження на ваш веб-сервер",
  "resources": "Ресурси",
  "rest": "Rest",
  "rest_description": "У вашому розпорядженні мікро та повнорозмірна програма для вирішення вашого задачі. На додачу ще й потужний набір засобів для роботи із HTTP.",
  "restful_services": "Restful Services",
  "restful_services_1": "Написання REST-серверів та програм ніколи не було простіше. Ніякої рутини. Прості сервіси помістяться в один файл.",
  "restful_services_2": "Повертаємо дані в JSON-фрматі",
  "roadmap": "План розвитку",
  "router": "Маршрутизатор",
  "router_1": "Маршутизація як вона є. Нічого більше. Нічого менше.",
  "router_2": "Створюємо маршутизатор",
  "router_3": "Визначаємо маршрут",
  "router_description": "Phalcon\\Mvc\\Router надає розширені можливості маршрутизації.",
  "sample_applications": "Sample applications",
  "see_for_yourself": "Переконайтесь самі...",
  "sharding": "Шардування",
  "sharding_1": "Прикріпіть моделі до різних баз даних",
  "sharding_2": "Цей сервіс повертає базу даних MySQL",
  "sharding_3": "Цей сервіс повертає базу даних PostgreSQL",
  "sharding_description": "Підключайте, зберігайте та отримуйте дані з багатьох баз даних одночасно",
  "slack": "Slack",
  "something_went_wrong": "Щось пішло не так :(",
  "sponsored_by": "За підтримки",
  "sponsors": "Спосори",
  "sponsors_and_supporters": "Sponsors and Supporters",
  "sponsors_and_supporters_upper": "SPONSORS AND SUPPORTERS",
  "sponsors_become_patron": "Станьте патроном!",
  "sponsors_description_1": "For those that wish to sponsor our work and further the development of Phalcon, we offer various sponsorship options that will fit any budget. Sponsoring our work allows us to devote more time to the project, offer faster responses to bugs and features and ensure the projects's stability.",
  "sponsors_our_great_sponsors": "These are our sponsors! Thank you!!",
  "stack_overflow": "Stack Overflow",
  "store": "Магазин",
  "support": "Підтримка",
  "support_discord": "Come join the Phalcon <a href=':1:'>Discord</a>",
  "support_documentation_1": "Please use the :1: before anything else. You can also use the search feature in our documents to find what you are looking for. If your question is still not answered, there are more options below.",
  "support_download_page": "download page",
  "support_note_1": "Our great community and contributors are happy to help you though! Please use these community resources for obtaining help.",
  "support_note_2": "Many bugs are raised because users are not running the latest version. Please visit the :1:, download the latest available version (or compile it) and confirm if the issue you are experiencing is indeed a bug.",
  "support_phalcon_forum": "Questions should go to <a href=':1:'>Official Forums</a>",
  "support_please_note": "Please note: ",
  "support_please_note_1": "Stack Overflow is not dedicated to support Phalcon",
  "support_please_note_2": "Please do not raise new bugs there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_3": "Please do not ask for feature requests there. Please use the <a href=':1:'>issue tracker</a> in Github for that",
  "support_please_note_4": "Make sure you include the 'phalcon' tag with your question",
  "support_please_note_5": "Make sure you mention 'Phalcon' in the question",
  "support_reporting_a_bug": "Reporting a bug",
  "support_reporting_a_bug_0": "If you still believe that what you found is a bug, please <a href=':1:'>open an issue</a>",
  "support_reporting_a_bug_1": "Please report bugs when you've exhausted all of the above options, using the <a href=':1:'>issue tracker</a> in Github.",
  "support_slack": "There is a less active but still functioning community on <a href=':1:'>Slack</a>",
  "support_stack_overflow": "Another way is to ask a question on <a href=':1:' target='_blank'>Stack Overflow</a> and tag it with <a href=':2:'><code>phalcon</code></a>",
  "support_social_network_accounts": "Our social network accounts are: <a href=':1:'>Gab.ai</a> , <a href=':2:'>Twitter</a>, <a href=':3:'>Facebook</a> and <a href=':4:'>Google+</a>",
  "support_us": "Підтримайте нас",
  "team": "Команда",
  "team_andres_1": "Andres is no stranger to open source projects. In the last nine years, he has designed and released frameworks for PHP and has been involved in web development - his main passion.",
  "team_andres_2": "A TR35 winner, Andres' main drive is to always choose and implement or use the right tool for the job, mostly focused on performance. Therefore in 2011 a new idea was in the works; to create a new kind of framework for PHP developers, one that focuses on usability, features and mostly performance.",
  "team_andres_3": "Through this new innovative approach Phalcon was born. A PHP framework written in C that can offer a wealth of features to developers while maximizing performance and keeping resource utilization low.",
  "team_andres_4": "Andres is one of the core developers of Phalcon and its inspiration.",
  "team_eduar_1": "Eduar is a C/PHP developer with several years of experience in application development. He is one of the founders and lead developers of the Phalcon project which began in 2011.",
  "team_eduar_2": "He has taken part in all areas, from the framework design to the internal kernel functions, including documentation and developer tools. He is driven by a fascination with frameworks, languages and new technologies.",
  "team_eduar_3": "Eduar likes science fiction movies and sometimes plays football.",
  "team_nikolay_1": "Nikolay has been developing web applications for over 10 years. He has been involved in high performance as well as complex websites and designs.",
  "team_nikolay_2": "Nikolay has been working with Open Source projects for a long time, utilizing them whenever requirements allow. He thus started using his personal time to give back to the community, by forking projects, offering architectural changes and suggestions, as well as performance ones. He has been instrumental in improving Open Source CMS projects receiving positive feedback from the community.",
  "team_nikolay_3": "His continuous involvement with open source projects has helped him advance his technical knowledge while abiding by the give back to the community mentality.",
  "team_nikolay_4": "Nikolay is an avid supporter of maximizing performance in web applications. After his introduction to Phalcon, he decided to pursue and use the project and become an Evangelist for it. He is leading the effort toward the Russian community and offers resources for Russian speaking developers.",
  "team_nikolay_5": "His contributions include:  A mirror of the main website in Russian (<a href=':1:'>http://www.phalcon.ru</a>), a mirror of the documentation repository in Russian (<a href=':2:'>http://docs.phalconphp.ru</a>), ongoing changes and corrections to the documentation in English, a group in the social network Vkontakte (<a href=':3:'>https://vk.com/phalconphp</a>).",
  "team_nikos_1": "Nikos has been in the IT industry for over 20 years. He was introduced to the PHP world in 2000 and has been using it ever since in personal projects as well as projects for his employers.",
  "team_nikos_2": "He loves discovering new technologies and ways to integrate them with existing applications and thus reap the benefits they offer.",
  "team_nikos_3": "He is an avid supporter of Test Driven Development (TDD) and always tries to get full coverage in his code.",
  "team_nikos_4": "Nikos' continuing interest in new and innovative technologies breaking out of the norm introduced him to Phalcon. He joined the core team and his tasks mainly involve coordination of NFRs and bug fixes, help with tests, documentation and the incubator. Nikos is also responsible for maintaining the Windows DLLs for the project and offers support whenever possible.",
  "team_paul_1": "Paul considers himself very lucky to have spent the last decade of his life writing user-friendly software with the help of open source frameworks and tools like Phalcon. As a result, he spends his off-work hours trying to improve FOSS tools and the lives of other developers like himself. He has a strong need for simple code and self-evident UX, with Phalcon he focuses on documentation, new user experience, contributor relations, and community outreach.",
  "team_paul_2": "Paul recently started his own company to follow his passion of building intuitive software with emerging technologies like, ReactJS, Webpack, Ruby, and Elixir(Erlang). He now proudly adds Zephir and Phalcon to that ever growing list and is happy to take on the role of cheerleader, advocating their innovative features.",
  "team_paul_3": "On the chance he isn't coding, Paul is following in his wife's footsteps and developing his interest in videography and video production. He operates an educational YouTube channel currently focused on Phalcon and as needed as a Computer Science lecturer.",
  "team_serghei_1": "Serghei has been working as a Ruby/PHP developer for over 8 years and has been specializing in web application development. As a supporter and advocate of Behavior Driven Development (BDD) is also a member of the <a href=':1:'>Codeception</a> team.",
  "team_serghei_2": "Serghei can be found neck deep in innovative technologies which introduced him in Phalcon. He is responsible for the coordination of bug fixes, testing, developer tools, incubator and support other Phalcon-related projects.",
  "team_serghei_3": "When he's not working, Serghei enjoys watch documentaries, science fiction movies and sometimes plays Mahjong or Go.",
  "team_volodymyr_1": "Volodymyr has been developing server and web applications for over 20 years. He has been involved in designing and writing very complex and high performance software applications. Volodymyr’s passion for writing fast, robust and optimized software introduced him to Phalcon and he joined the development team.",
  "team_volodymyr_2": "In his free time Volodymyr enjoys the company of his beloved wife, contributes to open source projects, and studies foreign languages.",
  "template_engine_volt": "Шаблонізатор (Volt)",
  "template_engine_volt_1": "Volt є ультра-швидким та дружелюбним шаблонізатором, написаним на Zephir/C для PHP. Він надає вам набір інструментів для легкого написання представлень. Volt сильно інтегрований з іншими компонентами Phalcon. Та попри це ви можете використовувати його в якості самостійного компонента у вашому додатку.",
  "template_engine_volt_description": "Шаблонізатор, Jinja для PHP написаний на C",
  "template_engines": "Шаблонізатори",
  "template_engines_1": "Представлення - це користувацький інтерфейс вашої програми. Представлення часто є HTML-файлами в які вставлений PHP-код, який виконує завдання пов'язані з представленням даних. Представлення підготовлюють дані надсилання даних у браузер чи інший інструмент, який використовується для надсилання запитів з вашої програми.",
  "template_engines_description": "Представлення - це користувацький інтерфейс вашої програми",
  "testimonials": "Testimonials",
  "testimonials_1": "Greetings, Phalcon team! I have a project, built on Phalcon framework. It's a Guitarama (<a href=':1:'>:2:</a>) - guitars tabs and chords catalog. The site is aimed at the Russian audience, and uses the Russian language, but I hope, there will be no problem to understand most of pages. The site was re-launched on a new platform in the beginning of January, 2013 and has since shown steady growth. Current daily visits:  ~1500 unique visitors, ~5000 page views. The site is running on an old physical server 1хP4-3Ghz, 4GB RAM. Once again, thank you for a great framework and all what you are doing: )  Michael.",
  "testimonials_2": "Hello, Phalcon team. I would like to share with you our success story of using Phalcon in <a href=':1:'>:2:</a> and <a href=':3:'>:4:</a> projects, the most visited and highloaded sites in Kazakhstan, ranked in TOP-10 classified sites in the CIS. Both sites work on single RESTful-like API written on Phalcon\\Mvc\\Micro. On peak loads API processes something like 400 req/sec and this is not a limit. Moving to Phalcon allowed us to reduce response generation time and the consumption of CPU and RAM, as well as to reduce the time of development process. We will continue using Phalcon in our new projects. Thank you for the great work you are doing! Best regards, Nikita Vershinin, Lead Developer, Kolesa.kz and krisha.kz",
  "testimonials_3": "Phalcon Team, The framework you guys have created is amazing. I've never used a framework that has combined speed, efficiency, brevity, and naturality all in one package. I intend on championing and contributing back to the project in any way that I can. I embarked recently on an ~800 hour project and am happy to say that we are using Phalcon Framework. Bravo. Brian Seymour",
  "testimonials_4": "Hi guys, I just ran across Phalcon and it's just awesome! I've merely wanted to say to you how awesome you are! So, thanks for this framework and keep up the good work! Ivan Penchev",
  "testimonials_5": "Hi Guys, i wrote simple url-shortener service with phalcon. That was amazing! really. <a href=':1:'>:2:</a>. Demo is here: <a href=':3:'>:4:</a>) Murat Küçükosman",
  "testimonials_6": "Hello Phalcon Team, I created a small project designed for Polish users using your framework. I have to admit that the performance is amazing, congratulations good job. Service to validate the content of the web pages in Polish language <a href=':1:'>:2:</a>",
  "testimonials_7": "Hi guys! Just wanted to share with you the latest release of our old project - <a href=':1:'>:2: </a>. Switching to phalcon allowed us to halve the server load compared to the previous framework, which is great!",
  "testimonials_description": "Below is a collection of testimonials and success stories, from you, the developers and users of Phalcon PHP. We always welcome emails with success stories and will be posting those in our blog. If you wish to send us your success story or get in touch with us, feel free to mail us at <a href='mailto: :1:'>:2:</a>.",
  "toggle_navigation": "Toggle navigation",
  "transactions": "Транзакції",
  "transactions_1": "Коли процес виконує кілька операції з базами даних, інколи важливо, щоби кожен крок був успішно завершений та збережена цілісність даних. Транзакції дозволяють переконатися, що всі операції з базою даних були виконані успішно, перш ніж дані потраплять до самої бази даних.",
  "transactions_2": "Створення менеджера транзакцій",
  "transactions_3": "Запит транзакції",
  "transactions_4": "Отримаймо роботів, які потрібно видалити",
  "transactions_5": "Щось пішло не так, ми повинні відкотити транзакцію",
  "transactions_6": "Усе в порядку, давайте здійснимо транзакцію",
  "transactions_7": "Роботи були успішно видалені!",
  "transactions_8": "Невдача, причина: ",
  "transactions_description": "Транзакції в Phalcon дозволяють зберігати цілісність даних.",
  "try_phalcon": "Спробувати Phalcon",
  "tutorial": "Керівництво",
  "twitter": "Twitter",
  "views_and_frontend": "Представлення та фронтенд",
  "vimeo": "Vimeo",
  "watch_demo": "Перегляньте відео демонстрацію",
  "zephir": "Zephir"
}